FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bit 0 : Write '1' to enable interrupt for event END */
#define AAR_INTENSET_END_Pos                 ( 0UL )                           /*!< Position of END field. */
#define AAR_INTENSET_END_Msk                 ( 0x1UL << AAR_INTENSET_END_Pos ) /*!< Bit mask of END field. */
#define AAR_INTENSET_END_Disabled            ( 0UL )                           /*!< Read: Disabled */
#define AAR_INTENSET_END_Enabled             ( 1UL )                           /*!< Read: Enabled */
#define AAR_INTENSET_END_Set                 ( 1UL )                           /*!< Enable */

/* Register: AAR_INTENCLR */
/* Description: Disable interrupt */

/* Bit 2 : Write '1' to disable interrupt for event NOTRESOLVED */
#define AAR_INTENCLR_NOTRESOLVED_Pos         ( 2UL )                                   /*!< Position of NOTRESOLVED field. */
#define AAR_INTENCLR_NOTRESOLVED_Msk         ( 0x1UL << AAR_INTENCLR_NOTRESOLVED_Pos ) /*!< Bit mask of NOTRESOLVED field. */
#define AAR_INTENCLR_NOTRESOLVED_Disabled    ( 0UL )                                   /*!< Read: Disabled */
#define AAR_INTENCLR_NOTRESOLVED_Enabled     ( 1UL )                                   /*!< Read: Enabled */
#define AAR_INTENCLR_NOTRESOLVED_Clear       ( 1UL )                                   /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event RESOLVED */
#define AAR_INTENCLR_RESOLVED_Pos            ( 1UL )                                /*!< Position of RESOLVED field. */
#define AAR_INTENCLR_RESOLVED_Msk            ( 0x1UL << AAR_INTENCLR_RESOLVED_Pos ) /*!< Bit mask of RESOLVED field. */
#define AAR_INTENCLR_RESOLVED_Disabled       ( 0UL )                                /*!< Read: Disabled */
#define AAR_INTENCLR_RESOLVED_Enabled        ( 1UL )                                /*!< Read: Enabled */
#define AAR_INTENCLR_RESOLVED_Clear          ( 1UL )                                /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event END */
#define AAR_INTENCLR_END_Pos                 ( 0UL )                           /*!< Position of END field. */
#define AAR_INTENCLR_END_Msk                 ( 0x1UL << AAR_INTENCLR_END_Pos ) /*!< Bit mask of END field. */
#define AAR_INTENCLR_END_Disabled            ( 0UL )                           /*!< Read: Disabled */
#define AAR_INTENCLR_END_Enabled             ( 1UL )                           /*!< Read: Enabled */
#define AAR_INTENCLR_END_Clear               ( 1UL )                           /*!< Disable */

/* Register: AAR_STATUS */
/* Description: Resolution status */

/* Bits 3..0 : The IRK that was used last time an address was resolved */
#define AAR_STATUS_STATUS_Pos    ( 0UL )                            /*!< Position of STATUS field. */
#define AAR_STATUS_STATUS_Msk    ( 0xFUL << AAR_STATUS_STATUS_Pos ) /*!< Bit mask of STATUS field. */

/* Register: AAR_ENABLE */
/* Description: Enable AAR */

/* Bits 1..0 : Enable or disable AAR */
#define AAR_ENABLE_ENABLE_Pos         ( 0UL )                            /*!< Position of ENABLE field. */
#define AAR_ENABLE_ENABLE_Msk         ( 0x3UL << AAR_ENABLE_ENABLE_Pos ) /*!< Bit mask of ENABLE field. */
#define AAR_ENABLE_ENABLE_Disabled    ( 0UL )                            /*!< Disable */
#define AAR_ENABLE_ENABLE_Enabled     ( 3UL )                            /*!< Enable */

/* Register: AAR_NIRK */
/* Description: Number of IRKs */

/* Bits 4..0 : Number of Identity Root Keys available in the IRK data structure */
#define AAR_NIRK_NIRK_Pos    ( 0UL )                         /*!< Position of NIRK field. */
#define AAR_NIRK_NIRK_Msk    ( 0x1FUL << AAR_NIRK_NIRK_Pos ) /*!< Bit mask of NIRK field. */

/* Register: AAR_IRKPTR */
/* Description: Pointer to IRK data structure */

/* Bits 31..0 : Pointer to the IRK data structure */
#define AAR_IRKPTR_IRKPTR_Pos    ( 0UL )                                   /*!< Position of IRKPTR field. */
#define AAR_IRKPTR_IRKPTR_Msk    ( 0xFFFFFFFFUL << AAR_IRKPTR_IRKPTR_Pos ) /*!< Bit mask of IRKPTR field. */

/* Register: AAR_ADDRPTR */
/* Description: Pointer to the resolvable address */

/* Bits 31..0 : Pointer to the resolvable address (6-bytes) */
#define AAR_ADDRPTR_ADDRPTR_Pos    ( 0UL )                                     /*!< Position of ADDRPTR field. */
#define AAR_ADDRPTR_ADDRPTR_Msk    ( 0xFFFFFFFFUL << AAR_ADDRPTR_ADDRPTR_Pos ) /*!< Bit mask of ADDRPTR field. */

/* Register: AAR_SCRATCHPTR */
/* Description: Pointer to data area used for temporary storage */

/* Bits 31..0 : Pointer to a scratch data area used for temporary storage during resolution. A space of minimum 3 bytes must be reserved. */
#define AAR_SCRATCHPTR_SCRATCHPTR_Pos    ( 0UL )                                           /*!< Position of SCRATCHPTR field. */
#define AAR_SCRATCHPTR_SCRATCHPTR_Msk    ( 0xFFFFFFFFUL << AAR_SCRATCHPTR_SCRATCHPTR_Pos ) /*!< Bit mask of SCRATCHPTR field. */


/* Peripheral: ACL */
/* Description: Access control lists */

/* Register: ACL_ACL_ADDR */
/* Description: Description cluster: Start address of region to protect. The start address must be word-aligned. */

/* Bits 31..0 : Start address of flash region n. The start address must point to a flash page boundary. */
#define ACL_ACL_ADDR_ADDR_Pos    ( 0UL )                                   /*!< Position of ADDR field. */
#define ACL_ACL_ADDR_ADDR_Msk    ( 0xFFFFFFFFUL << ACL_ACL_ADDR_ADDR_Pos ) /*!< Bit mask of ADDR field. */

/* Register: ACL_ACL_SIZE */
/* Description: Description cluster: Size of region to protect counting from address ACL[n].ADDR. Writing a '0' has no effect. */

/* Bits 31..0 : Size of flash region n in bytes. Must be a multiple of the flash page size. */
#define ACL_ACL_SIZE_SIZE_Pos    ( 0UL )                                   /*!< Position of SIZE field. */
#define ACL_ACL_SIZE_SIZE_Msk    ( 0xFFFFFFFFUL << ACL_ACL_SIZE_SIZE_Pos ) /*!< Bit mask of SIZE field. */

/* Register: ACL_ACL_PERM */
/* Description: Description cluster: Access permissions for region n as defined by start address ACL[n].ADDR and size ACL[n].SIZE */

