FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bit 2 : Configure read permissions for region n. Writing a '0' has no effect. */
#define ACL_ACL_PERM_READ_Pos         ( 2UL )                            /*!< Position of READ field. */
#define ACL_ACL_PERM_READ_Msk         ( 0x1UL << ACL_ACL_PERM_READ_Pos ) /*!< Bit mask of READ field. */
#define ACL_ACL_PERM_READ_Enable      ( 0UL )                            /*!< Allow read instructions to region n. */
#define ACL_ACL_PERM_READ_Disable     ( 1UL )                            /*!< Block read instructions to region n. */

/* Bit 1 : Configure write and erase permissions for region n. Writing a '0' has no effect. */
#define ACL_ACL_PERM_WRITE_Pos        ( 1UL )                             /*!< Position of WRITE field. */
#define ACL_ACL_PERM_WRITE_Msk        ( 0x1UL << ACL_ACL_PERM_WRITE_Pos ) /*!< Bit mask of WRITE field. */
#define ACL_ACL_PERM_WRITE_Enable     ( 0UL )                             /*!< Allow write and erase instructions to region n. */
#define ACL_ACL_PERM_WRITE_Disable    ( 1UL )                             /*!< Block write and erase instructions to region n. */


/* Peripheral: APPROTECT */
/* Description: Access Port Protection */

/* Register: APPROTECT_FORCEPROTECT */
/* Description: Software force enable APPROTECT mechanism until next reset. */

/* Bits 7..0 : Write 0x0 to force enable APPROTECT mechanism */
#define APPROTECT_FORCEPROTECT_FORCEPROTECT_Pos      ( 0UL )                                               /*!< Position of FORCEPROTECT field. */
#define APPROTECT_FORCEPROTECT_FORCEPROTECT_Msk      ( 0xFFUL << APPROTECT_FORCEPROTECT_FORCEPROTECT_Pos ) /*!< Bit mask of FORCEPROTECT field. */
#define APPROTECT_FORCEPROTECT_FORCEPROTECT_Force    ( 0x0UL )                                             /*!< Software force enable APPROTECT mechanism */

/* Register: APPROTECT_DISABLE */
/* Description: Software disable APPROTECT mechanism */

/* Bits 7..0 : Software disable APPROTECT mechanism */
#define APPROTECT_DISABLE_DISABLE_Pos          ( 0UL )                                     /*!< Position of DISABLE field. */
#define APPROTECT_DISABLE_DISABLE_Msk          ( 0xFFUL << APPROTECT_DISABLE_DISABLE_Pos ) /*!< Bit mask of DISABLE field. */
#define APPROTECT_DISABLE_DISABLE_SwDisable    ( 0x5AUL )                                  /*!< Software disable APPROTECT mechanism */


/* Peripheral: CCM */
/* Description: AES CCM mode encryption */

/* Register: CCM_TASKS_KSGEN */
/* Description: Start generation of keystream. This operation will stop by itself when completed. */

/* Bit 0 : Start generation of keystream. This operation will stop by itself when completed. */
#define CCM_TASKS_KSGEN_TASKS_KSGEN_Pos        ( 0UL )                                      /*!< Position of TASKS_KSGEN field. */
#define CCM_TASKS_KSGEN_TASKS_KSGEN_Msk        ( 0x1UL << CCM_TASKS_KSGEN_TASKS_KSGEN_Pos ) /*!< Bit mask of TASKS_KSGEN field. */
#define CCM_TASKS_KSGEN_TASKS_KSGEN_Trigger    ( 1UL )                                      /*!< Trigger task */

/* Register: CCM_TASKS_CRYPT */
/* Description: Start encryption/decryption. This operation will stop by itself when completed. */

/* Bit 0 : Start encryption/decryption. This operation will stop by itself when completed. */
#define CCM_TASKS_CRYPT_TASKS_CRYPT_Pos        ( 0UL )                                      /*!< Position of TASKS_CRYPT field. */
#define CCM_TASKS_CRYPT_TASKS_CRYPT_Msk        ( 0x1UL << CCM_TASKS_CRYPT_TASKS_CRYPT_Pos ) /*!< Bit mask of TASKS_CRYPT field. */
#define CCM_TASKS_CRYPT_TASKS_CRYPT_Trigger    ( 1UL )                                      /*!< Trigger task */

/* Register: CCM_TASKS_STOP */
/* Description: Stop encryption/decryption */

/* Bit 0 : Stop encryption/decryption */
#define CCM_TASKS_STOP_TASKS_STOP_Pos        ( 0UL )                                    /*!< Position of TASKS_STOP field. */
#define CCM_TASKS_STOP_TASKS_STOP_Msk        ( 0x1UL << CCM_TASKS_STOP_TASKS_STOP_Pos ) /*!< Bit mask of TASKS_STOP field. */
#define CCM_TASKS_STOP_TASKS_STOP_Trigger    ( 1UL )                                    /*!< Trigger task */

/* Register: CCM_TASKS_RATEOVERRIDE */
/* Description: Override DATARATE setting in MODE register with the contents of the RATEOVERRIDE register for any ongoing encryption/decryption */

/* Bit 0 : Override DATARATE setting in MODE register with the contents of the RATEOVERRIDE register for any ongoing encryption/decryption */
#define CCM_TASKS_RATEOVERRIDE_TASKS_RATEOVERRIDE_Pos        ( 0UL )                                                    /*!< Position of TASKS_RATEOVERRIDE field. */
#define CCM_TASKS_RATEOVERRIDE_TASKS_RATEOVERRIDE_Msk        ( 0x1UL << CCM_TASKS_RATEOVERRIDE_TASKS_RATEOVERRIDE_Pos ) /*!< Bit mask of TASKS_RATEOVERRIDE field. */
#define CCM_TASKS_RATEOVERRIDE_TASKS_RATEOVERRIDE_Trigger    ( 1UL )                                                    /*!< Trigger task */

/* Register: CCM_EVENTS_ENDKSGEN */
/* Description: Keystream generation complete */

/* Bit 0 : Keystream generation complete */
#define CCM_EVENTS_ENDKSGEN_EVENTS_ENDKSGEN_Pos             ( 0UL )                                              /*!< Position of EVENTS_ENDKSGEN field. */
#define CCM_EVENTS_ENDKSGEN_EVENTS_ENDKSGEN_Msk             ( 0x1UL << CCM_EVENTS_ENDKSGEN_EVENTS_ENDKSGEN_Pos ) /*!< Bit mask of EVENTS_ENDKSGEN field. */
#define CCM_EVENTS_ENDKSGEN_EVENTS_ENDKSGEN_NotGenerated    ( 0UL )                                              /*!< Event not generated */
#define CCM_EVENTS_ENDKSGEN_EVENTS_ENDKSGEN_Generated       ( 1UL )                                              /*!< Event generated */

/* Register: CCM_EVENTS_ENDCRYPT */
/* Description: Encrypt/decrypt complete */

/* Bit 0 : Encrypt/decrypt complete */
#define CCM_EVENTS_ENDCRYPT_EVENTS_ENDCRYPT_Pos             ( 0UL )                                              /*!< Position of EVENTS_ENDCRYPT field. */
#define CCM_EVENTS_ENDCRYPT_EVENTS_ENDCRYPT_Msk             ( 0x1UL << CCM_EVENTS_ENDCRYPT_EVENTS_ENDCRYPT_Pos ) /*!< Bit mask of EVENTS_ENDCRYPT field. */
#define CCM_EVENTS_ENDCRYPT_EVENTS_ENDCRYPT_NotGenerated    ( 0UL )                                              /*!< Event not generated */
#define CCM_EVENTS_ENDCRYPT_EVENTS_ENDCRYPT_Generated       ( 1UL )                                              /*!< Event generated */

