FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Register: CCM_EVENTS_ERROR */
/* Description: Deprecated register - CCM error event */

/* Bit 0 : Deprecated field -  CCM error event */
#define CCM_EVENTS_ERROR_EVENTS_ERROR_Pos             ( 0UL )                                        /*!< Position of EVENTS_ERROR field. */
#define CCM_EVENTS_ERROR_EVENTS_ERROR_Msk             ( 0x1UL << CCM_EVENTS_ERROR_EVENTS_ERROR_Pos ) /*!< Bit mask of EVENTS_ERROR field. */
#define CCM_EVENTS_ERROR_EVENTS_ERROR_NotGenerated    ( 0UL )                                        /*!< Event not generated */
#define CCM_EVENTS_ERROR_EVENTS_ERROR_Generated       ( 1UL )                                        /*!< Event generated */

/* Register: CCM_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 0 : Shortcut between event ENDKSGEN and task CRYPT */
#define CCM_SHORTS_ENDKSGEN_CRYPT_Pos         ( 0UL )                                    /*!< Position of ENDKSGEN_CRYPT field. */
#define CCM_SHORTS_ENDKSGEN_CRYPT_Msk         ( 0x1UL << CCM_SHORTS_ENDKSGEN_CRYPT_Pos ) /*!< Bit mask of ENDKSGEN_CRYPT field. */
#define CCM_SHORTS_ENDKSGEN_CRYPT_Disabled    ( 0UL )                                    /*!< Disable shortcut */
#define CCM_SHORTS_ENDKSGEN_CRYPT_Enabled     ( 1UL )                                    /*!< Enable shortcut */

/* Register: CCM_INTENSET */
/* Description: Enable interrupt */

/* Bit 2 : Deprecated intsetfield -  Write '1' to enable interrupt for event ERROR */
#define CCM_INTENSET_ERROR_Pos            ( 2UL )                             /*!< Position of ERROR field. */
#define CCM_INTENSET_ERROR_Msk            ( 0x1UL << CCM_INTENSET_ERROR_Pos ) /*!< Bit mask of ERROR field. */
#define CCM_INTENSET_ERROR_Disabled       ( 0UL )                             /*!< Read: Disabled */
#define CCM_INTENSET_ERROR_Enabled        ( 1UL )                             /*!< Read: Enabled */
#define CCM_INTENSET_ERROR_Set            ( 1UL )                             /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event ENDCRYPT */
#define CCM_INTENSET_ENDCRYPT_Pos         ( 1UL )                                /*!< Position of ENDCRYPT field. */
#define CCM_INTENSET_ENDCRYPT_Msk         ( 0x1UL << CCM_INTENSET_ENDCRYPT_Pos ) /*!< Bit mask of ENDCRYPT field. */
#define CCM_INTENSET_ENDCRYPT_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define CCM_INTENSET_ENDCRYPT_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define CCM_INTENSET_ENDCRYPT_Set         ( 1UL )                                /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event ENDKSGEN */
#define CCM_INTENSET_ENDKSGEN_Pos         ( 0UL )                                /*!< Position of ENDKSGEN field. */
#define CCM_INTENSET_ENDKSGEN_Msk         ( 0x1UL << CCM_INTENSET_ENDKSGEN_Pos ) /*!< Bit mask of ENDKSGEN field. */
#define CCM_INTENSET_ENDKSGEN_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define CCM_INTENSET_ENDKSGEN_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define CCM_INTENSET_ENDKSGEN_Set         ( 1UL )                                /*!< Enable */

/* Register: CCM_INTENCLR */
/* Description: Disable interrupt */

/* Bit 2 : Deprecated intclrfield -  Write '1' to disable interrupt for event ERROR */
#define CCM_INTENCLR_ERROR_Pos            ( 2UL )                             /*!< Position of ERROR field. */
#define CCM_INTENCLR_ERROR_Msk            ( 0x1UL << CCM_INTENCLR_ERROR_Pos ) /*!< Bit mask of ERROR field. */
#define CCM_INTENCLR_ERROR_Disabled       ( 0UL )                             /*!< Read: Disabled */
#define CCM_INTENCLR_ERROR_Enabled        ( 1UL )                             /*!< Read: Enabled */
#define CCM_INTENCLR_ERROR_Clear          ( 1UL )                             /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event ENDCRYPT */
#define CCM_INTENCLR_ENDCRYPT_Pos         ( 1UL )                                /*!< Position of ENDCRYPT field. */
#define CCM_INTENCLR_ENDCRYPT_Msk         ( 0x1UL << CCM_INTENCLR_ENDCRYPT_Pos ) /*!< Bit mask of ENDCRYPT field. */
#define CCM_INTENCLR_ENDCRYPT_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define CCM_INTENCLR_ENDCRYPT_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define CCM_INTENCLR_ENDCRYPT_Clear       ( 1UL )                                /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event ENDKSGEN */
#define CCM_INTENCLR_ENDKSGEN_Pos         ( 0UL )                                /*!< Position of ENDKSGEN field. */
#define CCM_INTENCLR_ENDKSGEN_Msk         ( 0x1UL << CCM_INTENCLR_ENDKSGEN_Pos ) /*!< Bit mask of ENDKSGEN field. */
#define CCM_INTENCLR_ENDKSGEN_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define CCM_INTENCLR_ENDKSGEN_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define CCM_INTENCLR_ENDKSGEN_Clear       ( 1UL )                                /*!< Disable */

/* Register: CCM_MICSTATUS */
/* Description: MIC check result */

/* Bit 0 : The result of the MIC check performed during the previous decryption operation */
#define CCM_MICSTATUS_MICSTATUS_Pos            ( 0UL )                                  /*!< Position of MICSTATUS field. */
#define CCM_MICSTATUS_MICSTATUS_Msk            ( 0x1UL << CCM_MICSTATUS_MICSTATUS_Pos ) /*!< Bit mask of MICSTATUS field. */
#define CCM_MICSTATUS_MICSTATUS_CheckFailed    ( 0UL )                                  /*!< MIC check failed */
#define CCM_MICSTATUS_MICSTATUS_CheckPassed    ( 1UL )                                  /*!< MIC check passed */

/* Register: CCM_ENABLE */
/* Description: Enable */

/* Bits 1..0 : Enable or disable CCM */
#define CCM_ENABLE_ENABLE_Pos         ( 0UL )                            /*!< Position of ENABLE field. */
#define CCM_ENABLE_ENABLE_Msk         ( 0x3UL << CCM_ENABLE_ENABLE_Pos ) /*!< Bit mask of ENABLE field. */
#define CCM_ENABLE_ENABLE_Disabled    ( 0UL )                            /*!< Disable */
#define CCM_ENABLE_ENABLE_Enabled     ( 2UL )                            /*!< Enable */

/* Register: CCM_MODE */
/* Description: Operation mode */

/* Bit 24 : Packet length configuration */
#define CCM_MODE_LENGTH_Pos          ( 24UL )                         /*!< Position of LENGTH field. */
#define CCM_MODE_LENGTH_Msk          ( 0x1UL << CCM_MODE_LENGTH_Pos ) /*!< Bit mask of LENGTH field. */
#define CCM_MODE_LENGTH_Default      ( 0UL )                          /*!< Default length. Effective length of LENGTH field in encrypted/decrypted packet is 5 bits. A keystream for packet payloads up to 27 bytes will be generated. */
#define CCM_MODE_LENGTH_Extended     ( 1UL )                          /*!< Extended length. Effective length of LENGTH field in encrypted/decrypted packet is 8 bits. A keystream for packet payloads up to MAXPACKETSIZE bytes will be generated. */

/* Bits 17..16 : Radio data rate that the CCM shall run synchronous with */
#define CCM_MODE_DATARATE_Pos        ( 16UL )                           /*!< Position of DATARATE field. */
#define CCM_MODE_DATARATE_Msk        ( 0x3UL << CCM_MODE_DATARATE_Pos ) /*!< Bit mask of DATARATE field. */
#define CCM_MODE_DATARATE_1Mbit      ( 0UL )                            /*!< 1 Mbps */
#define CCM_MODE_DATARATE_2Mbit      ( 1UL )                            /*!< 2 Mbps */
#define CCM_MODE_DATARATE_125Kbps    ( 2UL )                            /*!< 125 kbps */
#define CCM_MODE_DATARATE_500Kbps    ( 3UL )                            /*!< 500 kbps */

/* Bit 0 : The mode of operation to be used. Settings in this register apply whenever either the KSGEN task or the CRYPT task is triggered. */
#define CCM_MODE_MODE_Pos            ( 0UL )                        /*!< Position of MODE field. */
#define CCM_MODE_MODE_Msk            ( 0x1UL << CCM_MODE_MODE_Pos ) /*!< Bit mask of MODE field. */
#define CCM_MODE_MODE_Encryption     ( 0UL )                        /*!< AES CCM packet encryption mode */
#define CCM_MODE_MODE_Decryption     ( 1UL )                        /*!< AES CCM packet decryption mode */

