FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bit 10 : Write '1' to enable interrupt for event CTSTARTED */
#define CLOCK_INTENSET_CTSTARTED_Pos            ( 10UL )                                  /*!< Position of CTSTARTED field. */
#define CLOCK_INTENSET_CTSTARTED_Msk            ( 0x1UL << CLOCK_INTENSET_CTSTARTED_Pos ) /*!< Bit mask of CTSTARTED field. */
#define CLOCK_INTENSET_CTSTARTED_Disabled       ( 0UL )                                   /*!< Read: Disabled */
#define CLOCK_INTENSET_CTSTARTED_Enabled        ( 1UL )                                   /*!< Read: Enabled */
#define CLOCK_INTENSET_CTSTARTED_Set            ( 1UL )                                   /*!< Enable */

/* Bit 4 : Write '1' to enable interrupt for event CTTO */
#define CLOCK_INTENSET_CTTO_Pos                 ( 4UL )                              /*!< Position of CTTO field. */
#define CLOCK_INTENSET_CTTO_Msk                 ( 0x1UL << CLOCK_INTENSET_CTTO_Pos ) /*!< Bit mask of CTTO field. */
#define CLOCK_INTENSET_CTTO_Disabled            ( 0UL )                              /*!< Read: Disabled */
#define CLOCK_INTENSET_CTTO_Enabled             ( 1UL )                              /*!< Read: Enabled */
#define CLOCK_INTENSET_CTTO_Set                 ( 1UL )                              /*!< Enable */

/* Bit 3 : Write '1' to enable interrupt for event DONE */
#define CLOCK_INTENSET_DONE_Pos                 ( 3UL )                              /*!< Position of DONE field. */
#define CLOCK_INTENSET_DONE_Msk                 ( 0x1UL << CLOCK_INTENSET_DONE_Pos ) /*!< Bit mask of DONE field. */
#define CLOCK_INTENSET_DONE_Disabled            ( 0UL )                              /*!< Read: Disabled */
#define CLOCK_INTENSET_DONE_Enabled             ( 1UL )                              /*!< Read: Enabled */
#define CLOCK_INTENSET_DONE_Set                 ( 1UL )                              /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event LFCLKSTARTED */
#define CLOCK_INTENSET_LFCLKSTARTED_Pos         ( 1UL )                                      /*!< Position of LFCLKSTARTED field. */
#define CLOCK_INTENSET_LFCLKSTARTED_Msk         ( 0x1UL << CLOCK_INTENSET_LFCLKSTARTED_Pos ) /*!< Bit mask of LFCLKSTARTED field. */
#define CLOCK_INTENSET_LFCLKSTARTED_Disabled    ( 0UL )                                      /*!< Read: Disabled */
#define CLOCK_INTENSET_LFCLKSTARTED_Enabled     ( 1UL )                                      /*!< Read: Enabled */
#define CLOCK_INTENSET_LFCLKSTARTED_Set         ( 1UL )                                      /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event HFCLKSTARTED */
#define CLOCK_INTENSET_HFCLKSTARTED_Pos         ( 0UL )                                      /*!< Position of HFCLKSTARTED field. */
#define CLOCK_INTENSET_HFCLKSTARTED_Msk         ( 0x1UL << CLOCK_INTENSET_HFCLKSTARTED_Pos ) /*!< Bit mask of HFCLKSTARTED field. */
#define CLOCK_INTENSET_HFCLKSTARTED_Disabled    ( 0UL )                                      /*!< Read: Disabled */
#define CLOCK_INTENSET_HFCLKSTARTED_Enabled     ( 1UL )                                      /*!< Read: Enabled */
#define CLOCK_INTENSET_HFCLKSTARTED_Set         ( 1UL )                                      /*!< Enable */

/* Register: CLOCK_INTENCLR */
/* Description: Disable interrupt */

/* Bit 11 : Write '1' to disable interrupt for event CTSTOPPED */
#define CLOCK_INTENCLR_CTSTOPPED_Pos            ( 11UL )                                  /*!< Position of CTSTOPPED field. */
#define CLOCK_INTENCLR_CTSTOPPED_Msk            ( 0x1UL << CLOCK_INTENCLR_CTSTOPPED_Pos ) /*!< Bit mask of CTSTOPPED field. */
#define CLOCK_INTENCLR_CTSTOPPED_Disabled       ( 0UL )                                   /*!< Read: Disabled */
#define CLOCK_INTENCLR_CTSTOPPED_Enabled        ( 1UL )                                   /*!< Read: Enabled */
#define CLOCK_INTENCLR_CTSTOPPED_Clear          ( 1UL )                                   /*!< Disable */

/* Bit 10 : Write '1' to disable interrupt for event CTSTARTED */
#define CLOCK_INTENCLR_CTSTARTED_Pos            ( 10UL )                                  /*!< Position of CTSTARTED field. */
#define CLOCK_INTENCLR_CTSTARTED_Msk            ( 0x1UL << CLOCK_INTENCLR_CTSTARTED_Pos ) /*!< Bit mask of CTSTARTED field. */
#define CLOCK_INTENCLR_CTSTARTED_Disabled       ( 0UL )                                   /*!< Read: Disabled */
#define CLOCK_INTENCLR_CTSTARTED_Enabled        ( 1UL )                                   /*!< Read: Enabled */
#define CLOCK_INTENCLR_CTSTARTED_Clear          ( 1UL )                                   /*!< Disable */

/* Bit 4 : Write '1' to disable interrupt for event CTTO */
#define CLOCK_INTENCLR_CTTO_Pos                 ( 4UL )                              /*!< Position of CTTO field. */
#define CLOCK_INTENCLR_CTTO_Msk                 ( 0x1UL << CLOCK_INTENCLR_CTTO_Pos ) /*!< Bit mask of CTTO field. */
#define CLOCK_INTENCLR_CTTO_Disabled            ( 0UL )                              /*!< Read: Disabled */
#define CLOCK_INTENCLR_CTTO_Enabled             ( 1UL )                              /*!< Read: Enabled */
#define CLOCK_INTENCLR_CTTO_Clear               ( 1UL )                              /*!< Disable */

/* Bit 3 : Write '1' to disable interrupt for event DONE */
#define CLOCK_INTENCLR_DONE_Pos                 ( 3UL )                              /*!< Position of DONE field. */
#define CLOCK_INTENCLR_DONE_Msk                 ( 0x1UL << CLOCK_INTENCLR_DONE_Pos ) /*!< Bit mask of DONE field. */
#define CLOCK_INTENCLR_DONE_Disabled            ( 0UL )                              /*!< Read: Disabled */
#define CLOCK_INTENCLR_DONE_Enabled             ( 1UL )                              /*!< Read: Enabled */
#define CLOCK_INTENCLR_DONE_Clear               ( 1UL )                              /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event LFCLKSTARTED */
#define CLOCK_INTENCLR_LFCLKSTARTED_Pos         ( 1UL )                                      /*!< Position of LFCLKSTARTED field. */
#define CLOCK_INTENCLR_LFCLKSTARTED_Msk         ( 0x1UL << CLOCK_INTENCLR_LFCLKSTARTED_Pos ) /*!< Bit mask of LFCLKSTARTED field. */
#define CLOCK_INTENCLR_LFCLKSTARTED_Disabled    ( 0UL )                                      /*!< Read: Disabled */
#define CLOCK_INTENCLR_LFCLKSTARTED_Enabled     ( 1UL )                                      /*!< Read: Enabled */
#define CLOCK_INTENCLR_LFCLKSTARTED_Clear       ( 1UL )                                      /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event HFCLKSTARTED */
#define CLOCK_INTENCLR_HFCLKSTARTED_Pos         ( 0UL )                                      /*!< Position of HFCLKSTARTED field. */
#define CLOCK_INTENCLR_HFCLKSTARTED_Msk         ( 0x1UL << CLOCK_INTENCLR_HFCLKSTARTED_Pos ) /*!< Bit mask of HFCLKSTARTED field. */
#define CLOCK_INTENCLR_HFCLKSTARTED_Disabled    ( 0UL )                                      /*!< Read: Disabled */
#define CLOCK_INTENCLR_HFCLKSTARTED_Enabled     ( 1UL )                                      /*!< Read: Enabled */
#define CLOCK_INTENCLR_HFCLKSTARTED_Clear       ( 1UL )                                      /*!< Disable */

/* Register: CLOCK_HFCLKRUN */
/* Description: Status indicating that HFCLKSTART task has been triggered */

/* Bit 0 : HFCLKSTART task triggered or not */
#define CLOCK_HFCLKRUN_STATUS_Pos             ( 0UL )                                /*!< Position of STATUS field. */
#define CLOCK_HFCLKRUN_STATUS_Msk             ( 0x1UL << CLOCK_HFCLKRUN_STATUS_Pos ) /*!< Bit mask of STATUS field. */
#define CLOCK_HFCLKRUN_STATUS_NotTriggered    ( 0UL )                                /*!< Task not triggered */
#define CLOCK_HFCLKRUN_STATUS_Triggered       ( 1UL )                                /*!< Task triggered */

