FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Register: CLOCK_HFCLKSTAT */
/* Description: HFCLK status */

/* Bit 16 : HFCLK state */
#define CLOCK_HFCLKSTAT_STATE_Pos           ( 16UL )                               /*!< Position of STATE field. */
#define CLOCK_HFCLKSTAT_STATE_Msk           ( 0x1UL << CLOCK_HFCLKSTAT_STATE_Pos ) /*!< Bit mask of STATE field. */
#define CLOCK_HFCLKSTAT_STATE_NotRunning    ( 0UL )                                /*!< HFCLK not running */
#define CLOCK_HFCLKSTAT_STATE_Running       ( 1UL )                                /*!< HFCLK running */

/* Bit 0 : Source of HFCLK */
#define CLOCK_HFCLKSTAT_SRC_Pos             ( 0UL )                              /*!< Position of SRC field. */
#define CLOCK_HFCLKSTAT_SRC_Msk             ( 0x1UL << CLOCK_HFCLKSTAT_SRC_Pos ) /*!< Bit mask of SRC field. */
#define CLOCK_HFCLKSTAT_SRC_RC              ( 0UL )                              /*!< 64 MHz internal oscillator (HFINT) */
#define CLOCK_HFCLKSTAT_SRC_Xtal            ( 1UL )                              /*!< 64 MHz crystal oscillator (HFXO) */

/* Register: CLOCK_LFCLKRUN */
/* Description: Status indicating that LFCLKSTART task has been triggered */

/* Bit 0 : LFCLKSTART task triggered or not */
#define CLOCK_LFCLKRUN_STATUS_Pos             ( 0UL )                                /*!< Position of STATUS field. */
#define CLOCK_LFCLKRUN_STATUS_Msk             ( 0x1UL << CLOCK_LFCLKRUN_STATUS_Pos ) /*!< Bit mask of STATUS field. */
#define CLOCK_LFCLKRUN_STATUS_NotTriggered    ( 0UL )                                /*!< Task not triggered */
#define CLOCK_LFCLKRUN_STATUS_Triggered       ( 1UL )                                /*!< Task triggered */

/* Register: CLOCK_LFCLKSTAT */
/* Description: LFCLK status */

/* Bit 16 : LFCLK state */
#define CLOCK_LFCLKSTAT_STATE_Pos           ( 16UL )                               /*!< Position of STATE field. */
#define CLOCK_LFCLKSTAT_STATE_Msk           ( 0x1UL << CLOCK_LFCLKSTAT_STATE_Pos ) /*!< Bit mask of STATE field. */
#define CLOCK_LFCLKSTAT_STATE_NotRunning    ( 0UL )                                /*!< LFCLK not running */
#define CLOCK_LFCLKSTAT_STATE_Running       ( 1UL )                                /*!< LFCLK running */

/* Bits 1..0 : Source of LFCLK */
#define CLOCK_LFCLKSTAT_SRC_Pos             ( 0UL )                              /*!< Position of SRC field. */
#define CLOCK_LFCLKSTAT_SRC_Msk             ( 0x3UL << CLOCK_LFCLKSTAT_SRC_Pos ) /*!< Bit mask of SRC field. */
#define CLOCK_LFCLKSTAT_SRC_RC              ( 0UL )                              /*!< 32.768 kHz RC oscillator (LFRC) */
#define CLOCK_LFCLKSTAT_SRC_Xtal            ( 1UL )                              /*!< 32.768 kHz crystal oscillator (LFXO) */
#define CLOCK_LFCLKSTAT_SRC_Synth           ( 2UL )                              /*!< 32.768 kHz synthesized from HFCLK (LFSYNT) */

/* Register: CLOCK_LFCLKSRCCOPY */
/* Description: Copy of LFCLKSRC register, set when LFCLKSTART task was triggered */

/* Bits 1..0 : Clock source */
#define CLOCK_LFCLKSRCCOPY_SRC_Pos      ( 0UL )                                 /*!< Position of SRC field. */
#define CLOCK_LFCLKSRCCOPY_SRC_Msk      ( 0x3UL << CLOCK_LFCLKSRCCOPY_SRC_Pos ) /*!< Bit mask of SRC field. */
#define CLOCK_LFCLKSRCCOPY_SRC_RC       ( 0UL )                                 /*!< 32.768 kHz RC oscillator (LFRC) */
#define CLOCK_LFCLKSRCCOPY_SRC_Xtal     ( 1UL )                                 /*!< 32.768 kHz crystal oscillator (LFXO) */
#define CLOCK_LFCLKSRCCOPY_SRC_Synth    ( 2UL )                                 /*!< 32.768 kHz synthesized from HFCLK (LFSYNT) */

/* Register: CLOCK_LFCLKSRC */
/* Description: Clock source for the LFCLK */

/* Bit 17 : Enable or disable external source for LFCLK */
#define CLOCK_LFCLKSRC_EXTERNAL_Pos         ( 17UL )                                 /*!< Position of EXTERNAL field. */
#define CLOCK_LFCLKSRC_EXTERNAL_Msk         ( 0x1UL << CLOCK_LFCLKSRC_EXTERNAL_Pos ) /*!< Bit mask of EXTERNAL field. */
#define CLOCK_LFCLKSRC_EXTERNAL_Disabled    ( 0UL )                                  /*!< Disable external source (use with Xtal) */
#define CLOCK_LFCLKSRC_EXTERNAL_Enabled     ( 1UL )                                  /*!< Enable use of external source instead of Xtal (SRC needs to be set to Xtal) */

/* Bit 16 : Enable or disable bypass of LFCLK crystal oscillator with external clock source */
#define CLOCK_LFCLKSRC_BYPASS_Pos           ( 16UL )                               /*!< Position of BYPASS field. */
#define CLOCK_LFCLKSRC_BYPASS_Msk           ( 0x1UL << CLOCK_LFCLKSRC_BYPASS_Pos ) /*!< Bit mask of BYPASS field. */
#define CLOCK_LFCLKSRC_BYPASS_Disabled      ( 0UL )                                /*!< Disable (use with Xtal or low-swing external source) */
#define CLOCK_LFCLKSRC_BYPASS_Enabled       ( 1UL )                                /*!< Enable (use with rail-to-rail external source) */

/* Bits 1..0 : Clock source */
#define CLOCK_LFCLKSRC_SRC_Pos              ( 0UL )                             /*!< Position of SRC field. */
#define CLOCK_LFCLKSRC_SRC_Msk              ( 0x3UL << CLOCK_LFCLKSRC_SRC_Pos ) /*!< Bit mask of SRC field. */
#define CLOCK_LFCLKSRC_SRC_RC               ( 0UL )                             /*!< 32.768 kHz RC oscillator (LFRC) */
#define CLOCK_LFCLKSRC_SRC_Xtal             ( 1UL )                             /*!< 32.768 kHz crystal oscillator (LFXO) */
#define CLOCK_LFCLKSRC_SRC_Synth            ( 2UL )                             /*!< 32.768 kHz synthesized from HFCLK (LFSYNT) */

/* Register: CLOCK_HFXODEBOUNCE */
/* Description: HFXO debounce time. The HFXO is started by triggering the TASKS_HFCLKSTART task. */

/* Bits 7..0 : HFXO debounce time. Debounce time = HFXODEBOUNCE * 16 us. */
#define CLOCK_HFXODEBOUNCE_HFXODEBOUNCE_Pos         ( 0UL )                                           /*!< Position of HFXODEBOUNCE field. */
#define CLOCK_HFXODEBOUNCE_HFXODEBOUNCE_Msk         ( 0xFFUL << CLOCK_HFXODEBOUNCE_HFXODEBOUNCE_Pos ) /*!< Bit mask of HFXODEBOUNCE field. */
#define CLOCK_HFXODEBOUNCE_HFXODEBOUNCE_Db256us     ( 0x10UL )                                        /*!< 256 us debounce time. Recommended for 1.6 mm x 2.0 mm crystals and larger. */
#define CLOCK_HFXODEBOUNCE_HFXODEBOUNCE_Db1024us    ( 0x40UL )                                        /*!< 1024 us debounce time. Recommended for 1.6 mm x 1.2 mm crystals and smaller. */

