FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Register: CLOCK_LFXODEBOUNCE */
/* Description: LFXO debounce time. The LFXO is started by triggering the TASKS_LFCLKSTART task when the LFCLKSRC register is configured for Xtal. */

/* Bit 0 : LFXO debounce time. */
#define CLOCK_LFXODEBOUNCE_LFXODEBOUNCE_Pos         ( 0UL )                                          /*!< Position of LFXODEBOUNCE field. */
#define CLOCK_LFXODEBOUNCE_LFXODEBOUNCE_Msk         ( 0x1UL << CLOCK_LFXODEBOUNCE_LFXODEBOUNCE_Pos ) /*!< Bit mask of LFXODEBOUNCE field. */
#define CLOCK_LFXODEBOUNCE_LFXODEBOUNCE_Normal      ( 0UL )                                          /*!< 8192 32.768 kHz periods, or 0.25 s. Recommended for normal Operating Temperature conditions. */
#define CLOCK_LFXODEBOUNCE_LFXODEBOUNCE_Extended    ( 1UL )                                          /*!< 16384 32.768 kHz periods, or 0.5 s. Recommended for Extended Operating Temperature conditions. */

/* Register: CLOCK_CTIV */
/* Description: Calibration timer interval */

/* Bits 6..0 : Calibration timer interval in multiple of 0.25 seconds. Range: 0.25 seconds to 31.75 seconds. */
#define CLOCK_CTIV_CTIV_Pos    ( 0UL )                           /*!< Position of CTIV field. */
#define CLOCK_CTIV_CTIV_Msk    ( 0x7FUL << CLOCK_CTIV_CTIV_Pos ) /*!< Bit mask of CTIV field. */


/* Peripheral: COMP */
/* Description: Comparator */

/* Register: COMP_TASKS_START */
/* Description: Start comparator */

/* Bit 0 : Start comparator */
#define COMP_TASKS_START_TASKS_START_Pos        ( 0UL )                                       /*!< Position of TASKS_START field. */
#define COMP_TASKS_START_TASKS_START_Msk        ( 0x1UL << COMP_TASKS_START_TASKS_START_Pos ) /*!< Bit mask of TASKS_START field. */
#define COMP_TASKS_START_TASKS_START_Trigger    ( 1UL )                                       /*!< Trigger task */

/* Register: COMP_TASKS_STOP */
/* Description: Stop comparator */

/* Bit 0 : Stop comparator */
#define COMP_TASKS_STOP_TASKS_STOP_Pos        ( 0UL )                                     /*!< Position of TASKS_STOP field. */
#define COMP_TASKS_STOP_TASKS_STOP_Msk        ( 0x1UL << COMP_TASKS_STOP_TASKS_STOP_Pos ) /*!< Bit mask of TASKS_STOP field. */
#define COMP_TASKS_STOP_TASKS_STOP_Trigger    ( 1UL )                                     /*!< Trigger task */

/* Register: COMP_TASKS_SAMPLE */
/* Description: Sample comparator value */

/* Bit 0 : Sample comparator value */
#define COMP_TASKS_SAMPLE_TASKS_SAMPLE_Pos        ( 0UL )                                         /*!< Position of TASKS_SAMPLE field. */
#define COMP_TASKS_SAMPLE_TASKS_SAMPLE_Msk        ( 0x1UL << COMP_TASKS_SAMPLE_TASKS_SAMPLE_Pos ) /*!< Bit mask of TASKS_SAMPLE field. */
#define COMP_TASKS_SAMPLE_TASKS_SAMPLE_Trigger    ( 1UL )                                         /*!< Trigger task */

/* Register: COMP_EVENTS_READY */
/* Description: COMP is ready and output is valid */

/* Bit 0 : COMP is ready and output is valid */
#define COMP_EVENTS_READY_EVENTS_READY_Pos             ( 0UL )                                         /*!< Position of EVENTS_READY field. */
#define COMP_EVENTS_READY_EVENTS_READY_Msk             ( 0x1UL << COMP_EVENTS_READY_EVENTS_READY_Pos ) /*!< Bit mask of EVENTS_READY field. */
#define COMP_EVENTS_READY_EVENTS_READY_NotGenerated    ( 0UL )                                         /*!< Event not generated */
#define COMP_EVENTS_READY_EVENTS_READY_Generated       ( 1UL )                                         /*!< Event generated */

/* Register: COMP_EVENTS_DOWN */
/* Description: Downward crossing */

/* Bit 0 : Downward crossing */
#define COMP_EVENTS_DOWN_EVENTS_DOWN_Pos             ( 0UL )                                       /*!< Position of EVENTS_DOWN field. */
#define COMP_EVENTS_DOWN_EVENTS_DOWN_Msk             ( 0x1UL << COMP_EVENTS_DOWN_EVENTS_DOWN_Pos ) /*!< Bit mask of EVENTS_DOWN field. */
#define COMP_EVENTS_DOWN_EVENTS_DOWN_NotGenerated    ( 0UL )                                       /*!< Event not generated */
#define COMP_EVENTS_DOWN_EVENTS_DOWN_Generated       ( 1UL )                                       /*!< Event generated */

/* Register: COMP_EVENTS_UP */
/* Description: Upward crossing */

/* Bit 0 : Upward crossing */
#define COMP_EVENTS_UP_EVENTS_UP_Pos             ( 0UL )                                   /*!< Position of EVENTS_UP field. */
#define COMP_EVENTS_UP_EVENTS_UP_Msk             ( 0x1UL << COMP_EVENTS_UP_EVENTS_UP_Pos ) /*!< Bit mask of EVENTS_UP field. */
#define COMP_EVENTS_UP_EVENTS_UP_NotGenerated    ( 0UL )                                   /*!< Event not generated */
#define COMP_EVENTS_UP_EVENTS_UP_Generated       ( 1UL )                                   /*!< Event generated */

/* Register: COMP_EVENTS_CROSS */
/* Description: Downward or upward crossing */

/* Bit 0 : Downward or upward crossing */
#define COMP_EVENTS_CROSS_EVENTS_CROSS_Pos             ( 0UL )                                         /*!< Position of EVENTS_CROSS field. */
#define COMP_EVENTS_CROSS_EVENTS_CROSS_Msk             ( 0x1UL << COMP_EVENTS_CROSS_EVENTS_CROSS_Pos ) /*!< Bit mask of EVENTS_CROSS field. */
#define COMP_EVENTS_CROSS_EVENTS_CROSS_NotGenerated    ( 0UL )                                         /*!< Event not generated */
#define COMP_EVENTS_CROSS_EVENTS_CROSS_Generated       ( 1UL )                                         /*!< Event generated */

/* Register: COMP_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 4 : Shortcut between event CROSS and task STOP */
#define COMP_SHORTS_CROSS_STOP_Pos           ( 4UL )                                 /*!< Position of CROSS_STOP field. */
#define COMP_SHORTS_CROSS_STOP_Msk           ( 0x1UL << COMP_SHORTS_CROSS_STOP_Pos ) /*!< Bit mask of CROSS_STOP field. */
#define COMP_SHORTS_CROSS_STOP_Disabled      ( 0UL )                                 /*!< Disable shortcut */
#define COMP_SHORTS_CROSS_STOP_Enabled       ( 1UL )                                 /*!< Enable shortcut */

/* Bit 3 : Shortcut between event UP and task STOP */
#define COMP_SHORTS_UP_STOP_Pos              ( 3UL )                              /*!< Position of UP_STOP field. */
#define COMP_SHORTS_UP_STOP_Msk              ( 0x1UL << COMP_SHORTS_UP_STOP_Pos ) /*!< Bit mask of UP_STOP field. */
#define COMP_SHORTS_UP_STOP_Disabled         ( 0UL )                              /*!< Disable shortcut */
#define COMP_SHORTS_UP_STOP_Enabled          ( 1UL )                              /*!< Enable shortcut */

/* Bit 2 : Shortcut between event DOWN and task STOP */
#define COMP_SHORTS_DOWN_STOP_Pos            ( 2UL )                                /*!< Position of DOWN_STOP field. */
#define COMP_SHORTS_DOWN_STOP_Msk            ( 0x1UL << COMP_SHORTS_DOWN_STOP_Pos ) /*!< Bit mask of DOWN_STOP field. */
#define COMP_SHORTS_DOWN_STOP_Disabled       ( 0UL )                                /*!< Disable shortcut */
#define COMP_SHORTS_DOWN_STOP_Enabled        ( 1UL )                                /*!< Enable shortcut */

/* Bit 1 : Shortcut between event READY and task STOP */
#define COMP_SHORTS_READY_STOP_Pos           ( 1UL )                                 /*!< Position of READY_STOP field. */
#define COMP_SHORTS_READY_STOP_Msk           ( 0x1UL << COMP_SHORTS_READY_STOP_Pos ) /*!< Bit mask of READY_STOP field. */
#define COMP_SHORTS_READY_STOP_Disabled      ( 0UL )                                 /*!< Disable shortcut */
#define COMP_SHORTS_READY_STOP_Enabled       ( 1UL )                                 /*!< Enable shortcut */

/* Bit 0 : Shortcut between event READY and task SAMPLE */
#define COMP_SHORTS_READY_SAMPLE_Pos         ( 0UL )                                   /*!< Position of READY_SAMPLE field. */
#define COMP_SHORTS_READY_SAMPLE_Msk         ( 0x1UL << COMP_SHORTS_READY_SAMPLE_Pos ) /*!< Bit mask of READY_SAMPLE field. */
#define COMP_SHORTS_READY_SAMPLE_Disabled    ( 0UL )                                   /*!< Disable shortcut */
#define COMP_SHORTS_READY_SAMPLE_Enabled     ( 1UL )                                   /*!< Enable shortcut */

