FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Register: COMP_PSEL */
/* Description: Pin select */

/* Bits 2..0 : Analog pin select */
#define COMP_PSEL_PSEL_Pos             ( 0UL )                         /*!< Position of PSEL field. */
#define COMP_PSEL_PSEL_Msk             ( 0x7UL << COMP_PSEL_PSEL_Pos ) /*!< Bit mask of PSEL field. */
#define COMP_PSEL_PSEL_AnalogInput0    ( 0UL )                         /*!< AIN0 selected as analog input */
#define COMP_PSEL_PSEL_AnalogInput1    ( 1UL )                         /*!< AIN1 selected as analog input */
#define COMP_PSEL_PSEL_AnalogInput2    ( 2UL )                         /*!< AIN2 selected as analog input */
#define COMP_PSEL_PSEL_AnalogInput3    ( 3UL )                         /*!< AIN3 selected as analog input */
#define COMP_PSEL_PSEL_VddhDiv5        ( 7UL )                         /*!< VDDH/5 selected as analog input */

/* Register: COMP_REFSEL */
/* Description: Reference source select for single-ended mode */

/* Bits 2..0 : Reference select */
#define COMP_REFSEL_REFSEL_Pos       ( 0UL )                             /*!< Position of REFSEL field. */
#define COMP_REFSEL_REFSEL_Msk       ( 0x7UL << COMP_REFSEL_REFSEL_Pos ) /*!< Bit mask of REFSEL field. */
#define COMP_REFSEL_REFSEL_Int1V2    ( 0UL )                             /*!< VREF = internal 1.2 V reference (VDD &gt;= 1.7 V) */
#define COMP_REFSEL_REFSEL_Int1V8    ( 1UL )                             /*!< VREF = internal 1.8 V reference (VDD &gt;= VREF + 0.2 V) */
#define COMP_REFSEL_REFSEL_Int2V4    ( 2UL )                             /*!< VREF = internal 2.4 V reference (VDD &gt;= VREF + 0.2 V) */
#define COMP_REFSEL_REFSEL_VDD       ( 4UL )                             /*!< VREF = VDD */
#define COMP_REFSEL_REFSEL_ARef      ( 5UL )                             /*!< VREF = AREF */

/* Register: COMP_EXTREFSEL */
/* Description: External reference select */

/* Bits 2..0 : External analog reference select */
#define COMP_EXTREFSEL_EXTREFSEL_Pos                 ( 0UL )                                   /*!< Position of EXTREFSEL field. */
#define COMP_EXTREFSEL_EXTREFSEL_Msk                 ( 0x7UL << COMP_EXTREFSEL_EXTREFSEL_Pos ) /*!< Bit mask of EXTREFSEL field. */
#define COMP_EXTREFSEL_EXTREFSEL_AnalogReference0    ( 0UL )                                   /*!< Use AIN0 as external analog reference */
#define COMP_EXTREFSEL_EXTREFSEL_AnalogReference1    ( 1UL )                                   /*!< Use AIN1 as external analog reference */
#define COMP_EXTREFSEL_EXTREFSEL_AnalogReference2    ( 2UL )                                   /*!< Use AIN2 as external analog reference */
#define COMP_EXTREFSEL_EXTREFSEL_AnalogReference3    ( 3UL )                                   /*!< Use AIN3 as external analog reference */

/* Register: COMP_TH */
/* Description: Threshold configuration for hysteresis unit */

/* Bits 13..8 : VUP = (THUP+1)/64*VREF */
#define COMP_TH_THUP_Pos      ( 8UL )                        /*!< Position of THUP field. */
#define COMP_TH_THUP_Msk      ( 0x3FUL << COMP_TH_THUP_Pos ) /*!< Bit mask of THUP field. */

/* Bits 5..0 : VDOWN = (THDOWN+1)/64*VREF */
#define COMP_TH_THDOWN_Pos    ( 0UL )                          /*!< Position of THDOWN field. */
#define COMP_TH_THDOWN_Msk    ( 0x3FUL << COMP_TH_THDOWN_Pos ) /*!< Bit mask of THDOWN field. */

/* Register: COMP_MODE */
/* Description: Mode configuration */

/* Bit 8 : Main operation modes */
#define COMP_MODE_MAIN_Pos     ( 8UL )                         /*!< Position of MAIN field. */
#define COMP_MODE_MAIN_Msk     ( 0x1UL << COMP_MODE_MAIN_Pos ) /*!< Bit mask of MAIN field. */
#define COMP_MODE_MAIN_SE      ( 0UL )                         /*!< Single-ended mode */
#define COMP_MODE_MAIN_Diff    ( 1UL )                         /*!< Differential mode */

/* Bits 1..0 : Speed and power modes */
#define COMP_MODE_SP_Pos       ( 0UL )                       /*!< Position of SP field. */
#define COMP_MODE_SP_Msk       ( 0x3UL << COMP_MODE_SP_Pos ) /*!< Bit mask of SP field. */
#define COMP_MODE_SP_Low       ( 0UL )                       /*!< Low-power mode */
#define COMP_MODE_SP_Normal    ( 1UL )                       /*!< Normal mode */
#define COMP_MODE_SP_High      ( 2UL )                       /*!< High-speed mode */

/* Register: COMP_HYST */
/* Description: Comparator hysteresis enable */

/* Bit 0 : Comparator hysteresis */
#define COMP_HYST_HYST_Pos         ( 0UL )                         /*!< Position of HYST field. */
#define COMP_HYST_HYST_Msk         ( 0x1UL << COMP_HYST_HYST_Pos ) /*!< Bit mask of HYST field. */
#define COMP_HYST_HYST_NoHyst      ( 0UL )                         /*!< Comparator hysteresis disabled */
#define COMP_HYST_HYST_Hyst50mV    ( 1UL )                         /*!< Comparator hysteresis enabled */


/* Peripheral: ECB */
/* Description: AES ECB Mode Encryption */

/* Register: ECB_TASKS_STARTECB */
/* Description: Start ECB block encrypt */

/* Bit 0 : Start ECB block encrypt */
#define ECB_TASKS_STARTECB_TASKS_STARTECB_Pos        ( 0UL )                                            /*!< Position of TASKS_STARTECB field. */
#define ECB_TASKS_STARTECB_TASKS_STARTECB_Msk        ( 0x1UL << ECB_TASKS_STARTECB_TASKS_STARTECB_Pos ) /*!< Bit mask of TASKS_STARTECB field. */
#define ECB_TASKS_STARTECB_TASKS_STARTECB_Trigger    ( 1UL )                                            /*!< Trigger task */

/* Register: ECB_TASKS_STOPECB */
/* Description: Abort a possible executing ECB operation */

/* Bit 0 : Abort a possible executing ECB operation */
#define ECB_TASKS_STOPECB_TASKS_STOPECB_Pos        ( 0UL )                                          /*!< Position of TASKS_STOPECB field. */
#define ECB_TASKS_STOPECB_TASKS_STOPECB_Msk        ( 0x1UL << ECB_TASKS_STOPECB_TASKS_STOPECB_Pos ) /*!< Bit mask of TASKS_STOPECB field. */
#define ECB_TASKS_STOPECB_TASKS_STOPECB_Trigger    ( 1UL )                                          /*!< Trigger task */

/* Register: ECB_EVENTS_ENDECB */
/* Description: ECB block encrypt complete */

/* Bit 0 : ECB block encrypt complete */
#define ECB_EVENTS_ENDECB_EVENTS_ENDECB_Pos             ( 0UL )                                          /*!< Position of EVENTS_ENDECB field. */
#define ECB_EVENTS_ENDECB_EVENTS_ENDECB_Msk             ( 0x1UL << ECB_EVENTS_ENDECB_EVENTS_ENDECB_Pos ) /*!< Bit mask of EVENTS_ENDECB field. */
#define ECB_EVENTS_ENDECB_EVENTS_ENDECB_NotGenerated    ( 0UL )                                          /*!< Event not generated */
#define ECB_EVENTS_ENDECB_EVENTS_ENDECB_Generated       ( 1UL )                                          /*!< Event generated */

