FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bits 31..0 : 64 bit unique device identifier */
#define FICR_DEVICEID_DEVICEID_Pos    ( 0UL )                                        /*!< Position of DEVICEID field. */
#define FICR_DEVICEID_DEVICEID_Msk    ( 0xFFFFFFFFUL << FICR_DEVICEID_DEVICEID_Pos ) /*!< Bit mask of DEVICEID field. */

/* Register: FICR_ER */
/* Description: Description collection: Encryption root, word n */

/* Bits 31..0 : Encryption root, word n */
#define FICR_ER_ER_Pos    ( 0UL )                            /*!< Position of ER field. */
#define FICR_ER_ER_Msk    ( 0xFFFFFFFFUL << FICR_ER_ER_Pos ) /*!< Bit mask of ER field. */

/* Register: FICR_IR */
/* Description: Description collection: Identity Root, word n */

/* Bits 31..0 : Identity Root, word n */
#define FICR_IR_IR_Pos    ( 0UL )                            /*!< Position of IR field. */
#define FICR_IR_IR_Msk    ( 0xFFFFFFFFUL << FICR_IR_IR_Pos ) /*!< Bit mask of IR field. */

/* Register: FICR_DEVICEADDRTYPE */
/* Description: Device address type */

/* Bit 0 : Device address type */
#define FICR_DEVICEADDRTYPE_DEVICEADDRTYPE_Pos       ( 0UL )                                             /*!< Position of DEVICEADDRTYPE field. */
#define FICR_DEVICEADDRTYPE_DEVICEADDRTYPE_Msk       ( 0x1UL << FICR_DEVICEADDRTYPE_DEVICEADDRTYPE_Pos ) /*!< Bit mask of DEVICEADDRTYPE field. */
#define FICR_DEVICEADDRTYPE_DEVICEADDRTYPE_Public    ( 0UL )                                             /*!< Public address */
#define FICR_DEVICEADDRTYPE_DEVICEADDRTYPE_Random    ( 1UL )                                             /*!< Random address */

/* Register: FICR_DEVICEADDR */
/* Description: Description collection: Device address n */

/* Bits 31..0 : 48 bit device address */
#define FICR_DEVICEADDR_DEVICEADDR_Pos    ( 0UL )                                            /*!< Position of DEVICEADDR field. */
#define FICR_DEVICEADDR_DEVICEADDR_Msk    ( 0xFFFFFFFFUL << FICR_DEVICEADDR_DEVICEADDR_Pos ) /*!< Bit mask of DEVICEADDR field. */

/* Register: FICR_INFO_PART */
/* Description: Part code */

/* Bits 31..0 : Part code */
#define FICR_INFO_PART_PART_Pos            ( 0UL )                                     /*!< Position of PART field. */
#define FICR_INFO_PART_PART_Msk            ( 0xFFFFFFFFUL << FICR_INFO_PART_PART_Pos ) /*!< Bit mask of PART field. */
#define FICR_INFO_PART_PART_N52820         ( 0x52820UL )                               /*!< nRF52820 */
#define FICR_INFO_PART_PART_N52833         ( 0x52833UL )                               /*!< nRF52833 */
#define FICR_INFO_PART_PART_N52840         ( 0x52840UL )                               /*!< nRF52840 */
#define FICR_INFO_PART_PART_Unspecified    ( 0xFFFFFFFFUL )                            /*!< Unspecified */

/* Register: FICR_INFO_VARIANT */
/* Description: Build code (hardware version and production configuration) */

/* Bits 31..0 : Build code (hardware version and production configuration). Encoded as ASCII. */
#define FICR_INFO_VARIANT_VARIANT_Pos            ( 0UL )                                           /*!< Position of VARIANT field. */
#define FICR_INFO_VARIANT_VARIANT_Msk            ( 0xFFFFFFFFUL << FICR_INFO_VARIANT_VARIANT_Pos ) /*!< Bit mask of VARIANT field. */
#define FICR_INFO_VARIANT_VARIANT_AAAA           ( 0x41414141UL )                                  /*!< AAAA */
#define FICR_INFO_VARIANT_VARIANT_AABC           ( 0x41414243UL )                                  /*!< AABC */
#define FICR_INFO_VARIANT_VARIANT_AAC0           ( 0x41414330UL )                                  /*!< AAC0 */
#define FICR_INFO_VARIANT_VARIANT_AAC1           ( 0x41414331UL )                                  /*!< AAC1 */
#define FICR_INFO_VARIANT_VARIANT_AAD0           ( 0x41414430UL )                                  /*!< AAD0 */
#define FICR_INFO_VARIANT_VARIANT_Unspecified    ( 0xFFFFFFFFUL )                                  /*!< Unspecified */

/* Register: FICR_INFO_PACKAGE */
/* Description: Package option */

/* Bits 31..0 : Package option */
#define FICR_INFO_PACKAGE_PACKAGE_Pos            ( 0UL )                                           /*!< Position of PACKAGE field. */
#define FICR_INFO_PACKAGE_PACKAGE_Msk            ( 0xFFFFFFFFUL << FICR_INFO_PACKAGE_PACKAGE_Pos ) /*!< Bit mask of PACKAGE field. */
#define FICR_INFO_PACKAGE_PACKAGE_QD             ( 0x2007UL )                                      /*!< QDxx - 5x5 40-pin QFN */
#define FICR_INFO_PACKAGE_PACKAGE_Unspecified    ( 0xFFFFFFFFUL )                                  /*!< Unspecified */

/* Register: FICR_INFO_RAM */
/* Description: RAM variant */

/* Bits 31..0 : RAM variant */
#define FICR_INFO_RAM_RAM_Pos            ( 0UL )                                   /*!< Position of RAM field. */
#define FICR_INFO_RAM_RAM_Msk            ( 0xFFFFFFFFUL << FICR_INFO_RAM_RAM_Pos ) /*!< Bit mask of RAM field. */
#define FICR_INFO_RAM_RAM_K16            ( 0x10UL )                                /*!< 16 kB RAM */
#define FICR_INFO_RAM_RAM_K32            ( 0x20UL )                                /*!< 32 kB RAM */
#define FICR_INFO_RAM_RAM_K64            ( 0x40UL )                                /*!< 64 kB RAM */
#define FICR_INFO_RAM_RAM_K128           ( 0x80UL )                                /*!< 128 kB RAM */
#define FICR_INFO_RAM_RAM_K256           ( 0x100UL )                               /*!< 256 kB RAM */
#define FICR_INFO_RAM_RAM_Unspecified    ( 0xFFFFFFFFUL )                          /*!< Unspecified */

/* Register: FICR_INFO_FLASH */
/* Description: Flash variant */

/* Bits 31..0 : Flash variant */
#define FICR_INFO_FLASH_FLASH_Pos            ( 0UL )                                       /*!< Position of FLASH field. */
#define FICR_INFO_FLASH_FLASH_Msk            ( 0xFFFFFFFFUL << FICR_INFO_FLASH_FLASH_Pos ) /*!< Bit mask of FLASH field. */
#define FICR_INFO_FLASH_FLASH_K128           ( 0x80UL )                                    /*!< 128 kB FLASH */
#define FICR_INFO_FLASH_FLASH_K256           ( 0x100UL )                                   /*!< 256 kB FLASH */
#define FICR_INFO_FLASH_FLASH_K512           ( 0x200UL )                                   /*!< 512 kB FLASH */
#define FICR_INFO_FLASH_FLASH_K1024          ( 0x400UL )                                   /*!< 1 MB FLASH */
#define FICR_INFO_FLASH_FLASH_K2048          ( 0x800UL )                                   /*!< 2 MB FLASH */
#define FICR_INFO_FLASH_FLASH_Unspecified    ( 0xFFFFFFFFUL )                              /*!< Unspecified */

/* Register: FICR_PRODTEST */
/* Description: Description collection: Production test signature n */

/* Bits 31..0 : Production test signature n */
#define FICR_PRODTEST_PRODTEST_Pos        ( 0UL )                                        /*!< Position of PRODTEST field. */
#define FICR_PRODTEST_PRODTEST_Msk        ( 0xFFFFFFFFUL << FICR_PRODTEST_PRODTEST_Pos ) /*!< Bit mask of PRODTEST field. */
#define FICR_PRODTEST_PRODTEST_Done       ( 0xBB42319FUL )                               /*!< Production tests done */
#define FICR_PRODTEST_PRODTEST_NotDone    ( 0xFFFFFFFFUL )                               /*!< Production tests not done */

/* Register: FICR_TEMP_A0 */
/* Description: Slope definition A0 */

/* Bits 11..0 : A (slope definition) register. */
#define FICR_TEMP_A0_A_Pos    ( 0UL )                           /*!< Position of A field. */
#define FICR_TEMP_A0_A_Msk    ( 0xFFFUL << FICR_TEMP_A0_A_Pos ) /*!< Bit mask of A field. */

/* Register: FICR_TEMP_A1 */
/* Description: Slope definition A1 */

/* Bits 11..0 : A (slope definition) register. */
#define FICR_TEMP_A1_A_Pos    ( 0UL )                           /*!< Position of A field. */
#define FICR_TEMP_A1_A_Msk    ( 0xFFFUL << FICR_TEMP_A1_A_Pos ) /*!< Bit mask of A field. */

