FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bits 1..0 : Program memory access mode. It is strongly recommended to only activate erase and write modes when they are actively used. */
#define NVMC_CONFIG_WEN_Pos    ( 0UL )                          /*!< Position of WEN field. */
#define NVMC_CONFIG_WEN_Msk    ( 0x3UL << NVMC_CONFIG_WEN_Pos ) /*!< Bit mask of WEN field. */
#define NVMC_CONFIG_WEN_Ren    ( 0UL )                          /*!< Read only access */
#define NVMC_CONFIG_WEN_Wen    ( 1UL )                          /*!< Write enabled */
#define NVMC_CONFIG_WEN_Een    ( 2UL )                          /*!< Erase enabled */

/* Register: NVMC_ERASEPAGE */
/* Description: Register for erasing a page in code area */

/* Bits 31..0 : Register for starting erase of a page in code area */
#define NVMC_ERASEPAGE_ERASEPAGE_Pos    ( 0UL )                                          /*!< Position of ERASEPAGE field. */
#define NVMC_ERASEPAGE_ERASEPAGE_Msk    ( 0xFFFFFFFFUL << NVMC_ERASEPAGE_ERASEPAGE_Pos ) /*!< Bit mask of ERASEPAGE field. */

/* Register: NVMC_ERASEPCR1 */
/* Description: Deprecated register - Register for erasing a page in code area, equivalent to ERASEPAGE */

/* Bits 31..0 : Register for erasing a page in code area, equivalent to ERASEPAGE */
#define NVMC_ERASEPCR1_ERASEPCR1_Pos    ( 0UL )                                          /*!< Position of ERASEPCR1 field. */
#define NVMC_ERASEPCR1_ERASEPCR1_Msk    ( 0xFFFFFFFFUL << NVMC_ERASEPCR1_ERASEPCR1_Pos ) /*!< Bit mask of ERASEPCR1 field. */

/* Register: NVMC_ERASEALL */
/* Description: Register for erasing all non-volatile user memory */

/* Bit 0 : Erase all non-volatile memory including UICR registers. The erase must be enabled using CONFIG.WEN before the non-volatile memory can be erased. */
#define NVMC_ERASEALL_ERASEALL_Pos            ( 0UL )                                 /*!< Position of ERASEALL field. */
#define NVMC_ERASEALL_ERASEALL_Msk            ( 0x1UL << NVMC_ERASEALL_ERASEALL_Pos ) /*!< Bit mask of ERASEALL field. */
#define NVMC_ERASEALL_ERASEALL_NoOperation    ( 0UL )                                 /*!< No operation */
#define NVMC_ERASEALL_ERASEALL_Erase          ( 1UL )                                 /*!< Start chip erase */

/* Register: NVMC_ERASEPCR0 */
/* Description: Deprecated register - Register for erasing a page in code area, equivalent to ERASEPAGE */

/* Bits 31..0 : Register for starting erase of a page in code area, equivalent to ERASEPAGE */
#define NVMC_ERASEPCR0_ERASEPCR0_Pos    ( 0UL )                                          /*!< Position of ERASEPCR0 field. */
#define NVMC_ERASEPCR0_ERASEPCR0_Msk    ( 0xFFFFFFFFUL << NVMC_ERASEPCR0_ERASEPCR0_Pos ) /*!< Bit mask of ERASEPCR0 field. */

/* Register: NVMC_ERASEUICR */
/* Description: Register for erasing user information configuration registers */

/* Bit 0 : Register starting erase of all user information configuration registers. The erase must be enabled using CONFIG.WEN before the UICR can be erased. */
#define NVMC_ERASEUICR_ERASEUICR_Pos            ( 0UL )                                   /*!< Position of ERASEUICR field. */
#define NVMC_ERASEUICR_ERASEUICR_Msk            ( 0x1UL << NVMC_ERASEUICR_ERASEUICR_Pos ) /*!< Bit mask of ERASEUICR field. */
#define NVMC_ERASEUICR_ERASEUICR_NoOperation    ( 0UL )                                   /*!< No operation */
#define NVMC_ERASEUICR_ERASEUICR_Erase          ( 1UL )                                   /*!< Start erase of UICR */

/* Register: NVMC_ERASEPAGEPARTIAL */
/* Description: Register for partial erase of a page in code area */

/* Bits 31..0 : Register for starting partial erase of a page in code area */
#define NVMC_ERASEPAGEPARTIAL_ERASEPAGEPARTIAL_Pos    ( 0UL )                                                        /*!< Position of ERASEPAGEPARTIAL field. */
#define NVMC_ERASEPAGEPARTIAL_ERASEPAGEPARTIAL_Msk    ( 0xFFFFFFFFUL << NVMC_ERASEPAGEPARTIAL_ERASEPAGEPARTIAL_Pos ) /*!< Bit mask of ERASEPAGEPARTIAL field. */

/* Register: NVMC_ERASEPAGEPARTIALCFG */
/* Description: Register for partial erase configuration */

/* Bits 6..0 : Duration of the partial erase in milliseconds */
#define NVMC_ERASEPAGEPARTIALCFG_DURATION_Pos    ( 0UL )                                             /*!< Position of DURATION field. */
#define NVMC_ERASEPAGEPARTIALCFG_DURATION_Msk    ( 0x7FUL << NVMC_ERASEPAGEPARTIALCFG_DURATION_Pos ) /*!< Bit mask of DURATION field. */


/* Peripheral: GPIO */
/* Description: GPIO Port 1 */

/* Register: GPIO_OUT */
/* Description: Write GPIO port */

/* Bit 31 : Pin 31 */
#define GPIO_OUT_PIN31_Pos     ( 31UL )                        /*!< Position of PIN31 field. */
#define GPIO_OUT_PIN31_Msk     ( 0x1UL << GPIO_OUT_PIN31_Pos ) /*!< Bit mask of PIN31 field. */
#define GPIO_OUT_PIN31_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN31_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 30 : Pin 30 */
#define GPIO_OUT_PIN30_Pos     ( 30UL )                        /*!< Position of PIN30 field. */
#define GPIO_OUT_PIN30_Msk     ( 0x1UL << GPIO_OUT_PIN30_Pos ) /*!< Bit mask of PIN30 field. */
#define GPIO_OUT_PIN30_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN30_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 29 : Pin 29 */
#define GPIO_OUT_PIN29_Pos     ( 29UL )                        /*!< Position of PIN29 field. */
#define GPIO_OUT_PIN29_Msk     ( 0x1UL << GPIO_OUT_PIN29_Pos ) /*!< Bit mask of PIN29 field. */
#define GPIO_OUT_PIN29_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN29_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 28 : Pin 28 */
#define GPIO_OUT_PIN28_Pos     ( 28UL )                        /*!< Position of PIN28 field. */
#define GPIO_OUT_PIN28_Msk     ( 0x1UL << GPIO_OUT_PIN28_Pos ) /*!< Bit mask of PIN28 field. */
#define GPIO_OUT_PIN28_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN28_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 27 : Pin 27 */
#define GPIO_OUT_PIN27_Pos     ( 27UL )                        /*!< Position of PIN27 field. */
#define GPIO_OUT_PIN27_Msk     ( 0x1UL << GPIO_OUT_PIN27_Pos ) /*!< Bit mask of PIN27 field. */
#define GPIO_OUT_PIN27_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN27_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 26 : Pin 26 */
#define GPIO_OUT_PIN26_Pos     ( 26UL )                        /*!< Position of PIN26 field. */
#define GPIO_OUT_PIN26_Msk     ( 0x1UL << GPIO_OUT_PIN26_Pos ) /*!< Bit mask of PIN26 field. */
#define GPIO_OUT_PIN26_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN26_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 25 : Pin 25 */
#define GPIO_OUT_PIN25_Pos     ( 25UL )                        /*!< Position of PIN25 field. */
#define GPIO_OUT_PIN25_Msk     ( 0x1UL << GPIO_OUT_PIN25_Pos ) /*!< Bit mask of PIN25 field. */
#define GPIO_OUT_PIN25_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN25_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 24 : Pin 24 */
#define GPIO_OUT_PIN24_Pos     ( 24UL )                        /*!< Position of PIN24 field. */
#define GPIO_OUT_PIN24_Msk     ( 0x1UL << GPIO_OUT_PIN24_Pos ) /*!< Bit mask of PIN24 field. */
#define GPIO_OUT_PIN24_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN24_High    ( 1UL )                         /*!< Pin driver is high */

