FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bit 8 : Pin 8 */
#define GPIO_OUTCLR_PIN8_Pos       ( 8UL )                           /*!< Position of PIN8 field. */
#define GPIO_OUTCLR_PIN8_Msk       ( 0x1UL << GPIO_OUTCLR_PIN8_Pos ) /*!< Bit mask of PIN8 field. */
#define GPIO_OUTCLR_PIN8_Low       ( 0UL )                           /*!< Read: pin driver is low */
#define GPIO_OUTCLR_PIN8_High      ( 1UL )                           /*!< Read: pin driver is high */
#define GPIO_OUTCLR_PIN8_Clear     ( 1UL )                           /*!< Write: a '1' sets the pin low; a '0' has no effect */

/* Bit 7 : Pin 7 */
#define GPIO_OUTCLR_PIN7_Pos       ( 7UL )                           /*!< Position of PIN7 field. */
#define GPIO_OUTCLR_PIN7_Msk       ( 0x1UL << GPIO_OUTCLR_PIN7_Pos ) /*!< Bit mask of PIN7 field. */
#define GPIO_OUTCLR_PIN7_Low       ( 0UL )                           /*!< Read: pin driver is low */
#define GPIO_OUTCLR_PIN7_High      ( 1UL )                           /*!< Read: pin driver is high */
#define GPIO_OUTCLR_PIN7_Clear     ( 1UL )                           /*!< Write: a '1' sets the pin low; a '0' has no effect */

/* Bit 6 : Pin 6 */
#define GPIO_OUTCLR_PIN6_Pos       ( 6UL )                           /*!< Position of PIN6 field. */
#define GPIO_OUTCLR_PIN6_Msk       ( 0x1UL << GPIO_OUTCLR_PIN6_Pos ) /*!< Bit mask of PIN6 field. */
#define GPIO_OUTCLR_PIN6_Low       ( 0UL )                           /*!< Read: pin driver is low */
#define GPIO_OUTCLR_PIN6_High      ( 1UL )                           /*!< Read: pin driver is high */
#define GPIO_OUTCLR_PIN6_Clear     ( 1UL )                           /*!< Write: a '1' sets the pin low; a '0' has no effect */

/* Bit 5 : Pin 5 */
#define GPIO_OUTCLR_PIN5_Pos       ( 5UL )                           /*!< Position of PIN5 field. */
#define GPIO_OUTCLR_PIN5_Msk       ( 0x1UL << GPIO_OUTCLR_PIN5_Pos ) /*!< Bit mask of PIN5 field. */
#define GPIO_OUTCLR_PIN5_Low       ( 0UL )                           /*!< Read: pin driver is low */
#define GPIO_OUTCLR_PIN5_High      ( 1UL )                           /*!< Read: pin driver is high */
#define GPIO_OUTCLR_PIN5_Clear     ( 1UL )                           /*!< Write: a '1' sets the pin low; a '0' has no effect */

/* Bit 4 : Pin 4 */
#define GPIO_OUTCLR_PIN4_Pos       ( 4UL )                           /*!< Position of PIN4 field. */
#define GPIO_OUTCLR_PIN4_Msk       ( 0x1UL << GPIO_OUTCLR_PIN4_Pos ) /*!< Bit mask of PIN4 field. */
#define GPIO_OUTCLR_PIN4_Low       ( 0UL )                           /*!< Read: pin driver is low */
#define GPIO_OUTCLR_PIN4_High      ( 1UL )                           /*!< Read: pin driver is high */
#define GPIO_OUTCLR_PIN4_Clear     ( 1UL )                           /*!< Write: a '1' sets the pin low; a '0' has no effect */

/* Bit 3 : Pin 3 */
#define GPIO_OUTCLR_PIN3_Pos       ( 3UL )                           /*!< Position of PIN3 field. */
#define GPIO_OUTCLR_PIN3_Msk       ( 0x1UL << GPIO_OUTCLR_PIN3_Pos ) /*!< Bit mask of PIN3 field. */
#define GPIO_OUTCLR_PIN3_Low       ( 0UL )                           /*!< Read: pin driver is low */
#define GPIO_OUTCLR_PIN3_High      ( 1UL )                           /*!< Read: pin driver is high */
#define GPIO_OUTCLR_PIN3_Clear     ( 1UL )                           /*!< Write: a '1' sets the pin low; a '0' has no effect */

/* Bit 2 : Pin 2 */
#define GPIO_OUTCLR_PIN2_Pos       ( 2UL )                           /*!< Position of PIN2 field. */
#define GPIO_OUTCLR_PIN2_Msk       ( 0x1UL << GPIO_OUTCLR_PIN2_Pos ) /*!< Bit mask of PIN2 field. */
#define GPIO_OUTCLR_PIN2_Low       ( 0UL )                           /*!< Read: pin driver is low */
#define GPIO_OUTCLR_PIN2_High      ( 1UL )                           /*!< Read: pin driver is high */
#define GPIO_OUTCLR_PIN2_Clear     ( 1UL )                           /*!< Write: a '1' sets the pin low; a '0' has no effect */

/* Bit 1 : Pin 1 */
#define GPIO_OUTCLR_PIN1_Pos       ( 1UL )                           /*!< Position of PIN1 field. */
#define GPIO_OUTCLR_PIN1_Msk       ( 0x1UL << GPIO_OUTCLR_PIN1_Pos ) /*!< Bit mask of PIN1 field. */
#define GPIO_OUTCLR_PIN1_Low       ( 0UL )                           /*!< Read: pin driver is low */
#define GPIO_OUTCLR_PIN1_High      ( 1UL )                           /*!< Read: pin driver is high */
#define GPIO_OUTCLR_PIN1_Clear     ( 1UL )                           /*!< Write: a '1' sets the pin low; a '0' has no effect */

/* Bit 0 : Pin 0 */
#define GPIO_OUTCLR_PIN0_Pos       ( 0UL )                           /*!< Position of PIN0 field. */
#define GPIO_OUTCLR_PIN0_Msk       ( 0x1UL << GPIO_OUTCLR_PIN0_Pos ) /*!< Bit mask of PIN0 field. */
#define GPIO_OUTCLR_PIN0_Low       ( 0UL )                           /*!< Read: pin driver is low */
#define GPIO_OUTCLR_PIN0_High      ( 1UL )                           /*!< Read: pin driver is high */
#define GPIO_OUTCLR_PIN0_Clear     ( 1UL )                           /*!< Write: a '1' sets the pin low; a '0' has no effect */

/* Register: GPIO_IN */
/* Description: Read GPIO port */

/* Bit 31 : Pin 31 */
#define GPIO_IN_PIN31_Pos     ( 31UL )                       /*!< Position of PIN31 field. */
#define GPIO_IN_PIN31_Msk     ( 0x1UL << GPIO_IN_PIN31_Pos ) /*!< Bit mask of PIN31 field. */
#define GPIO_IN_PIN31_Low     ( 0UL )                        /*!< Pin input is low */
#define GPIO_IN_PIN31_High    ( 1UL )                        /*!< Pin input is high */

/* Bit 30 : Pin 30 */
#define GPIO_IN_PIN30_Pos     ( 30UL )                       /*!< Position of PIN30 field. */
#define GPIO_IN_PIN30_Msk     ( 0x1UL << GPIO_IN_PIN30_Pos ) /*!< Bit mask of PIN30 field. */
#define GPIO_IN_PIN30_Low     ( 0UL )                        /*!< Pin input is low */
#define GPIO_IN_PIN30_High    ( 1UL )                        /*!< Pin input is high */

/* Bit 29 : Pin 29 */
#define GPIO_IN_PIN29_Pos     ( 29UL )                       /*!< Position of PIN29 field. */
#define GPIO_IN_PIN29_Msk     ( 0x1UL << GPIO_IN_PIN29_Pos ) /*!< Bit mask of PIN29 field. */
#define GPIO_IN_PIN29_Low     ( 0UL )                        /*!< Pin input is low */
#define GPIO_IN_PIN29_High    ( 1UL )                        /*!< Pin input is high */

/* Bit 28 : Pin 28 */
#define GPIO_IN_PIN28_Pos     ( 28UL )                       /*!< Position of PIN28 field. */
#define GPIO_IN_PIN28_Msk     ( 0x1UL << GPIO_IN_PIN28_Pos ) /*!< Bit mask of PIN28 field. */
#define GPIO_IN_PIN28_Low     ( 0UL )                        /*!< Pin input is low */
#define GPIO_IN_PIN28_High    ( 1UL )                        /*!< Pin input is high */

/* Bit 27 : Pin 27 */
#define GPIO_IN_PIN27_Pos     ( 27UL )                       /*!< Position of PIN27 field. */
#define GPIO_IN_PIN27_Msk     ( 0x1UL << GPIO_IN_PIN27_Pos ) /*!< Bit mask of PIN27 field. */
#define GPIO_IN_PIN27_Low     ( 0UL )                        /*!< Pin input is low */
#define GPIO_IN_PIN27_High    ( 1UL )                        /*!< Pin input is high */

/* Bit 26 : Pin 26 */
#define GPIO_IN_PIN26_Pos     ( 26UL )                       /*!< Position of PIN26 field. */
#define GPIO_IN_PIN26_Msk     ( 0x1UL << GPIO_IN_PIN26_Pos ) /*!< Bit mask of PIN26 field. */
#define GPIO_IN_PIN26_Low     ( 0UL )                        /*!< Pin input is low */
#define GPIO_IN_PIN26_High    ( 1UL )                        /*!< Pin input is high */

/* Bit 25 : Pin 25 */
#define GPIO_IN_PIN25_Pos     ( 25UL )                       /*!< Position of PIN25 field. */
#define GPIO_IN_PIN25_Msk     ( 0x1UL << GPIO_IN_PIN25_Pos ) /*!< Bit mask of PIN25 field. */
#define GPIO_IN_PIN25_Low     ( 0UL )                        /*!< Pin input is low */
#define GPIO_IN_PIN25_High    ( 1UL )                        /*!< Pin input is high */

/* Bit 24 : Pin 24 */
#define GPIO_IN_PIN24_Pos     ( 24UL )                       /*!< Position of PIN24 field. */
#define GPIO_IN_PIN24_Msk     ( 0x1UL << GPIO_IN_PIN24_Pos ) /*!< Bit mask of PIN24 field. */
#define GPIO_IN_PIN24_Low     ( 0UL )                        /*!< Pin input is low */
#define GPIO_IN_PIN24_High    ( 1UL )                        /*!< Pin input is high */

