FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bit 23 : Pin 23 */
#define GPIO_DIR_PIN23_Pos       ( 23UL )                        /*!< Position of PIN23 field. */
#define GPIO_DIR_PIN23_Msk       ( 0x1UL << GPIO_DIR_PIN23_Pos ) /*!< Bit mask of PIN23 field. */
#define GPIO_DIR_PIN23_Input     ( 0UL )                         /*!< Pin set as input */
#define GPIO_DIR_PIN23_Output    ( 1UL )                         /*!< Pin set as output */

/* Bit 22 : Pin 22 */
#define GPIO_DIR_PIN22_Pos       ( 22UL )                        /*!< Position of PIN22 field. */
#define GPIO_DIR_PIN22_Msk       ( 0x1UL << GPIO_DIR_PIN22_Pos ) /*!< Bit mask of PIN22 field. */
#define GPIO_DIR_PIN22_Input     ( 0UL )                         /*!< Pin set as input */
#define GPIO_DIR_PIN22_Output    ( 1UL )                         /*!< Pin set as output */

/* Bit 21 : Pin 21 */
#define GPIO_DIR_PIN21_Pos       ( 21UL )                        /*!< Position of PIN21 field. */
#define GPIO_DIR_PIN21_Msk       ( 0x1UL << GPIO_DIR_PIN21_Pos ) /*!< Bit mask of PIN21 field. */
#define GPIO_DIR_PIN21_Input     ( 0UL )                         /*!< Pin set as input */
#define GPIO_DIR_PIN21_Output    ( 1UL )                         /*!< Pin set as output */

/* Bit 20 : Pin 20 */
#define GPIO_DIR_PIN20_Pos       ( 20UL )                        /*!< Position of PIN20 field. */
#define GPIO_DIR_PIN20_Msk       ( 0x1UL << GPIO_DIR_PIN20_Pos ) /*!< Bit mask of PIN20 field. */
#define GPIO_DIR_PIN20_Input     ( 0UL )                         /*!< Pin set as input */
#define GPIO_DIR_PIN20_Output    ( 1UL )                         /*!< Pin set as output */

/* Bit 19 : Pin 19 */
#define GPIO_DIR_PIN19_Pos       ( 19UL )                        /*!< Position of PIN19 field. */
#define GPIO_DIR_PIN19_Msk       ( 0x1UL << GPIO_DIR_PIN19_Pos ) /*!< Bit mask of PIN19 field. */
#define GPIO_DIR_PIN19_Input     ( 0UL )                         /*!< Pin set as input */
#define GPIO_DIR_PIN19_Output    ( 1UL )                         /*!< Pin set as output */

/* Bit 18 : Pin 18 */
#define GPIO_DIR_PIN18_Pos       ( 18UL )                        /*!< Position of PIN18 field. */
#define GPIO_DIR_PIN18_Msk       ( 0x1UL << GPIO_DIR_PIN18_Pos ) /*!< Bit mask of PIN18 field. */
#define GPIO_DIR_PIN18_Input     ( 0UL )                         /*!< Pin set as input */
#define GPIO_DIR_PIN18_Output    ( 1UL )                         /*!< Pin set as output */

/* Bit 17 : Pin 17 */
#define GPIO_DIR_PIN17_Pos       ( 17UL )                        /*!< Position of PIN17 field. */
#define GPIO_DIR_PIN17_Msk       ( 0x1UL << GPIO_DIR_PIN17_Pos ) /*!< Bit mask of PIN17 field. */
#define GPIO_DIR_PIN17_Input     ( 0UL )                         /*!< Pin set as input */
#define GPIO_DIR_PIN17_Output    ( 1UL )                         /*!< Pin set as output */

/* Bit 16 : Pin 16 */
#define GPIO_DIR_PIN16_Pos       ( 16UL )                        /*!< Position of PIN16 field. */
#define GPIO_DIR_PIN16_Msk       ( 0x1UL << GPIO_DIR_PIN16_Pos ) /*!< Bit mask of PIN16 field. */
#define GPIO_DIR_PIN16_Input     ( 0UL )                         /*!< Pin set as input */
#define GPIO_DIR_PIN16_Output    ( 1UL )                         /*!< Pin set as output */

/* Bit 15 : Pin 15 */
#define GPIO_DIR_PIN15_Pos       ( 15UL )                        /*!< Position of PIN15 field. */
#define GPIO_DIR_PIN15_Msk       ( 0x1UL << GPIO_DIR_PIN15_Pos ) /*!< Bit mask of PIN15 field. */
#define GPIO_DIR_PIN15_Input     ( 0UL )                         /*!< Pin set as input */
#define GPIO_DIR_PIN15_Output    ( 1UL )                         /*!< Pin set as output */

/* Bit 14 : Pin 14 */
#define GPIO_DIR_PIN14_Pos       ( 14UL )                        /*!< Position of PIN14 field. */
#define GPIO_DIR_PIN14_Msk       ( 0x1UL << GPIO_DIR_PIN14_Pos ) /*!< Bit mask of PIN14 field. */
#define GPIO_DIR_PIN14_Input     ( 0UL )                         /*!< Pin set as input */
#define GPIO_DIR_PIN14_Output    ( 1UL )                         /*!< Pin set as output */

/* Bit 13 : Pin 13 */
#define GPIO_DIR_PIN13_Pos       ( 13UL )                        /*!< Position of PIN13 field. */
#define GPIO_DIR_PIN13_Msk       ( 0x1UL << GPIO_DIR_PIN13_Pos ) /*!< Bit mask of PIN13 field. */
#define GPIO_DIR_PIN13_Input     ( 0UL )                         /*!< Pin set as input */
#define GPIO_DIR_PIN13_Output    ( 1UL )                         /*!< Pin set as output */

/* Bit 12 : Pin 12 */
#define GPIO_DIR_PIN12_Pos       ( 12UL )                        /*!< Position of PIN12 field. */
#define GPIO_DIR_PIN12_Msk       ( 0x1UL << GPIO_DIR_PIN12_Pos ) /*!< Bit mask of PIN12 field. */
#define GPIO_DIR_PIN12_Input     ( 0UL )                         /*!< Pin set as input */
#define GPIO_DIR_PIN12_Output    ( 1UL )                         /*!< Pin set as output */

/* Bit 11 : Pin 11 */
#define GPIO_DIR_PIN11_Pos       ( 11UL )                        /*!< Position of PIN11 field. */
#define GPIO_DIR_PIN11_Msk       ( 0x1UL << GPIO_DIR_PIN11_Pos ) /*!< Bit mask of PIN11 field. */
#define GPIO_DIR_PIN11_Input     ( 0UL )                         /*!< Pin set as input */
#define GPIO_DIR_PIN11_Output    ( 1UL )                         /*!< Pin set as output */

/* Bit 10 : Pin 10 */
#define GPIO_DIR_PIN10_Pos       ( 10UL )                        /*!< Position of PIN10 field. */
#define GPIO_DIR_PIN10_Msk       ( 0x1UL << GPIO_DIR_PIN10_Pos ) /*!< Bit mask of PIN10 field. */
#define GPIO_DIR_PIN10_Input     ( 0UL )                         /*!< Pin set as input */
#define GPIO_DIR_PIN10_Output    ( 1UL )                         /*!< Pin set as output */

/* Bit 9 : Pin 9 */
#define GPIO_DIR_PIN9_Pos        ( 9UL )                        /*!< Position of PIN9 field. */
#define GPIO_DIR_PIN9_Msk        ( 0x1UL << GPIO_DIR_PIN9_Pos ) /*!< Bit mask of PIN9 field. */
#define GPIO_DIR_PIN9_Input      ( 0UL )                        /*!< Pin set as input */
#define GPIO_DIR_PIN9_Output     ( 1UL )                        /*!< Pin set as output */

/* Bit 8 : Pin 8 */
#define GPIO_DIR_PIN8_Pos        ( 8UL )                        /*!< Position of PIN8 field. */
#define GPIO_DIR_PIN8_Msk        ( 0x1UL << GPIO_DIR_PIN8_Pos ) /*!< Bit mask of PIN8 field. */
#define GPIO_DIR_PIN8_Input      ( 0UL )                        /*!< Pin set as input */
#define GPIO_DIR_PIN8_Output     ( 1UL )                        /*!< Pin set as output */

/* Bit 7 : Pin 7 */
#define GPIO_DIR_PIN7_Pos        ( 7UL )                        /*!< Position of PIN7 field. */
#define GPIO_DIR_PIN7_Msk        ( 0x1UL << GPIO_DIR_PIN7_Pos ) /*!< Bit mask of PIN7 field. */
#define GPIO_DIR_PIN7_Input      ( 0UL )                        /*!< Pin set as input */
#define GPIO_DIR_PIN7_Output     ( 1UL )                        /*!< Pin set as output */

/* Bit 6 : Pin 6 */
#define GPIO_DIR_PIN6_Pos        ( 6UL )                        /*!< Position of PIN6 field. */
#define GPIO_DIR_PIN6_Msk        ( 0x1UL << GPIO_DIR_PIN6_Pos ) /*!< Bit mask of PIN6 field. */
#define GPIO_DIR_PIN6_Input      ( 0UL )                        /*!< Pin set as input */
#define GPIO_DIR_PIN6_Output     ( 1UL )                        /*!< Pin set as output */

/* Bit 5 : Pin 5 */
#define GPIO_DIR_PIN5_Pos        ( 5UL )                        /*!< Position of PIN5 field. */
#define GPIO_DIR_PIN5_Msk        ( 0x1UL << GPIO_DIR_PIN5_Pos ) /*!< Bit mask of PIN5 field. */
#define GPIO_DIR_PIN5_Input      ( 0UL )                        /*!< Pin set as input */
#define GPIO_DIR_PIN5_Output     ( 1UL )                        /*!< Pin set as output */

/* Bit 4 : Pin 4 */
#define GPIO_DIR_PIN4_Pos        ( 4UL )                        /*!< Position of PIN4 field. */
#define GPIO_DIR_PIN4_Msk        ( 0x1UL << GPIO_DIR_PIN4_Pos ) /*!< Bit mask of PIN4 field. */
#define GPIO_DIR_PIN4_Input      ( 0UL )                        /*!< Pin set as input */
#define GPIO_DIR_PIN4_Output     ( 1UL )                        /*!< Pin set as output */

/* Bit 3 : Pin 3 */
#define GPIO_DIR_PIN3_Pos        ( 3UL )                        /*!< Position of PIN3 field. */
#define GPIO_DIR_PIN3_Msk        ( 0x1UL << GPIO_DIR_PIN3_Pos ) /*!< Bit mask of PIN3 field. */
#define GPIO_DIR_PIN3_Input      ( 0UL )                        /*!< Pin set as input */
#define GPIO_DIR_PIN3_Output     ( 1UL )                        /*!< Pin set as output */

/* Bit 2 : Pin 2 */
#define GPIO_DIR_PIN2_Pos        ( 2UL )                        /*!< Position of PIN2 field. */
#define GPIO_DIR_PIN2_Msk        ( 0x1UL << GPIO_DIR_PIN2_Pos ) /*!< Bit mask of PIN2 field. */
#define GPIO_DIR_PIN2_Input      ( 0UL )                        /*!< Pin set as input */
#define GPIO_DIR_PIN2_Output     ( 1UL )                        /*!< Pin set as output */

/* Bit 1 : Pin 1 */
#define GPIO_DIR_PIN1_Pos        ( 1UL )                        /*!< Position of PIN1 field. */
#define GPIO_DIR_PIN1_Msk        ( 0x1UL << GPIO_DIR_PIN1_Pos ) /*!< Bit mask of PIN1 field. */
#define GPIO_DIR_PIN1_Input      ( 0UL )                        /*!< Pin set as input */
#define GPIO_DIR_PIN1_Output     ( 1UL )                        /*!< Pin set as output */

/* Bit 0 : Pin 0 */
#define GPIO_DIR_PIN0_Pos        ( 0UL )                        /*!< Position of PIN0 field. */
#define GPIO_DIR_PIN0_Msk        ( 0x1UL << GPIO_DIR_PIN0_Pos ) /*!< Bit mask of PIN0 field. */
#define GPIO_DIR_PIN0_Input      ( 0UL )                        /*!< Pin set as input */
#define GPIO_DIR_PIN0_Output     ( 1UL )                        /*!< Pin set as output */

