FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bit 26 : Status on whether PIN26 has met criteria set in PIN_CNF26.SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN26_Pos           ( 26UL )                          /*!< Position of PIN26 field. */
#define GPIO_LATCH_PIN26_Msk           ( 0x1UL << GPIO_LATCH_PIN26_Pos ) /*!< Bit mask of PIN26 field. */
#define GPIO_LATCH_PIN26_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN26_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 25 : Status on whether PIN25 has met criteria set in PIN_CNF25.SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN25_Pos           ( 25UL )                          /*!< Position of PIN25 field. */
#define GPIO_LATCH_PIN25_Msk           ( 0x1UL << GPIO_LATCH_PIN25_Pos ) /*!< Bit mask of PIN25 field. */
#define GPIO_LATCH_PIN25_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN25_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 24 : Status on whether PIN24 has met criteria set in PIN_CNF24.SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN24_Pos           ( 24UL )                          /*!< Position of PIN24 field. */
#define GPIO_LATCH_PIN24_Msk           ( 0x1UL << GPIO_LATCH_PIN24_Pos ) /*!< Bit mask of PIN24 field. */
#define GPIO_LATCH_PIN24_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN24_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 23 : Status on whether PIN23 has met criteria set in PIN_CNF23.SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN23_Pos           ( 23UL )                          /*!< Position of PIN23 field. */
#define GPIO_LATCH_PIN23_Msk           ( 0x1UL << GPIO_LATCH_PIN23_Pos ) /*!< Bit mask of PIN23 field. */
#define GPIO_LATCH_PIN23_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN23_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 22 : Status on whether PIN22 has met criteria set in PIN_CNF22.SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN22_Pos           ( 22UL )                          /*!< Position of PIN22 field. */
#define GPIO_LATCH_PIN22_Msk           ( 0x1UL << GPIO_LATCH_PIN22_Pos ) /*!< Bit mask of PIN22 field. */
#define GPIO_LATCH_PIN22_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN22_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 21 : Status on whether PIN21 has met criteria set in PIN_CNF21.SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN21_Pos           ( 21UL )                          /*!< Position of PIN21 field. */
#define GPIO_LATCH_PIN21_Msk           ( 0x1UL << GPIO_LATCH_PIN21_Pos ) /*!< Bit mask of PIN21 field. */
#define GPIO_LATCH_PIN21_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN21_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 20 : Status on whether PIN20 has met criteria set in PIN_CNF20.SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN20_Pos           ( 20UL )                          /*!< Position of PIN20 field. */
#define GPIO_LATCH_PIN20_Msk           ( 0x1UL << GPIO_LATCH_PIN20_Pos ) /*!< Bit mask of PIN20 field. */
#define GPIO_LATCH_PIN20_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN20_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 19 : Status on whether PIN19 has met criteria set in PIN_CNF19.SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN19_Pos           ( 19UL )                          /*!< Position of PIN19 field. */
#define GPIO_LATCH_PIN19_Msk           ( 0x1UL << GPIO_LATCH_PIN19_Pos ) /*!< Bit mask of PIN19 field. */
#define GPIO_LATCH_PIN19_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN19_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 18 : Status on whether PIN18 has met criteria set in PIN_CNF18.SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN18_Pos           ( 18UL )                          /*!< Position of PIN18 field. */
#define GPIO_LATCH_PIN18_Msk           ( 0x1UL << GPIO_LATCH_PIN18_Pos ) /*!< Bit mask of PIN18 field. */
#define GPIO_LATCH_PIN18_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN18_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 17 : Status on whether PIN17 has met criteria set in PIN_CNF17.SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN17_Pos           ( 17UL )                          /*!< Position of PIN17 field. */
#define GPIO_LATCH_PIN17_Msk           ( 0x1UL << GPIO_LATCH_PIN17_Pos ) /*!< Bit mask of PIN17 field. */
#define GPIO_LATCH_PIN17_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN17_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 16 : Status on whether PIN16 has met criteria set in PIN_CNF16.SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN16_Pos           ( 16UL )                          /*!< Position of PIN16 field. */
#define GPIO_LATCH_PIN16_Msk           ( 0x1UL << GPIO_LATCH_PIN16_Pos ) /*!< Bit mask of PIN16 field. */
#define GPIO_LATCH_PIN16_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN16_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 15 : Status on whether PIN15 has met criteria set in PIN_CNF15.SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN15_Pos           ( 15UL )                          /*!< Position of PIN15 field. */
#define GPIO_LATCH_PIN15_Msk           ( 0x1UL << GPIO_LATCH_PIN15_Pos ) /*!< Bit mask of PIN15 field. */
#define GPIO_LATCH_PIN15_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN15_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 14 : Status on whether PIN14 has met criteria set in PIN_CNF14.SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN14_Pos           ( 14UL )                          /*!< Position of PIN14 field. */
#define GPIO_LATCH_PIN14_Msk           ( 0x1UL << GPIO_LATCH_PIN14_Pos ) /*!< Bit mask of PIN14 field. */
#define GPIO_LATCH_PIN14_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN14_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 13 : Status on whether PIN13 has met criteria set in PIN_CNF13.SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN13_Pos           ( 13UL )                          /*!< Position of PIN13 field. */
#define GPIO_LATCH_PIN13_Msk           ( 0x1UL << GPIO_LATCH_PIN13_Pos ) /*!< Bit mask of PIN13 field. */
#define GPIO_LATCH_PIN13_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN13_Latched       ( 1UL )                           /*!< Criteria has been met */

