FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Register: POWER_EVENTS_SLEEPEXIT */
/* Description: CPU exited WFI/WFE sleep */

/* Bit 0 : CPU exited WFI/WFE sleep */
#define POWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_Pos             ( 0UL )                                                  /*!< Position of EVENTS_SLEEPEXIT field. */
#define POWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_Msk             ( 0x1UL << POWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_Pos ) /*!< Bit mask of EVENTS_SLEEPEXIT field. */
#define POWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_NotGenerated    ( 0UL )                                                  /*!< Event not generated */
#define POWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_Generated       ( 1UL )                                                  /*!< Event generated */

/* Register: POWER_EVENTS_USBDETECTED */
/* Description: Voltage supply detected on VBUS */

/* Bit 0 : Voltage supply detected on VBUS */
#define POWER_EVENTS_USBDETECTED_EVENTS_USBDETECTED_Pos             ( 0UL )                                                      /*!< Position of EVENTS_USBDETECTED field. */
#define POWER_EVENTS_USBDETECTED_EVENTS_USBDETECTED_Msk             ( 0x1UL << POWER_EVENTS_USBDETECTED_EVENTS_USBDETECTED_Pos ) /*!< Bit mask of EVENTS_USBDETECTED field. */
#define POWER_EVENTS_USBDETECTED_EVENTS_USBDETECTED_NotGenerated    ( 0UL )                                                      /*!< Event not generated */
#define POWER_EVENTS_USBDETECTED_EVENTS_USBDETECTED_Generated       ( 1UL )                                                      /*!< Event generated */

/* Register: POWER_EVENTS_USBREMOVED */
/* Description: Voltage supply removed from VBUS */

/* Bit 0 : Voltage supply removed from VBUS */
#define POWER_EVENTS_USBREMOVED_EVENTS_USBREMOVED_Pos             ( 0UL )                                                    /*!< Position of EVENTS_USBREMOVED field. */
#define POWER_EVENTS_USBREMOVED_EVENTS_USBREMOVED_Msk             ( 0x1UL << POWER_EVENTS_USBREMOVED_EVENTS_USBREMOVED_Pos ) /*!< Bit mask of EVENTS_USBREMOVED field. */
#define POWER_EVENTS_USBREMOVED_EVENTS_USBREMOVED_NotGenerated    ( 0UL )                                                    /*!< Event not generated */
#define POWER_EVENTS_USBREMOVED_EVENTS_USBREMOVED_Generated       ( 1UL )                                                    /*!< Event generated */

/* Register: POWER_EVENTS_USBPWRRDY */
/* Description: USB 3.3 V supply ready */

/* Bit 0 : USB 3.3 V supply ready */
#define POWER_EVENTS_USBPWRRDY_EVENTS_USBPWRRDY_Pos             ( 0UL )                                                  /*!< Position of EVENTS_USBPWRRDY field. */
#define POWER_EVENTS_USBPWRRDY_EVENTS_USBPWRRDY_Msk             ( 0x1UL << POWER_EVENTS_USBPWRRDY_EVENTS_USBPWRRDY_Pos ) /*!< Bit mask of EVENTS_USBPWRRDY field. */
#define POWER_EVENTS_USBPWRRDY_EVENTS_USBPWRRDY_NotGenerated    ( 0UL )                                                  /*!< Event not generated */
#define POWER_EVENTS_USBPWRRDY_EVENTS_USBPWRRDY_Generated       ( 1UL )                                                  /*!< Event generated */

/* Register: POWER_INTENSET */
/* Description: Enable interrupt */

/* Bit 9 : Write '1' to enable interrupt for event USBPWRRDY */
#define POWER_INTENSET_USBPWRRDY_Pos           ( 9UL )                                   /*!< Position of USBPWRRDY field. */
#define POWER_INTENSET_USBPWRRDY_Msk           ( 0x1UL << POWER_INTENSET_USBPWRRDY_Pos ) /*!< Bit mask of USBPWRRDY field. */
#define POWER_INTENSET_USBPWRRDY_Disabled      ( 0UL )                                   /*!< Read: Disabled */
#define POWER_INTENSET_USBPWRRDY_Enabled       ( 1UL )                                   /*!< Read: Enabled */
#define POWER_INTENSET_USBPWRRDY_Set           ( 1UL )                                   /*!< Enable */

/* Bit 8 : Write '1' to enable interrupt for event USBREMOVED */
#define POWER_INTENSET_USBREMOVED_Pos          ( 8UL )                                    /*!< Position of USBREMOVED field. */
#define POWER_INTENSET_USBREMOVED_Msk          ( 0x1UL << POWER_INTENSET_USBREMOVED_Pos ) /*!< Bit mask of USBREMOVED field. */
#define POWER_INTENSET_USBREMOVED_Disabled     ( 0UL )                                    /*!< Read: Disabled */
#define POWER_INTENSET_USBREMOVED_Enabled      ( 1UL )                                    /*!< Read: Enabled */
#define POWER_INTENSET_USBREMOVED_Set          ( 1UL )                                    /*!< Enable */

/* Bit 7 : Write '1' to enable interrupt for event USBDETECTED */
#define POWER_INTENSET_USBDETECTED_Pos         ( 7UL )                                     /*!< Position of USBDETECTED field. */
#define POWER_INTENSET_USBDETECTED_Msk         ( 0x1UL << POWER_INTENSET_USBDETECTED_Pos ) /*!< Bit mask of USBDETECTED field. */
#define POWER_INTENSET_USBDETECTED_Disabled    ( 0UL )                                     /*!< Read: Disabled */
#define POWER_INTENSET_USBDETECTED_Enabled     ( 1UL )                                     /*!< Read: Enabled */
#define POWER_INTENSET_USBDETECTED_Set         ( 1UL )                                     /*!< Enable */

/* Bit 6 : Write '1' to enable interrupt for event SLEEPEXIT */
#define POWER_INTENSET_SLEEPEXIT_Pos           ( 6UL )                                   /*!< Position of SLEEPEXIT field. */
#define POWER_INTENSET_SLEEPEXIT_Msk           ( 0x1UL << POWER_INTENSET_SLEEPEXIT_Pos ) /*!< Bit mask of SLEEPEXIT field. */
#define POWER_INTENSET_SLEEPEXIT_Disabled      ( 0UL )                                   /*!< Read: Disabled */
#define POWER_INTENSET_SLEEPEXIT_Enabled       ( 1UL )                                   /*!< Read: Enabled */
#define POWER_INTENSET_SLEEPEXIT_Set           ( 1UL )                                   /*!< Enable */

/* Bit 5 : Write '1' to enable interrupt for event SLEEPENTER */
#define POWER_INTENSET_SLEEPENTER_Pos          ( 5UL )                                    /*!< Position of SLEEPENTER field. */
#define POWER_INTENSET_SLEEPENTER_Msk          ( 0x1UL << POWER_INTENSET_SLEEPENTER_Pos ) /*!< Bit mask of SLEEPENTER field. */
#define POWER_INTENSET_SLEEPENTER_Disabled     ( 0UL )                                    /*!< Read: Disabled */
#define POWER_INTENSET_SLEEPENTER_Enabled      ( 1UL )                                    /*!< Read: Enabled */
#define POWER_INTENSET_SLEEPENTER_Set          ( 1UL )                                    /*!< Enable */

/* Bit 2 : Write '1' to enable interrupt for event POFWARN */
#define POWER_INTENSET_POFWARN_Pos             ( 2UL )                                 /*!< Position of POFWARN field. */
#define POWER_INTENSET_POFWARN_Msk             ( 0x1UL << POWER_INTENSET_POFWARN_Pos ) /*!< Bit mask of POFWARN field. */
#define POWER_INTENSET_POFWARN_Disabled        ( 0UL )                                 /*!< Read: Disabled */
#define POWER_INTENSET_POFWARN_Enabled         ( 1UL )                                 /*!< Read: Enabled */
#define POWER_INTENSET_POFWARN_Set             ( 1UL )                                 /*!< Enable */

/* Register: POWER_INTENCLR */
/* Description: Disable interrupt */

/* Bit 9 : Write '1' to disable interrupt for event USBPWRRDY */
#define POWER_INTENCLR_USBPWRRDY_Pos           ( 9UL )                                   /*!< Position of USBPWRRDY field. */
#define POWER_INTENCLR_USBPWRRDY_Msk           ( 0x1UL << POWER_INTENCLR_USBPWRRDY_Pos ) /*!< Bit mask of USBPWRRDY field. */
#define POWER_INTENCLR_USBPWRRDY_Disabled      ( 0UL )                                   /*!< Read: Disabled */
#define POWER_INTENCLR_USBPWRRDY_Enabled       ( 1UL )                                   /*!< Read: Enabled */
#define POWER_INTENCLR_USBPWRRDY_Clear         ( 1UL )                                   /*!< Disable */

/* Bit 8 : Write '1' to disable interrupt for event USBREMOVED */
#define POWER_INTENCLR_USBREMOVED_Pos          ( 8UL )                                    /*!< Position of USBREMOVED field. */
#define POWER_INTENCLR_USBREMOVED_Msk          ( 0x1UL << POWER_INTENCLR_USBREMOVED_Pos ) /*!< Bit mask of USBREMOVED field. */
#define POWER_INTENCLR_USBREMOVED_Disabled     ( 0UL )                                    /*!< Read: Disabled */
#define POWER_INTENCLR_USBREMOVED_Enabled      ( 1UL )                                    /*!< Read: Enabled */
#define POWER_INTENCLR_USBREMOVED_Clear        ( 1UL )                                    /*!< Disable */

