FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bit 7 : Write '1' to disable interrupt for event USBDETECTED */
#define POWER_INTENCLR_USBDETECTED_Pos         ( 7UL )                                     /*!< Position of USBDETECTED field. */
#define POWER_INTENCLR_USBDETECTED_Msk         ( 0x1UL << POWER_INTENCLR_USBDETECTED_Pos ) /*!< Bit mask of USBDETECTED field. */
#define POWER_INTENCLR_USBDETECTED_Disabled    ( 0UL )                                     /*!< Read: Disabled */
#define POWER_INTENCLR_USBDETECTED_Enabled     ( 1UL )                                     /*!< Read: Enabled */
#define POWER_INTENCLR_USBDETECTED_Clear       ( 1UL )                                     /*!< Disable */

/* Bit 6 : Write '1' to disable interrupt for event SLEEPEXIT */
#define POWER_INTENCLR_SLEEPEXIT_Pos           ( 6UL )                                   /*!< Position of SLEEPEXIT field. */
#define POWER_INTENCLR_SLEEPEXIT_Msk           ( 0x1UL << POWER_INTENCLR_SLEEPEXIT_Pos ) /*!< Bit mask of SLEEPEXIT field. */
#define POWER_INTENCLR_SLEEPEXIT_Disabled      ( 0UL )                                   /*!< Read: Disabled */
#define POWER_INTENCLR_SLEEPEXIT_Enabled       ( 1UL )                                   /*!< Read: Enabled */
#define POWER_INTENCLR_SLEEPEXIT_Clear         ( 1UL )                                   /*!< Disable */

/* Bit 5 : Write '1' to disable interrupt for event SLEEPENTER */
#define POWER_INTENCLR_SLEEPENTER_Pos          ( 5UL )                                    /*!< Position of SLEEPENTER field. */
#define POWER_INTENCLR_SLEEPENTER_Msk          ( 0x1UL << POWER_INTENCLR_SLEEPENTER_Pos ) /*!< Bit mask of SLEEPENTER field. */
#define POWER_INTENCLR_SLEEPENTER_Disabled     ( 0UL )                                    /*!< Read: Disabled */
#define POWER_INTENCLR_SLEEPENTER_Enabled      ( 1UL )                                    /*!< Read: Enabled */
#define POWER_INTENCLR_SLEEPENTER_Clear        ( 1UL )                                    /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event POFWARN */
#define POWER_INTENCLR_POFWARN_Pos             ( 2UL )                                 /*!< Position of POFWARN field. */
#define POWER_INTENCLR_POFWARN_Msk             ( 0x1UL << POWER_INTENCLR_POFWARN_Pos ) /*!< Bit mask of POFWARN field. */
#define POWER_INTENCLR_POFWARN_Disabled        ( 0UL )                                 /*!< Read: Disabled */
#define POWER_INTENCLR_POFWARN_Enabled         ( 1UL )                                 /*!< Read: Enabled */
#define POWER_INTENCLR_POFWARN_Clear           ( 1UL )                                 /*!< Disable */

/* Register: POWER_RESETREAS */
/* Description: Reset reason */

/* Bit 20 : Reset due to wake up from System OFF mode by VBUS rising into valid range */
#define POWER_RESETREAS_VBUS_Pos                ( 20UL )                              /*!< Position of VBUS field. */
#define POWER_RESETREAS_VBUS_Msk                ( 0x1UL << POWER_RESETREAS_VBUS_Pos ) /*!< Bit mask of VBUS field. */
#define POWER_RESETREAS_VBUS_NotDetected        ( 0UL )                               /*!< Not detected */
#define POWER_RESETREAS_VBUS_Detected           ( 1UL )                               /*!< Detected */

/* Bit 18 : Reset due to wake up from System OFF mode when wakeup is triggered from entering into debug interface mode */
#define POWER_RESETREAS_DIF_Pos                 ( 18UL )                             /*!< Position of DIF field. */
#define POWER_RESETREAS_DIF_Msk                 ( 0x1UL << POWER_RESETREAS_DIF_Pos ) /*!< Bit mask of DIF field. */
#define POWER_RESETREAS_DIF_NotDetected         ( 0UL )                              /*!< Not detected */
#define POWER_RESETREAS_DIF_Detected            ( 1UL )                              /*!< Detected */

/* Bit 16 : Reset due to wake up from System OFF mode when wakeup is triggered from DETECT signal from GPIO */
#define POWER_RESETREAS_OFF_Pos                 ( 16UL )                             /*!< Position of OFF field. */
#define POWER_RESETREAS_OFF_Msk                 ( 0x1UL << POWER_RESETREAS_OFF_Pos ) /*!< Bit mask of OFF field. */
#define POWER_RESETREAS_OFF_NotDetected         ( 0UL )                              /*!< Not detected */
#define POWER_RESETREAS_OFF_Detected            ( 1UL )                              /*!< Detected */

/* Bit 3 : Reset from CPU lock-up detected */
#define POWER_RESETREAS_LOCKUP_Pos              ( 3UL )                                 /*!< Position of LOCKUP field. */
#define POWER_RESETREAS_LOCKUP_Msk              ( 0x1UL << POWER_RESETREAS_LOCKUP_Pos ) /*!< Bit mask of LOCKUP field. */
#define POWER_RESETREAS_LOCKUP_NotDetected      ( 0UL )                                 /*!< Not detected */
#define POWER_RESETREAS_LOCKUP_Detected         ( 1UL )                                 /*!< Detected */

/* Bit 2 : Reset from soft reset detected */
#define POWER_RESETREAS_SREQ_Pos                ( 2UL )                               /*!< Position of SREQ field. */
#define POWER_RESETREAS_SREQ_Msk                ( 0x1UL << POWER_RESETREAS_SREQ_Pos ) /*!< Bit mask of SREQ field. */
#define POWER_RESETREAS_SREQ_NotDetected        ( 0UL )                               /*!< Not detected */
#define POWER_RESETREAS_SREQ_Detected           ( 1UL )                               /*!< Detected */

/* Bit 1 : Reset from watchdog detected */
#define POWER_RESETREAS_DOG_Pos                 ( 1UL )                              /*!< Position of DOG field. */
#define POWER_RESETREAS_DOG_Msk                 ( 0x1UL << POWER_RESETREAS_DOG_Pos ) /*!< Bit mask of DOG field. */
#define POWER_RESETREAS_DOG_NotDetected         ( 0UL )                              /*!< Not detected */
#define POWER_RESETREAS_DOG_Detected            ( 1UL )                              /*!< Detected */

/* Bit 0 : Reset from pin-reset detected */
#define POWER_RESETREAS_RESETPIN_Pos            ( 0UL )                                   /*!< Position of RESETPIN field. */
#define POWER_RESETREAS_RESETPIN_Msk            ( 0x1UL << POWER_RESETREAS_RESETPIN_Pos ) /*!< Bit mask of RESETPIN field. */
#define POWER_RESETREAS_RESETPIN_NotDetected    ( 0UL )                                   /*!< Not detected */
#define POWER_RESETREAS_RESETPIN_Detected       ( 1UL )                                   /*!< Detected */

/* Register: POWER_RAMSTATUS */
/* Description: Deprecated register - RAM status register */

/* Bit 1 : RAM block 1 is on or off/powering up */
#define POWER_RAMSTATUS_RAMBLOCK1_Pos    ( 1UL )                                    /*!< Position of RAMBLOCK1 field. */
#define POWER_RAMSTATUS_RAMBLOCK1_Msk    ( 0x1UL << POWER_RAMSTATUS_RAMBLOCK1_Pos ) /*!< Bit mask of RAMBLOCK1 field. */
#define POWER_RAMSTATUS_RAMBLOCK1_Off    ( 0UL )                                    /*!< Off */
#define POWER_RAMSTATUS_RAMBLOCK1_On     ( 1UL )                                    /*!< On */

