FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bit 0 : RAM block 0 is on or off/powering up */
#define POWER_RAMSTATUS_RAMBLOCK0_Pos    ( 0UL )                                    /*!< Position of RAMBLOCK0 field. */
#define POWER_RAMSTATUS_RAMBLOCK0_Msk    ( 0x1UL << POWER_RAMSTATUS_RAMBLOCK0_Pos ) /*!< Bit mask of RAMBLOCK0 field. */
#define POWER_RAMSTATUS_RAMBLOCK0_Off    ( 0UL )                                    /*!< Off */
#define POWER_RAMSTATUS_RAMBLOCK0_On     ( 1UL )                                    /*!< On */

/* Register: POWER_USBREGSTATUS */
/* Description: USB supply status */

/* Bit 1 : USB supply output settling time elapsed */
#define POWER_USBREGSTATUS_OUTPUTRDY_Pos             ( 1UL )                                       /*!< Position of OUTPUTRDY field. */
#define POWER_USBREGSTATUS_OUTPUTRDY_Msk             ( 0x1UL << POWER_USBREGSTATUS_OUTPUTRDY_Pos ) /*!< Bit mask of OUTPUTRDY field. */
#define POWER_USBREGSTATUS_OUTPUTRDY_NotReady        ( 0UL )                                       /*!< USBREG output settling time not elapsed */
#define POWER_USBREGSTATUS_OUTPUTRDY_Ready           ( 1UL )                                       /*!< USBREG output settling time elapsed (same information as USBPWRRDY event) */

/* Bit 0 : VBUS input detection status (USBDETECTED and USBREMOVED events are derived from this information) */
#define POWER_USBREGSTATUS_VBUSDETECT_Pos            ( 0UL )                                        /*!< Position of VBUSDETECT field. */
#define POWER_USBREGSTATUS_VBUSDETECT_Msk            ( 0x1UL << POWER_USBREGSTATUS_VBUSDETECT_Pos ) /*!< Bit mask of VBUSDETECT field. */
#define POWER_USBREGSTATUS_VBUSDETECT_NoVbus         ( 0UL )                                        /*!< VBUS voltage below valid threshold */
#define POWER_USBREGSTATUS_VBUSDETECT_VbusPresent    ( 1UL )                                        /*!< VBUS voltage above valid threshold */

/* Register: POWER_SYSTEMOFF */
/* Description: System OFF register */

/* Bit 0 : Enable System OFF mode */
#define POWER_SYSTEMOFF_SYSTEMOFF_Pos      ( 0UL )                                    /*!< Position of SYSTEMOFF field. */
#define POWER_SYSTEMOFF_SYSTEMOFF_Msk      ( 0x1UL << POWER_SYSTEMOFF_SYSTEMOFF_Pos ) /*!< Bit mask of SYSTEMOFF field. */
#define POWER_SYSTEMOFF_SYSTEMOFF_Enter    ( 1UL )                                    /*!< Enable System OFF mode */

/* Register: POWER_POFCON */
/* Description: Power-fail comparator configuration */

/* Bits 11..8 : Power-fail comparator threshold setting for high voltage mode (supply connected to VDDH only). This setting does not apply for normal voltage mode (supply connected to both VDD and VDDH). */
#define POWER_POFCON_THRESHOLDVDDH_Pos    ( 8UL )                                     /*!< Position of THRESHOLDVDDH field. */
#define POWER_POFCON_THRESHOLDVDDH_Msk    ( 0xFUL << POWER_POFCON_THRESHOLDVDDH_Pos ) /*!< Bit mask of THRESHOLDVDDH field. */
#define POWER_POFCON_THRESHOLDVDDH_V27    ( 0UL )                                     /*!< Set threshold to 2.7 V */
#define POWER_POFCON_THRESHOLDVDDH_V28    ( 1UL )                                     /*!< Set threshold to 2.8 V */
#define POWER_POFCON_THRESHOLDVDDH_V29    ( 2UL )                                     /*!< Set threshold to 2.9 V */
#define POWER_POFCON_THRESHOLDVDDH_V30    ( 3UL )                                     /*!< Set threshold to 3.0 V */
#define POWER_POFCON_THRESHOLDVDDH_V31    ( 4UL )                                     /*!< Set threshold to 3.1 V */
#define POWER_POFCON_THRESHOLDVDDH_V32    ( 5UL )                                     /*!< Set threshold to 3.2 V */
#define POWER_POFCON_THRESHOLDVDDH_V33    ( 6UL )                                     /*!< Set threshold to 3.3 V */
#define POWER_POFCON_THRESHOLDVDDH_V34    ( 7UL )                                     /*!< Set threshold to 3.4 V */
#define POWER_POFCON_THRESHOLDVDDH_V35    ( 8UL )                                     /*!< Set threshold to 3.5 V */
#define POWER_POFCON_THRESHOLDVDDH_V36    ( 9UL )                                     /*!< Set threshold to 3.6 V */
#define POWER_POFCON_THRESHOLDVDDH_V37    ( 10UL )                                    /*!< Set threshold to 3.7 V */
#define POWER_POFCON_THRESHOLDVDDH_V38    ( 11UL )                                    /*!< Set threshold to 3.8 V */
#define POWER_POFCON_THRESHOLDVDDH_V39    ( 12UL )                                    /*!< Set threshold to 3.9 V */
#define POWER_POFCON_THRESHOLDVDDH_V40    ( 13UL )                                    /*!< Set threshold to 4.0 V */
#define POWER_POFCON_THRESHOLDVDDH_V41    ( 14UL )                                    /*!< Set threshold to 4.1 V */
#define POWER_POFCON_THRESHOLDVDDH_V42    ( 15UL )                                    /*!< Set threshold to 4.2 V */

/* Bits 4..1 : Power-fail comparator threshold setting. This setting applies both for normal voltage mode (supply connected to both VDD and VDDH) and high voltage mode (supply connected to VDDH only). Values 0-3 set threshold below 1.7 V and should not be used as brown out detection will be activated before power failure warning on such low voltages. */
#define POWER_POFCON_THRESHOLD_Pos        ( 1UL )                                 /*!< Position of THRESHOLD field. */
#define POWER_POFCON_THRESHOLD_Msk        ( 0xFUL << POWER_POFCON_THRESHOLD_Pos ) /*!< Bit mask of THRESHOLD field. */
#define POWER_POFCON_THRESHOLD_V17        ( 4UL )                                 /*!< Set threshold to 1.7 V */
#define POWER_POFCON_THRESHOLD_V18        ( 5UL )                                 /*!< Set threshold to 1.8 V */
#define POWER_POFCON_THRESHOLD_V19        ( 6UL )                                 /*!< Set threshold to 1.9 V */
#define POWER_POFCON_THRESHOLD_V20        ( 7UL )                                 /*!< Set threshold to 2.0 V */
#define POWER_POFCON_THRESHOLD_V21        ( 8UL )                                 /*!< Set threshold to 2.1 V */
#define POWER_POFCON_THRESHOLD_V22        ( 9UL )                                 /*!< Set threshold to 2.2 V */
#define POWER_POFCON_THRESHOLD_V23        ( 10UL )                                /*!< Set threshold to 2.3 V */
#define POWER_POFCON_THRESHOLD_V24        ( 11UL )                                /*!< Set threshold to 2.4 V */
#define POWER_POFCON_THRESHOLD_V25        ( 12UL )                                /*!< Set threshold to 2.5 V */
#define POWER_POFCON_THRESHOLD_V26        ( 13UL )                                /*!< Set threshold to 2.6 V */
#define POWER_POFCON_THRESHOLD_V27        ( 14UL )                                /*!< Set threshold to 2.7 V */
#define POWER_POFCON_THRESHOLD_V28        ( 15UL )                                /*!< Set threshold to 2.8 V */

/* Bit 0 : Enable or disable power failure warning */
#define POWER_POFCON_POF_Pos              ( 0UL )                           /*!< Position of POF field. */
#define POWER_POFCON_POF_Msk              ( 0x1UL << POWER_POFCON_POF_Pos ) /*!< Bit mask of POF field. */
#define POWER_POFCON_POF_Disabled         ( 0UL )                           /*!< Disable */
#define POWER_POFCON_POF_Enabled          ( 1UL )                           /*!< Enable */

