FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bit 1 : Keep RAM section S1 of RAMn on or off in System ON mode */
#define POWER_RAM_POWERCLR_S1POWER_Pos        ( 1UL )                                     /*!< Position of S1POWER field. */
#define POWER_RAM_POWERCLR_S1POWER_Msk        ( 0x1UL << POWER_RAM_POWERCLR_S1POWER_Pos ) /*!< Bit mask of S1POWER field. */
#define POWER_RAM_POWERCLR_S1POWER_Off        ( 1UL )                                     /*!< Off */

/* Bit 0 : Keep RAM section S0 of RAMn on or off in System ON mode */
#define POWER_RAM_POWERCLR_S0POWER_Pos        ( 0UL )                                     /*!< Position of S0POWER field. */
#define POWER_RAM_POWERCLR_S0POWER_Msk        ( 0x1UL << POWER_RAM_POWERCLR_S0POWER_Pos ) /*!< Bit mask of S0POWER field. */
#define POWER_RAM_POWERCLR_S0POWER_Off        ( 1UL )                                     /*!< Off */


/* Peripheral: PPI */
/* Description: Programmable Peripheral Interconnect */

/* Register: PPI_TASKS_CHG_EN */
/* Description: Description cluster: Enable channel group n */

/* Bit 0 : Enable channel group n */
#define PPI_TASKS_CHG_EN_EN_Pos        ( 0UL )                              /*!< Position of EN field. */
#define PPI_TASKS_CHG_EN_EN_Msk        ( 0x1UL << PPI_TASKS_CHG_EN_EN_Pos ) /*!< Bit mask of EN field. */
#define PPI_TASKS_CHG_EN_EN_Trigger    ( 1UL )                              /*!< Trigger task */

/* Register: PPI_TASKS_CHG_DIS */
/* Description: Description cluster: Disable channel group n */

/* Bit 0 : Disable channel group n */
#define PPI_TASKS_CHG_DIS_DIS_Pos        ( 0UL )                                /*!< Position of DIS field. */
#define PPI_TASKS_CHG_DIS_DIS_Msk        ( 0x1UL << PPI_TASKS_CHG_DIS_DIS_Pos ) /*!< Bit mask of DIS field. */
#define PPI_TASKS_CHG_DIS_DIS_Trigger    ( 1UL )                                /*!< Trigger task */

/* Register: PPI_CHEN */
/* Description: Channel enable register */

/* Bit 31 : Enable or disable channel 31 */
#define PPI_CHEN_CH31_Pos         ( 31UL )                       /*!< Position of CH31 field. */
#define PPI_CHEN_CH31_Msk         ( 0x1UL << PPI_CHEN_CH31_Pos ) /*!< Bit mask of CH31 field. */
#define PPI_CHEN_CH31_Disabled    ( 0UL )                        /*!< Disable channel */
#define PPI_CHEN_CH31_Enabled     ( 1UL )                        /*!< Enable channel */

/* Bit 30 : Enable or disable channel 30 */
#define PPI_CHEN_CH30_Pos         ( 30UL )                       /*!< Position of CH30 field. */
#define PPI_CHEN_CH30_Msk         ( 0x1UL << PPI_CHEN_CH30_Pos ) /*!< Bit mask of CH30 field. */
#define PPI_CHEN_CH30_Disabled    ( 0UL )                        /*!< Disable channel */
#define PPI_CHEN_CH30_Enabled     ( 1UL )                        /*!< Enable channel */

/* Bit 29 : Enable or disable channel 29 */
#define PPI_CHEN_CH29_Pos         ( 29UL )                       /*!< Position of CH29 field. */
#define PPI_CHEN_CH29_Msk         ( 0x1UL << PPI_CHEN_CH29_Pos ) /*!< Bit mask of CH29 field. */
#define PPI_CHEN_CH29_Disabled    ( 0UL )                        /*!< Disable channel */
#define PPI_CHEN_CH29_Enabled     ( 1UL )                        /*!< Enable channel */

/* Bit 28 : Enable or disable channel 28 */
#define PPI_CHEN_CH28_Pos         ( 28UL )                       /*!< Position of CH28 field. */
#define PPI_CHEN_CH28_Msk         ( 0x1UL << PPI_CHEN_CH28_Pos ) /*!< Bit mask of CH28 field. */
#define PPI_CHEN_CH28_Disabled    ( 0UL )                        /*!< Disable channel */
#define PPI_CHEN_CH28_Enabled     ( 1UL )                        /*!< Enable channel */

/* Bit 27 : Enable or disable channel 27 */
#define PPI_CHEN_CH27_Pos         ( 27UL )                       /*!< Position of CH27 field. */
#define PPI_CHEN_CH27_Msk         ( 0x1UL << PPI_CHEN_CH27_Pos ) /*!< Bit mask of CH27 field. */
#define PPI_CHEN_CH27_Disabled    ( 0UL )                        /*!< Disable channel */
#define PPI_CHEN_CH27_Enabled     ( 1UL )                        /*!< Enable channel */

/* Bit 26 : Enable or disable channel 26 */
#define PPI_CHEN_CH26_Pos         ( 26UL )                       /*!< Position of CH26 field. */
#define PPI_CHEN_CH26_Msk         ( 0x1UL << PPI_CHEN_CH26_Pos ) /*!< Bit mask of CH26 field. */
#define PPI_CHEN_CH26_Disabled    ( 0UL )                        /*!< Disable channel */
#define PPI_CHEN_CH26_Enabled     ( 1UL )                        /*!< Enable channel */

/* Bit 25 : Enable or disable channel 25 */
#define PPI_CHEN_CH25_Pos         ( 25UL )                       /*!< Position of CH25 field. */
#define PPI_CHEN_CH25_Msk         ( 0x1UL << PPI_CHEN_CH25_Pos ) /*!< Bit mask of CH25 field. */
#define PPI_CHEN_CH25_Disabled    ( 0UL )                        /*!< Disable channel */
#define PPI_CHEN_CH25_Enabled     ( 1UL )                        /*!< Enable channel */

/* Bit 24 : Enable or disable channel 24 */
#define PPI_CHEN_CH24_Pos         ( 24UL )                       /*!< Position of CH24 field. */
#define PPI_CHEN_CH24_Msk         ( 0x1UL << PPI_CHEN_CH24_Pos ) /*!< Bit mask of CH24 field. */
#define PPI_CHEN_CH24_Disabled    ( 0UL )                        /*!< Disable channel */
#define PPI_CHEN_CH24_Enabled     ( 1UL )                        /*!< Enable channel */

/* Bit 23 : Enable or disable channel 23 */
#define PPI_CHEN_CH23_Pos         ( 23UL )                       /*!< Position of CH23 field. */
#define PPI_CHEN_CH23_Msk         ( 0x1UL << PPI_CHEN_CH23_Pos ) /*!< Bit mask of CH23 field. */
#define PPI_CHEN_CH23_Disabled    ( 0UL )                        /*!< Disable channel */
#define PPI_CHEN_CH23_Enabled     ( 1UL )                        /*!< Enable channel */

/* Bit 22 : Enable or disable channel 22 */
#define PPI_CHEN_CH22_Pos         ( 22UL )                       /*!< Position of CH22 field. */
#define PPI_CHEN_CH22_Msk         ( 0x1UL << PPI_CHEN_CH22_Pos ) /*!< Bit mask of CH22 field. */
#define PPI_CHEN_CH22_Disabled    ( 0UL )                        /*!< Disable channel */
#define PPI_CHEN_CH22_Enabled     ( 1UL )                        /*!< Enable channel */

