FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bit 21 : Enable or disable channel 21 */
#define PPI_CHEN_CH21_Pos         ( 21UL )                       /*!< Position of CH21 field. */
#define PPI_CHEN_CH21_Msk         ( 0x1UL << PPI_CHEN_CH21_Pos ) /*!< Bit mask of CH21 field. */
#define PPI_CHEN_CH21_Disabled    ( 0UL )                        /*!< Disable channel */
#define PPI_CHEN_CH21_Enabled     ( 1UL )                        /*!< Enable channel */

/* Bit 20 : Enable or disable channel 20 */
#define PPI_CHEN_CH20_Pos         ( 20UL )                       /*!< Position of CH20 field. */
#define PPI_CHEN_CH20_Msk         ( 0x1UL << PPI_CHEN_CH20_Pos ) /*!< Bit mask of CH20 field. */
#define PPI_CHEN_CH20_Disabled    ( 0UL )                        /*!< Disable channel */
#define PPI_CHEN_CH20_Enabled     ( 1UL )                        /*!< Enable channel */

/* Bit 19 : Enable or disable channel 19 */
#define PPI_CHEN_CH19_Pos         ( 19UL )                       /*!< Position of CH19 field. */
#define PPI_CHEN_CH19_Msk         ( 0x1UL << PPI_CHEN_CH19_Pos ) /*!< Bit mask of CH19 field. */
#define PPI_CHEN_CH19_Disabled    ( 0UL )                        /*!< Disable channel */
#define PPI_CHEN_CH19_Enabled     ( 1UL )                        /*!< Enable channel */

/* Bit 18 : Enable or disable channel 18 */
#define PPI_CHEN_CH18_Pos         ( 18UL )                       /*!< Position of CH18 field. */
#define PPI_CHEN_CH18_Msk         ( 0x1UL << PPI_CHEN_CH18_Pos ) /*!< Bit mask of CH18 field. */
#define PPI_CHEN_CH18_Disabled    ( 0UL )                        /*!< Disable channel */
#define PPI_CHEN_CH18_Enabled     ( 1UL )                        /*!< Enable channel */

/* Bit 17 : Enable or disable channel 17 */
#define PPI_CHEN_CH17_Pos         ( 17UL )                       /*!< Position of CH17 field. */
#define PPI_CHEN_CH17_Msk         ( 0x1UL << PPI_CHEN_CH17_Pos ) /*!< Bit mask of CH17 field. */
#define PPI_CHEN_CH17_Disabled    ( 0UL )                        /*!< Disable channel */
#define PPI_CHEN_CH17_Enabled     ( 1UL )                        /*!< Enable channel */

/* Bit 16 : Enable or disable channel 16 */
#define PPI_CHEN_CH16_Pos         ( 16UL )                       /*!< Position of CH16 field. */
#define PPI_CHEN_CH16_Msk         ( 0x1UL << PPI_CHEN_CH16_Pos ) /*!< Bit mask of CH16 field. */
#define PPI_CHEN_CH16_Disabled    ( 0UL )                        /*!< Disable channel */
#define PPI_CHEN_CH16_Enabled     ( 1UL )                        /*!< Enable channel */

/* Bit 15 : Enable or disable channel 15 */
#define PPI_CHEN_CH15_Pos         ( 15UL )                       /*!< Position of CH15 field. */
#define PPI_CHEN_CH15_Msk         ( 0x1UL << PPI_CHEN_CH15_Pos ) /*!< Bit mask of CH15 field. */
#define PPI_CHEN_CH15_Disabled    ( 0UL )                        /*!< Disable channel */
#define PPI_CHEN_CH15_Enabled     ( 1UL )                        /*!< Enable channel */

/* Bit 14 : Enable or disable channel 14 */
#define PPI_CHEN_CH14_Pos         ( 14UL )                       /*!< Position of CH14 field. */
#define PPI_CHEN_CH14_Msk         ( 0x1UL << PPI_CHEN_CH14_Pos ) /*!< Bit mask of CH14 field. */
#define PPI_CHEN_CH14_Disabled    ( 0UL )                        /*!< Disable channel */
#define PPI_CHEN_CH14_Enabled     ( 1UL )                        /*!< Enable channel */

/* Bit 13 : Enable or disable channel 13 */
#define PPI_CHEN_CH13_Pos         ( 13UL )                       /*!< Position of CH13 field. */
#define PPI_CHEN_CH13_Msk         ( 0x1UL << PPI_CHEN_CH13_Pos ) /*!< Bit mask of CH13 field. */
#define PPI_CHEN_CH13_Disabled    ( 0UL )                        /*!< Disable channel */
#define PPI_CHEN_CH13_Enabled     ( 1UL )                        /*!< Enable channel */

/* Bit 12 : Enable or disable channel 12 */
#define PPI_CHEN_CH12_Pos         ( 12UL )                       /*!< Position of CH12 field. */
#define PPI_CHEN_CH12_Msk         ( 0x1UL << PPI_CHEN_CH12_Pos ) /*!< Bit mask of CH12 field. */
#define PPI_CHEN_CH12_Disabled    ( 0UL )                        /*!< Disable channel */
#define PPI_CHEN_CH12_Enabled     ( 1UL )                        /*!< Enable channel */

/* Bit 11 : Enable or disable channel 11 */
#define PPI_CHEN_CH11_Pos         ( 11UL )                       /*!< Position of CH11 field. */
#define PPI_CHEN_CH11_Msk         ( 0x1UL << PPI_CHEN_CH11_Pos ) /*!< Bit mask of CH11 field. */
#define PPI_CHEN_CH11_Disabled    ( 0UL )                        /*!< Disable channel */
#define PPI_CHEN_CH11_Enabled     ( 1UL )                        /*!< Enable channel */

/* Bit 10 : Enable or disable channel 10 */
#define PPI_CHEN_CH10_Pos         ( 10UL )                       /*!< Position of CH10 field. */
#define PPI_CHEN_CH10_Msk         ( 0x1UL << PPI_CHEN_CH10_Pos ) /*!< Bit mask of CH10 field. */
#define PPI_CHEN_CH10_Disabled    ( 0UL )                        /*!< Disable channel */
#define PPI_CHEN_CH10_Enabled     ( 1UL )                        /*!< Enable channel */

/* Bit 9 : Enable or disable channel 9 */
#define PPI_CHEN_CH9_Pos          ( 9UL )                       /*!< Position of CH9 field. */
#define PPI_CHEN_CH9_Msk          ( 0x1UL << PPI_CHEN_CH9_Pos ) /*!< Bit mask of CH9 field. */
#define PPI_CHEN_CH9_Disabled     ( 0UL )                       /*!< Disable channel */
#define PPI_CHEN_CH9_Enabled      ( 1UL )                       /*!< Enable channel */

/* Bit 8 : Enable or disable channel 8 */
#define PPI_CHEN_CH8_Pos          ( 8UL )                       /*!< Position of CH8 field. */
#define PPI_CHEN_CH8_Msk          ( 0x1UL << PPI_CHEN_CH8_Pos ) /*!< Bit mask of CH8 field. */
#define PPI_CHEN_CH8_Disabled     ( 0UL )                       /*!< Disable channel */
#define PPI_CHEN_CH8_Enabled      ( 1UL )                       /*!< Enable channel */

/* Bit 7 : Enable or disable channel 7 */
#define PPI_CHEN_CH7_Pos          ( 7UL )                       /*!< Position of CH7 field. */
#define PPI_CHEN_CH7_Msk          ( 0x1UL << PPI_CHEN_CH7_Pos ) /*!< Bit mask of CH7 field. */
#define PPI_CHEN_CH7_Disabled     ( 0UL )                       /*!< Disable channel */
#define PPI_CHEN_CH7_Enabled      ( 1UL )                       /*!< Enable channel */

