FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bit 26 : Channel 26 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH26_Pos         ( 26UL )                          /*!< Position of CH26 field. */
#define PPI_CHENCLR_CH26_Msk         ( 0x1UL << PPI_CHENCLR_CH26_Pos ) /*!< Bit mask of CH26 field. */
#define PPI_CHENCLR_CH26_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENCLR_CH26_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENCLR_CH26_Clear       ( 1UL )                           /*!< Write: disable channel */

/* Bit 25 : Channel 25 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH25_Pos         ( 25UL )                          /*!< Position of CH25 field. */
#define PPI_CHENCLR_CH25_Msk         ( 0x1UL << PPI_CHENCLR_CH25_Pos ) /*!< Bit mask of CH25 field. */
#define PPI_CHENCLR_CH25_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENCLR_CH25_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENCLR_CH25_Clear       ( 1UL )                           /*!< Write: disable channel */

/* Bit 24 : Channel 24 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH24_Pos         ( 24UL )                          /*!< Position of CH24 field. */
#define PPI_CHENCLR_CH24_Msk         ( 0x1UL << PPI_CHENCLR_CH24_Pos ) /*!< Bit mask of CH24 field. */
#define PPI_CHENCLR_CH24_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENCLR_CH24_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENCLR_CH24_Clear       ( 1UL )                           /*!< Write: disable channel */

/* Bit 23 : Channel 23 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH23_Pos         ( 23UL )                          /*!< Position of CH23 field. */
#define PPI_CHENCLR_CH23_Msk         ( 0x1UL << PPI_CHENCLR_CH23_Pos ) /*!< Bit mask of CH23 field. */
#define PPI_CHENCLR_CH23_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENCLR_CH23_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENCLR_CH23_Clear       ( 1UL )                           /*!< Write: disable channel */

/* Bit 22 : Channel 22 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH22_Pos         ( 22UL )                          /*!< Position of CH22 field. */
#define PPI_CHENCLR_CH22_Msk         ( 0x1UL << PPI_CHENCLR_CH22_Pos ) /*!< Bit mask of CH22 field. */
#define PPI_CHENCLR_CH22_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENCLR_CH22_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENCLR_CH22_Clear       ( 1UL )                           /*!< Write: disable channel */

/* Bit 21 : Channel 21 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH21_Pos         ( 21UL )                          /*!< Position of CH21 field. */
#define PPI_CHENCLR_CH21_Msk         ( 0x1UL << PPI_CHENCLR_CH21_Pos ) /*!< Bit mask of CH21 field. */
#define PPI_CHENCLR_CH21_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENCLR_CH21_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENCLR_CH21_Clear       ( 1UL )                           /*!< Write: disable channel */

/* Bit 20 : Channel 20 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH20_Pos         ( 20UL )                          /*!< Position of CH20 field. */
#define PPI_CHENCLR_CH20_Msk         ( 0x1UL << PPI_CHENCLR_CH20_Pos ) /*!< Bit mask of CH20 field. */
#define PPI_CHENCLR_CH20_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENCLR_CH20_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENCLR_CH20_Clear       ( 1UL )                           /*!< Write: disable channel */

/* Bit 19 : Channel 19 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH19_Pos         ( 19UL )                          /*!< Position of CH19 field. */
#define PPI_CHENCLR_CH19_Msk         ( 0x1UL << PPI_CHENCLR_CH19_Pos ) /*!< Bit mask of CH19 field. */
#define PPI_CHENCLR_CH19_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENCLR_CH19_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENCLR_CH19_Clear       ( 1UL )                           /*!< Write: disable channel */

/* Bit 18 : Channel 18 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH18_Pos         ( 18UL )                          /*!< Position of CH18 field. */
#define PPI_CHENCLR_CH18_Msk         ( 0x1UL << PPI_CHENCLR_CH18_Pos ) /*!< Bit mask of CH18 field. */
#define PPI_CHENCLR_CH18_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENCLR_CH18_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENCLR_CH18_Clear       ( 1UL )                           /*!< Write: disable channel */

/* Bit 17 : Channel 17 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH17_Pos         ( 17UL )                          /*!< Position of CH17 field. */
#define PPI_CHENCLR_CH17_Msk         ( 0x1UL << PPI_CHENCLR_CH17_Pos ) /*!< Bit mask of CH17 field. */
#define PPI_CHENCLR_CH17_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENCLR_CH17_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENCLR_CH17_Clear       ( 1UL )                           /*!< Write: disable channel */

/* Bit 16 : Channel 16 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH16_Pos         ( 16UL )                          /*!< Position of CH16 field. */
#define PPI_CHENCLR_CH16_Msk         ( 0x1UL << PPI_CHENCLR_CH16_Pos ) /*!< Bit mask of CH16 field. */
#define PPI_CHENCLR_CH16_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENCLR_CH16_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENCLR_CH16_Clear       ( 1UL )                           /*!< Write: disable channel */

/* Bit 15 : Channel 15 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH15_Pos         ( 15UL )                          /*!< Position of CH15 field. */
#define PPI_CHENCLR_CH15_Msk         ( 0x1UL << PPI_CHENCLR_CH15_Pos ) /*!< Bit mask of CH15 field. */
#define PPI_CHENCLR_CH15_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENCLR_CH15_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENCLR_CH15_Clear       ( 1UL )                           /*!< Write: disable channel */

