FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bit 14 : Channel 14 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH14_Pos         ( 14UL )                          /*!< Position of CH14 field. */
#define PPI_CHENCLR_CH14_Msk         ( 0x1UL << PPI_CHENCLR_CH14_Pos ) /*!< Bit mask of CH14 field. */
#define PPI_CHENCLR_CH14_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENCLR_CH14_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENCLR_CH14_Clear       ( 1UL )                           /*!< Write: disable channel */

/* Bit 13 : Channel 13 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH13_Pos         ( 13UL )                          /*!< Position of CH13 field. */
#define PPI_CHENCLR_CH13_Msk         ( 0x1UL << PPI_CHENCLR_CH13_Pos ) /*!< Bit mask of CH13 field. */
#define PPI_CHENCLR_CH13_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENCLR_CH13_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENCLR_CH13_Clear       ( 1UL )                           /*!< Write: disable channel */

/* Bit 12 : Channel 12 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH12_Pos         ( 12UL )                          /*!< Position of CH12 field. */
#define PPI_CHENCLR_CH12_Msk         ( 0x1UL << PPI_CHENCLR_CH12_Pos ) /*!< Bit mask of CH12 field. */
#define PPI_CHENCLR_CH12_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENCLR_CH12_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENCLR_CH12_Clear       ( 1UL )                           /*!< Write: disable channel */

/* Bit 11 : Channel 11 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH11_Pos         ( 11UL )                          /*!< Position of CH11 field. */
#define PPI_CHENCLR_CH11_Msk         ( 0x1UL << PPI_CHENCLR_CH11_Pos ) /*!< Bit mask of CH11 field. */
#define PPI_CHENCLR_CH11_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENCLR_CH11_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENCLR_CH11_Clear       ( 1UL )                           /*!< Write: disable channel */

/* Bit 10 : Channel 10 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH10_Pos         ( 10UL )                          /*!< Position of CH10 field. */
#define PPI_CHENCLR_CH10_Msk         ( 0x1UL << PPI_CHENCLR_CH10_Pos ) /*!< Bit mask of CH10 field. */
#define PPI_CHENCLR_CH10_Disabled    ( 0UL )                           /*!< Read: channel disabled */
#define PPI_CHENCLR_CH10_Enabled     ( 1UL )                           /*!< Read: channel enabled */
#define PPI_CHENCLR_CH10_Clear       ( 1UL )                           /*!< Write: disable channel */

/* Bit 9 : Channel 9 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH9_Pos          ( 9UL )                          /*!< Position of CH9 field. */
#define PPI_CHENCLR_CH9_Msk          ( 0x1UL << PPI_CHENCLR_CH9_Pos ) /*!< Bit mask of CH9 field. */
#define PPI_CHENCLR_CH9_Disabled     ( 0UL )                          /*!< Read: channel disabled */
#define PPI_CHENCLR_CH9_Enabled      ( 1UL )                          /*!< Read: channel enabled */
#define PPI_CHENCLR_CH9_Clear        ( 1UL )                          /*!< Write: disable channel */

/* Bit 8 : Channel 8 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH8_Pos          ( 8UL )                          /*!< Position of CH8 field. */
#define PPI_CHENCLR_CH8_Msk          ( 0x1UL << PPI_CHENCLR_CH8_Pos ) /*!< Bit mask of CH8 field. */
#define PPI_CHENCLR_CH8_Disabled     ( 0UL )                          /*!< Read: channel disabled */
#define PPI_CHENCLR_CH8_Enabled      ( 1UL )                          /*!< Read: channel enabled */
#define PPI_CHENCLR_CH8_Clear        ( 1UL )                          /*!< Write: disable channel */

/* Bit 7 : Channel 7 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH7_Pos          ( 7UL )                          /*!< Position of CH7 field. */
#define PPI_CHENCLR_CH7_Msk          ( 0x1UL << PPI_CHENCLR_CH7_Pos ) /*!< Bit mask of CH7 field. */
#define PPI_CHENCLR_CH7_Disabled     ( 0UL )                          /*!< Read: channel disabled */
#define PPI_CHENCLR_CH7_Enabled      ( 1UL )                          /*!< Read: channel enabled */
#define PPI_CHENCLR_CH7_Clear        ( 1UL )                          /*!< Write: disable channel */

/* Bit 6 : Channel 6 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH6_Pos          ( 6UL )                          /*!< Position of CH6 field. */
#define PPI_CHENCLR_CH6_Msk          ( 0x1UL << PPI_CHENCLR_CH6_Pos ) /*!< Bit mask of CH6 field. */
#define PPI_CHENCLR_CH6_Disabled     ( 0UL )                          /*!< Read: channel disabled */
#define PPI_CHENCLR_CH6_Enabled      ( 1UL )                          /*!< Read: channel enabled */
#define PPI_CHENCLR_CH6_Clear        ( 1UL )                          /*!< Write: disable channel */

/* Bit 5 : Channel 5 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH5_Pos          ( 5UL )                          /*!< Position of CH5 field. */
#define PPI_CHENCLR_CH5_Msk          ( 0x1UL << PPI_CHENCLR_CH5_Pos ) /*!< Bit mask of CH5 field. */
#define PPI_CHENCLR_CH5_Disabled     ( 0UL )                          /*!< Read: channel disabled */
#define PPI_CHENCLR_CH5_Enabled      ( 1UL )                          /*!< Read: channel enabled */
#define PPI_CHENCLR_CH5_Clear        ( 1UL )                          /*!< Write: disable channel */

/* Bit 4 : Channel 4 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH4_Pos          ( 4UL )                          /*!< Position of CH4 field. */
#define PPI_CHENCLR_CH4_Msk          ( 0x1UL << PPI_CHENCLR_CH4_Pos ) /*!< Bit mask of CH4 field. */
#define PPI_CHENCLR_CH4_Disabled     ( 0UL )                          /*!< Read: channel disabled */
#define PPI_CHENCLR_CH4_Enabled      ( 1UL )                          /*!< Read: channel enabled */
#define PPI_CHENCLR_CH4_Clear        ( 1UL )                          /*!< Write: disable channel */

/* Bit 3 : Channel 3 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH3_Pos          ( 3UL )                          /*!< Position of CH3 field. */
#define PPI_CHENCLR_CH3_Msk          ( 0x1UL << PPI_CHENCLR_CH3_Pos ) /*!< Bit mask of CH3 field. */
#define PPI_CHENCLR_CH3_Disabled     ( 0UL )                          /*!< Read: channel disabled */
#define PPI_CHENCLR_CH3_Enabled      ( 1UL )                          /*!< Read: channel enabled */
#define PPI_CHENCLR_CH3_Clear        ( 1UL )                          /*!< Write: disable channel */

/* Bit 2 : Channel 2 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH2_Pos          ( 2UL )                          /*!< Position of CH2 field. */
#define PPI_CHENCLR_CH2_Msk          ( 0x1UL << PPI_CHENCLR_CH2_Pos ) /*!< Bit mask of CH2 field. */
#define PPI_CHENCLR_CH2_Disabled     ( 0UL )                          /*!< Read: channel disabled */
#define PPI_CHENCLR_CH2_Enabled      ( 1UL )                          /*!< Read: channel enabled */
#define PPI_CHENCLR_CH2_Clear        ( 1UL )                          /*!< Write: disable channel */

/* Bit 1 : Channel 1 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH1_Pos          ( 1UL )                          /*!< Position of CH1 field. */
#define PPI_CHENCLR_CH1_Msk          ( 0x1UL << PPI_CHENCLR_CH1_Pos ) /*!< Bit mask of CH1 field. */
#define PPI_CHENCLR_CH1_Disabled     ( 0UL )                          /*!< Read: channel disabled */
#define PPI_CHENCLR_CH1_Enabled      ( 1UL )                          /*!< Read: channel enabled */
#define PPI_CHENCLR_CH1_Clear        ( 1UL )                          /*!< Write: disable channel */

/* Bit 0 : Channel 0 enable clear register.  Writing '0' has no effect. */
#define PPI_CHENCLR_CH0_Pos          ( 0UL )                          /*!< Position of CH0 field. */
#define PPI_CHENCLR_CH0_Msk          ( 0x1UL << PPI_CHENCLR_CH0_Pos ) /*!< Bit mask of CH0 field. */
#define PPI_CHENCLR_CH0_Disabled     ( 0UL )                          /*!< Read: channel disabled */
#define PPI_CHENCLR_CH0_Enabled      ( 1UL )                          /*!< Read: channel enabled */
#define PPI_CHENCLR_CH0_Clear        ( 1UL )                          /*!< Write: disable channel */

/* Register: PPI_CH_EEP */
/* Description: Description cluster: Channel n event endpoint */

