FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bit 8 : Include or exclude channel 8 */
#define PPI_CHG_CH8_Pos          ( 8UL )                      /*!< Position of CH8 field. */
#define PPI_CHG_CH8_Msk          ( 0x1UL << PPI_CHG_CH8_Pos ) /*!< Bit mask of CH8 field. */
#define PPI_CHG_CH8_Excluded     ( 0UL )                      /*!< Exclude */
#define PPI_CHG_CH8_Included     ( 1UL )                      /*!< Include */

/* Bit 7 : Include or exclude channel 7 */
#define PPI_CHG_CH7_Pos          ( 7UL )                      /*!< Position of CH7 field. */
#define PPI_CHG_CH7_Msk          ( 0x1UL << PPI_CHG_CH7_Pos ) /*!< Bit mask of CH7 field. */
#define PPI_CHG_CH7_Excluded     ( 0UL )                      /*!< Exclude */
#define PPI_CHG_CH7_Included     ( 1UL )                      /*!< Include */

/* Bit 6 : Include or exclude channel 6 */
#define PPI_CHG_CH6_Pos          ( 6UL )                      /*!< Position of CH6 field. */
#define PPI_CHG_CH6_Msk          ( 0x1UL << PPI_CHG_CH6_Pos ) /*!< Bit mask of CH6 field. */
#define PPI_CHG_CH6_Excluded     ( 0UL )                      /*!< Exclude */
#define PPI_CHG_CH6_Included     ( 1UL )                      /*!< Include */

/* Bit 5 : Include or exclude channel 5 */
#define PPI_CHG_CH5_Pos          ( 5UL )                      /*!< Position of CH5 field. */
#define PPI_CHG_CH5_Msk          ( 0x1UL << PPI_CHG_CH5_Pos ) /*!< Bit mask of CH5 field. */
#define PPI_CHG_CH5_Excluded     ( 0UL )                      /*!< Exclude */
#define PPI_CHG_CH5_Included     ( 1UL )                      /*!< Include */

/* Bit 4 : Include or exclude channel 4 */
#define PPI_CHG_CH4_Pos          ( 4UL )                      /*!< Position of CH4 field. */
#define PPI_CHG_CH4_Msk          ( 0x1UL << PPI_CHG_CH4_Pos ) /*!< Bit mask of CH4 field. */
#define PPI_CHG_CH4_Excluded     ( 0UL )                      /*!< Exclude */
#define PPI_CHG_CH4_Included     ( 1UL )                      /*!< Include */

/* Bit 3 : Include or exclude channel 3 */
#define PPI_CHG_CH3_Pos          ( 3UL )                      /*!< Position of CH3 field. */
#define PPI_CHG_CH3_Msk          ( 0x1UL << PPI_CHG_CH3_Pos ) /*!< Bit mask of CH3 field. */
#define PPI_CHG_CH3_Excluded     ( 0UL )                      /*!< Exclude */
#define PPI_CHG_CH3_Included     ( 1UL )                      /*!< Include */

/* Bit 2 : Include or exclude channel 2 */
#define PPI_CHG_CH2_Pos          ( 2UL )                      /*!< Position of CH2 field. */
#define PPI_CHG_CH2_Msk          ( 0x1UL << PPI_CHG_CH2_Pos ) /*!< Bit mask of CH2 field. */
#define PPI_CHG_CH2_Excluded     ( 0UL )                      /*!< Exclude */
#define PPI_CHG_CH2_Included     ( 1UL )                      /*!< Include */

/* Bit 1 : Include or exclude channel 1 */
#define PPI_CHG_CH1_Pos          ( 1UL )                      /*!< Position of CH1 field. */
#define PPI_CHG_CH1_Msk          ( 0x1UL << PPI_CHG_CH1_Pos ) /*!< Bit mask of CH1 field. */
#define PPI_CHG_CH1_Excluded     ( 0UL )                      /*!< Exclude */
#define PPI_CHG_CH1_Included     ( 1UL )                      /*!< Include */

/* Bit 0 : Include or exclude channel 0 */
#define PPI_CHG_CH0_Pos          ( 0UL )                      /*!< Position of CH0 field. */
#define PPI_CHG_CH0_Msk          ( 0x1UL << PPI_CHG_CH0_Pos ) /*!< Bit mask of CH0 field. */
#define PPI_CHG_CH0_Excluded     ( 0UL )                      /*!< Exclude */
#define PPI_CHG_CH0_Included     ( 1UL )                      /*!< Include */

/* Register: PPI_FORK_TEP */
/* Description: Description cluster: Channel n task endpoint */

/* Bits 31..0 : Pointer to task register */
#define PPI_FORK_TEP_TEP_Pos    ( 0UL )                                  /*!< Position of TEP field. */
#define PPI_FORK_TEP_TEP_Msk    ( 0xFFFFFFFFUL << PPI_FORK_TEP_TEP_Pos ) /*!< Bit mask of TEP field. */


/* Peripheral: QDEC */
/* Description: Quadrature Decoder */

/* Register: QDEC_TASKS_START */
/* Description: Task starting the quadrature decoder */

/* Bit 0 : Task starting the quadrature decoder */
#define QDEC_TASKS_START_TASKS_START_Pos        ( 0UL )                                       /*!< Position of TASKS_START field. */
#define QDEC_TASKS_START_TASKS_START_Msk        ( 0x1UL << QDEC_TASKS_START_TASKS_START_Pos ) /*!< Bit mask of TASKS_START field. */
#define QDEC_TASKS_START_TASKS_START_Trigger    ( 1UL )                                       /*!< Trigger task */

/* Register: QDEC_TASKS_STOP */
/* Description: Task stopping the quadrature decoder */

/* Bit 0 : Task stopping the quadrature decoder */
#define QDEC_TASKS_STOP_TASKS_STOP_Pos        ( 0UL )                                     /*!< Position of TASKS_STOP field. */
#define QDEC_TASKS_STOP_TASKS_STOP_Msk        ( 0x1UL << QDEC_TASKS_STOP_TASKS_STOP_Pos ) /*!< Bit mask of TASKS_STOP field. */
#define QDEC_TASKS_STOP_TASKS_STOP_Trigger    ( 1UL )                                     /*!< Trigger task */

/* Register: QDEC_TASKS_READCLRACC */
/* Description: Read and clear ACC and ACCDBL */

/* Bit 0 : Read and clear ACC and ACCDBL */
#define QDEC_TASKS_READCLRACC_TASKS_READCLRACC_Pos        ( 0UL )                                                 /*!< Position of TASKS_READCLRACC field. */
#define QDEC_TASKS_READCLRACC_TASKS_READCLRACC_Msk        ( 0x1UL << QDEC_TASKS_READCLRACC_TASKS_READCLRACC_Pos ) /*!< Bit mask of TASKS_READCLRACC field. */
#define QDEC_TASKS_READCLRACC_TASKS_READCLRACC_Trigger    ( 1UL )                                                 /*!< Trigger task */

/* Register: QDEC_TASKS_RDCLRACC */
/* Description: Read and clear ACC */

/* Bit 0 : Read and clear ACC */
#define QDEC_TASKS_RDCLRACC_TASKS_RDCLRACC_Pos        ( 0UL )                                             /*!< Position of TASKS_RDCLRACC field. */
#define QDEC_TASKS_RDCLRACC_TASKS_RDCLRACC_Msk        ( 0x1UL << QDEC_TASKS_RDCLRACC_TASKS_RDCLRACC_Pos ) /*!< Bit mask of TASKS_RDCLRACC field. */
#define QDEC_TASKS_RDCLRACC_TASKS_RDCLRACC_Trigger    ( 1UL )                                             /*!< Trigger task */

/* Register: QDEC_TASKS_RDCLRDBL */
/* Description: Read and clear ACCDBL */

/* Bit 0 : Read and clear ACCDBL */
#define QDEC_TASKS_RDCLRDBL_TASKS_RDCLRDBL_Pos        ( 0UL )                                             /*!< Position of TASKS_RDCLRDBL field. */
#define QDEC_TASKS_RDCLRDBL_TASKS_RDCLRDBL_Msk        ( 0x1UL << QDEC_TASKS_RDCLRDBL_TASKS_RDCLRDBL_Pos ) /*!< Bit mask of TASKS_RDCLRDBL field. */
#define QDEC_TASKS_RDCLRDBL_TASKS_RDCLRDBL_Trigger    ( 1UL )                                             /*!< Trigger task */

