FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bit 2 : Write '1' to disable interrupt for event ACCOF */
#define QDEC_INTENCLR_ACCOF_Pos             ( 2UL )                              /*!< Position of ACCOF field. */
#define QDEC_INTENCLR_ACCOF_Msk             ( 0x1UL << QDEC_INTENCLR_ACCOF_Pos ) /*!< Bit mask of ACCOF field. */
#define QDEC_INTENCLR_ACCOF_Disabled        ( 0UL )                              /*!< Read: Disabled */
#define QDEC_INTENCLR_ACCOF_Enabled         ( 1UL )                              /*!< Read: Enabled */
#define QDEC_INTENCLR_ACCOF_Clear           ( 1UL )                              /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event REPORTRDY */
#define QDEC_INTENCLR_REPORTRDY_Pos         ( 1UL )                                  /*!< Position of REPORTRDY field. */
#define QDEC_INTENCLR_REPORTRDY_Msk         ( 0x1UL << QDEC_INTENCLR_REPORTRDY_Pos ) /*!< Bit mask of REPORTRDY field. */
#define QDEC_INTENCLR_REPORTRDY_Disabled    ( 0UL )                                  /*!< Read: Disabled */
#define QDEC_INTENCLR_REPORTRDY_Enabled     ( 1UL )                                  /*!< Read: Enabled */
#define QDEC_INTENCLR_REPORTRDY_Clear       ( 1UL )                                  /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event SAMPLERDY */
#define QDEC_INTENCLR_SAMPLERDY_Pos         ( 0UL )                                  /*!< Position of SAMPLERDY field. */
#define QDEC_INTENCLR_SAMPLERDY_Msk         ( 0x1UL << QDEC_INTENCLR_SAMPLERDY_Pos ) /*!< Bit mask of SAMPLERDY field. */
#define QDEC_INTENCLR_SAMPLERDY_Disabled    ( 0UL )                                  /*!< Read: Disabled */
#define QDEC_INTENCLR_SAMPLERDY_Enabled     ( 1UL )                                  /*!< Read: Enabled */
#define QDEC_INTENCLR_SAMPLERDY_Clear       ( 1UL )                                  /*!< Disable */

/* Register: QDEC_ENABLE */
/* Description: Enable the quadrature decoder */

/* Bit 0 : Enable or disable the quadrature decoder */
#define QDEC_ENABLE_ENABLE_Pos         ( 0UL )                             /*!< Position of ENABLE field. */
#define QDEC_ENABLE_ENABLE_Msk         ( 0x1UL << QDEC_ENABLE_ENABLE_Pos ) /*!< Bit mask of ENABLE field. */
#define QDEC_ENABLE_ENABLE_Disabled    ( 0UL )                             /*!< Disable */
#define QDEC_ENABLE_ENABLE_Enabled     ( 1UL )                             /*!< Enable */

/* Register: QDEC_LEDPOL */
/* Description: LED output pin polarity */

/* Bit 0 : LED output pin polarity */
#define QDEC_LEDPOL_LEDPOL_Pos           ( 0UL )                             /*!< Position of LEDPOL field. */
#define QDEC_LEDPOL_LEDPOL_Msk           ( 0x1UL << QDEC_LEDPOL_LEDPOL_Pos ) /*!< Bit mask of LEDPOL field. */
#define QDEC_LEDPOL_LEDPOL_ActiveLow     ( 0UL )                             /*!< Led active on output pin low */
#define QDEC_LEDPOL_LEDPOL_ActiveHigh    ( 1UL )                             /*!< Led active on output pin high */

/* Register: QDEC_SAMPLEPER */
/* Description: Sample period */

/* Bits 3..0 : Sample period. The SAMPLE register will be updated for every new sample */
#define QDEC_SAMPLEPER_SAMPLEPER_Pos        ( 0UL )                                   /*!< Position of SAMPLEPER field. */
#define QDEC_SAMPLEPER_SAMPLEPER_Msk        ( 0xFUL << QDEC_SAMPLEPER_SAMPLEPER_Pos ) /*!< Bit mask of SAMPLEPER field. */
#define QDEC_SAMPLEPER_SAMPLEPER_128us      ( 0UL )                                   /*!< 128 us */
#define QDEC_SAMPLEPER_SAMPLEPER_256us      ( 1UL )                                   /*!< 256 us */
#define QDEC_SAMPLEPER_SAMPLEPER_512us      ( 2UL )                                   /*!< 512 us */
#define QDEC_SAMPLEPER_SAMPLEPER_1024us     ( 3UL )                                   /*!< 1024 us */
#define QDEC_SAMPLEPER_SAMPLEPER_2048us     ( 4UL )                                   /*!< 2048 us */
#define QDEC_SAMPLEPER_SAMPLEPER_4096us     ( 5UL )                                   /*!< 4096 us */
#define QDEC_SAMPLEPER_SAMPLEPER_8192us     ( 6UL )                                   /*!< 8192 us */
#define QDEC_SAMPLEPER_SAMPLEPER_16384us    ( 7UL )                                   /*!< 16384 us */
#define QDEC_SAMPLEPER_SAMPLEPER_32ms       ( 8UL )                                   /*!< 32768 us */
#define QDEC_SAMPLEPER_SAMPLEPER_65ms       ( 9UL )                                   /*!< 65536 us */
#define QDEC_SAMPLEPER_SAMPLEPER_131ms      ( 10UL )                                  /*!< 131072 us */

/* Register: QDEC_SAMPLE */
/* Description: Motion sample value */

/* Bits 31..0 : Last motion sample */
#define QDEC_SAMPLE_SAMPLE_Pos    ( 0UL )                                    /*!< Position of SAMPLE field. */
#define QDEC_SAMPLE_SAMPLE_Msk    ( 0xFFFFFFFFUL << QDEC_SAMPLE_SAMPLE_Pos ) /*!< Bit mask of SAMPLE field. */

/* Register: QDEC_REPORTPER */
/* Description: Number of samples to be taken before REPORTRDY and DBLRDY events can be generated */

/* Bits 3..0 : Specifies the number of samples to be accumulated in the ACC register before the REPORTRDY and DBLRDY events can be generated. */
#define QDEC_REPORTPER_REPORTPER_Pos        ( 0UL )                                   /*!< Position of REPORTPER field. */
#define QDEC_REPORTPER_REPORTPER_Msk        ( 0xFUL << QDEC_REPORTPER_REPORTPER_Pos ) /*!< Bit mask of REPORTPER field. */
#define QDEC_REPORTPER_REPORTPER_10Smpl     ( 0UL )                                   /*!< 10 samples/report */
#define QDEC_REPORTPER_REPORTPER_40Smpl     ( 1UL )                                   /*!< 40 samples/report */
#define QDEC_REPORTPER_REPORTPER_80Smpl     ( 2UL )                                   /*!< 80 samples/report */
#define QDEC_REPORTPER_REPORTPER_120Smpl    ( 3UL )                                   /*!< 120 samples/report */
#define QDEC_REPORTPER_REPORTPER_160Smpl    ( 4UL )                                   /*!< 160 samples/report */
#define QDEC_REPORTPER_REPORTPER_200Smpl    ( 5UL )                                   /*!< 200 samples/report */
#define QDEC_REPORTPER_REPORTPER_240Smpl    ( 6UL )                                   /*!< 240 samples/report */
#define QDEC_REPORTPER_REPORTPER_280Smpl    ( 7UL )                                   /*!< 280 samples/report */
#define QDEC_REPORTPER_REPORTPER_1Smpl      ( 8UL )                                   /*!< 1 sample/report */

/* Register: QDEC_ACC */
/* Description: Register accumulating the valid transitions */

/* Bits 31..0 : Register accumulating all valid samples (not double transition) read from the SAMPLE register. */
#define QDEC_ACC_ACC_Pos    ( 0UL )                              /*!< Position of ACC field. */
#define QDEC_ACC_ACC_Msk    ( 0xFFFFFFFFUL << QDEC_ACC_ACC_Pos ) /*!< Bit mask of ACC field. */

