FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bit 0 : Generated when last bit is sent on air, or received from air */
#define RADIO_EVENTS_PHYEND_EVENTS_PHYEND_Pos             ( 0UL )                                            /*!< Position of EVENTS_PHYEND field. */
#define RADIO_EVENTS_PHYEND_EVENTS_PHYEND_Msk             ( 0x1UL << RADIO_EVENTS_PHYEND_EVENTS_PHYEND_Pos ) /*!< Bit mask of EVENTS_PHYEND field. */
#define RADIO_EVENTS_PHYEND_EVENTS_PHYEND_NotGenerated    ( 0UL )                                            /*!< Event not generated */
#define RADIO_EVENTS_PHYEND_EVENTS_PHYEND_Generated       ( 1UL )                                            /*!< Event generated */

/* Register: RADIO_EVENTS_CTEPRESENT */
/* Description: CTE is present (early warning right after receiving CTEInfo byte) */

/* Bit 0 : CTE is present (early warning right after receiving CTEInfo byte) */
#define RADIO_EVENTS_CTEPRESENT_EVENTS_CTEPRESENT_Pos             ( 0UL )                                                    /*!< Position of EVENTS_CTEPRESENT field. */
#define RADIO_EVENTS_CTEPRESENT_EVENTS_CTEPRESENT_Msk             ( 0x1UL << RADIO_EVENTS_CTEPRESENT_EVENTS_CTEPRESENT_Pos ) /*!< Bit mask of EVENTS_CTEPRESENT field. */
#define RADIO_EVENTS_CTEPRESENT_EVENTS_CTEPRESENT_NotGenerated    ( 0UL )                                                    /*!< Event not generated */
#define RADIO_EVENTS_CTEPRESENT_EVENTS_CTEPRESENT_Generated       ( 1UL )                                                    /*!< Event generated */

/* Register: RADIO_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 21 : Shortcut between event PHYEND and task START */
#define RADIO_SHORTS_PHYEND_START_Pos               ( 21UL )                                   /*!< Position of PHYEND_START field. */
#define RADIO_SHORTS_PHYEND_START_Msk               ( 0x1UL << RADIO_SHORTS_PHYEND_START_Pos ) /*!< Bit mask of PHYEND_START field. */
#define RADIO_SHORTS_PHYEND_START_Disabled          ( 0UL )                                    /*!< Disable shortcut */
#define RADIO_SHORTS_PHYEND_START_Enabled           ( 1UL )                                    /*!< Enable shortcut */

/* Bit 20 : Shortcut between event PHYEND and task DISABLE */
#define RADIO_SHORTS_PHYEND_DISABLE_Pos             ( 20UL )                                     /*!< Position of PHYEND_DISABLE field. */
#define RADIO_SHORTS_PHYEND_DISABLE_Msk             ( 0x1UL << RADIO_SHORTS_PHYEND_DISABLE_Pos ) /*!< Bit mask of PHYEND_DISABLE field. */
#define RADIO_SHORTS_PHYEND_DISABLE_Disabled        ( 0UL )                                      /*!< Disable shortcut */
#define RADIO_SHORTS_PHYEND_DISABLE_Enabled         ( 1UL )                                      /*!< Enable shortcut */

/* Bit 19 : Shortcut between event RXREADY and task START */
#define RADIO_SHORTS_RXREADY_START_Pos              ( 19UL )                                    /*!< Position of RXREADY_START field. */
#define RADIO_SHORTS_RXREADY_START_Msk              ( 0x1UL << RADIO_SHORTS_RXREADY_START_Pos ) /*!< Bit mask of RXREADY_START field. */
#define RADIO_SHORTS_RXREADY_START_Disabled         ( 0UL )                                     /*!< Disable shortcut */
#define RADIO_SHORTS_RXREADY_START_Enabled          ( 1UL )                                     /*!< Enable shortcut */

/* Bit 18 : Shortcut between event TXREADY and task START */
#define RADIO_SHORTS_TXREADY_START_Pos              ( 18UL )                                    /*!< Position of TXREADY_START field. */
#define RADIO_SHORTS_TXREADY_START_Msk              ( 0x1UL << RADIO_SHORTS_TXREADY_START_Pos ) /*!< Bit mask of TXREADY_START field. */
#define RADIO_SHORTS_TXREADY_START_Disabled         ( 0UL )                                     /*!< Disable shortcut */
#define RADIO_SHORTS_TXREADY_START_Enabled          ( 1UL )                                     /*!< Enable shortcut */

/* Bit 17 : Shortcut between event CCAIDLE and task STOP */
#define RADIO_SHORTS_CCAIDLE_STOP_Pos               ( 17UL )                                   /*!< Position of CCAIDLE_STOP field. */
#define RADIO_SHORTS_CCAIDLE_STOP_Msk               ( 0x1UL << RADIO_SHORTS_CCAIDLE_STOP_Pos ) /*!< Bit mask of CCAIDLE_STOP field. */
#define RADIO_SHORTS_CCAIDLE_STOP_Disabled          ( 0UL )                                    /*!< Disable shortcut */
#define RADIO_SHORTS_CCAIDLE_STOP_Enabled           ( 1UL )                                    /*!< Enable shortcut */

/* Bit 16 : Shortcut between event EDEND and task DISABLE */
#define RADIO_SHORTS_EDEND_DISABLE_Pos              ( 16UL )                                    /*!< Position of EDEND_DISABLE field. */
#define RADIO_SHORTS_EDEND_DISABLE_Msk              ( 0x1UL << RADIO_SHORTS_EDEND_DISABLE_Pos ) /*!< Bit mask of EDEND_DISABLE field. */
#define RADIO_SHORTS_EDEND_DISABLE_Disabled         ( 0UL )                                     /*!< Disable shortcut */
#define RADIO_SHORTS_EDEND_DISABLE_Enabled          ( 1UL )                                     /*!< Enable shortcut */

/* Bit 15 : Shortcut between event READY and task EDSTART */
#define RADIO_SHORTS_READY_EDSTART_Pos              ( 15UL )                                    /*!< Position of READY_EDSTART field. */
#define RADIO_SHORTS_READY_EDSTART_Msk              ( 0x1UL << RADIO_SHORTS_READY_EDSTART_Pos ) /*!< Bit mask of READY_EDSTART field. */
#define RADIO_SHORTS_READY_EDSTART_Disabled         ( 0UL )                                     /*!< Disable shortcut */
#define RADIO_SHORTS_READY_EDSTART_Enabled          ( 1UL )                                     /*!< Enable shortcut */

/* Bit 14 : Shortcut between event FRAMESTART and task BCSTART */
#define RADIO_SHORTS_FRAMESTART_BCSTART_Pos         ( 14UL )                                         /*!< Position of FRAMESTART_BCSTART field. */
#define RADIO_SHORTS_FRAMESTART_BCSTART_Msk         ( 0x1UL << RADIO_SHORTS_FRAMESTART_BCSTART_Pos ) /*!< Bit mask of FRAMESTART_BCSTART field. */
#define RADIO_SHORTS_FRAMESTART_BCSTART_Disabled    ( 0UL )                                          /*!< Disable shortcut */
#define RADIO_SHORTS_FRAMESTART_BCSTART_Enabled     ( 1UL )                                          /*!< Enable shortcut */

/* Bit 13 : Shortcut between event CCABUSY and task DISABLE */
#define RADIO_SHORTS_CCABUSY_DISABLE_Pos            ( 13UL )                                      /*!< Position of CCABUSY_DISABLE field. */
#define RADIO_SHORTS_CCABUSY_DISABLE_Msk            ( 0x1UL << RADIO_SHORTS_CCABUSY_DISABLE_Pos ) /*!< Bit mask of CCABUSY_DISABLE field. */
#define RADIO_SHORTS_CCABUSY_DISABLE_Disabled       ( 0UL )                                       /*!< Disable shortcut */
#define RADIO_SHORTS_CCABUSY_DISABLE_Enabled        ( 1UL )                                       /*!< Enable shortcut */

/* Bit 12 : Shortcut between event CCAIDLE and task TXEN */
#define RADIO_SHORTS_CCAIDLE_TXEN_Pos               ( 12UL )                                   /*!< Position of CCAIDLE_TXEN field. */
#define RADIO_SHORTS_CCAIDLE_TXEN_Msk               ( 0x1UL << RADIO_SHORTS_CCAIDLE_TXEN_Pos ) /*!< Bit mask of CCAIDLE_TXEN field. */
#define RADIO_SHORTS_CCAIDLE_TXEN_Disabled          ( 0UL )                                    /*!< Disable shortcut */
#define RADIO_SHORTS_CCAIDLE_TXEN_Enabled           ( 1UL )                                    /*!< Enable shortcut */

