FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bit 11 : Shortcut between event RXREADY and task CCASTART */
#define RADIO_SHORTS_RXREADY_CCASTART_Pos           ( 11UL )                                       /*!< Position of RXREADY_CCASTART field. */
#define RADIO_SHORTS_RXREADY_CCASTART_Msk           ( 0x1UL << RADIO_SHORTS_RXREADY_CCASTART_Pos ) /*!< Bit mask of RXREADY_CCASTART field. */
#define RADIO_SHORTS_RXREADY_CCASTART_Disabled      ( 0UL )                                        /*!< Disable shortcut */
#define RADIO_SHORTS_RXREADY_CCASTART_Enabled       ( 1UL )                                        /*!< Enable shortcut */

/* Bit 8 : Shortcut between event DISABLED and task RSSISTOP */
#define RADIO_SHORTS_DISABLED_RSSISTOP_Pos          ( 8UL )                                         /*!< Position of DISABLED_RSSISTOP field. */
#define RADIO_SHORTS_DISABLED_RSSISTOP_Msk          ( 0x1UL << RADIO_SHORTS_DISABLED_RSSISTOP_Pos ) /*!< Bit mask of DISABLED_RSSISTOP field. */
#define RADIO_SHORTS_DISABLED_RSSISTOP_Disabled     ( 0UL )                                         /*!< Disable shortcut */
#define RADIO_SHORTS_DISABLED_RSSISTOP_Enabled      ( 1UL )                                         /*!< Enable shortcut */

/* Bit 6 : Shortcut between event ADDRESS and task BCSTART */
#define RADIO_SHORTS_ADDRESS_BCSTART_Pos            ( 6UL )                                       /*!< Position of ADDRESS_BCSTART field. */
#define RADIO_SHORTS_ADDRESS_BCSTART_Msk            ( 0x1UL << RADIO_SHORTS_ADDRESS_BCSTART_Pos ) /*!< Bit mask of ADDRESS_BCSTART field. */
#define RADIO_SHORTS_ADDRESS_BCSTART_Disabled       ( 0UL )                                       /*!< Disable shortcut */
#define RADIO_SHORTS_ADDRESS_BCSTART_Enabled        ( 1UL )                                       /*!< Enable shortcut */

/* Bit 5 : Shortcut between event END and task START */
#define RADIO_SHORTS_END_START_Pos                  ( 5UL )                                 /*!< Position of END_START field. */
#define RADIO_SHORTS_END_START_Msk                  ( 0x1UL << RADIO_SHORTS_END_START_Pos ) /*!< Bit mask of END_START field. */
#define RADIO_SHORTS_END_START_Disabled             ( 0UL )                                 /*!< Disable shortcut */
#define RADIO_SHORTS_END_START_Enabled              ( 1UL )                                 /*!< Enable shortcut */

/* Bit 4 : Shortcut between event ADDRESS and task RSSISTART */
#define RADIO_SHORTS_ADDRESS_RSSISTART_Pos          ( 4UL )                                         /*!< Position of ADDRESS_RSSISTART field. */
#define RADIO_SHORTS_ADDRESS_RSSISTART_Msk          ( 0x1UL << RADIO_SHORTS_ADDRESS_RSSISTART_Pos ) /*!< Bit mask of ADDRESS_RSSISTART field. */
#define RADIO_SHORTS_ADDRESS_RSSISTART_Disabled     ( 0UL )                                         /*!< Disable shortcut */
#define RADIO_SHORTS_ADDRESS_RSSISTART_Enabled      ( 1UL )                                         /*!< Enable shortcut */

/* Bit 3 : Shortcut between event DISABLED and task RXEN */
#define RADIO_SHORTS_DISABLED_RXEN_Pos              ( 3UL )                                     /*!< Position of DISABLED_RXEN field. */
#define RADIO_SHORTS_DISABLED_RXEN_Msk              ( 0x1UL << RADIO_SHORTS_DISABLED_RXEN_Pos ) /*!< Bit mask of DISABLED_RXEN field. */
#define RADIO_SHORTS_DISABLED_RXEN_Disabled         ( 0UL )                                     /*!< Disable shortcut */
#define RADIO_SHORTS_DISABLED_RXEN_Enabled          ( 1UL )                                     /*!< Enable shortcut */

/* Bit 2 : Shortcut between event DISABLED and task TXEN */
#define RADIO_SHORTS_DISABLED_TXEN_Pos              ( 2UL )                                     /*!< Position of DISABLED_TXEN field. */
#define RADIO_SHORTS_DISABLED_TXEN_Msk              ( 0x1UL << RADIO_SHORTS_DISABLED_TXEN_Pos ) /*!< Bit mask of DISABLED_TXEN field. */
#define RADIO_SHORTS_DISABLED_TXEN_Disabled         ( 0UL )                                     /*!< Disable shortcut */
#define RADIO_SHORTS_DISABLED_TXEN_Enabled          ( 1UL )                                     /*!< Enable shortcut */

/* Bit 1 : Shortcut between event END and task DISABLE */
#define RADIO_SHORTS_END_DISABLE_Pos                ( 1UL )                                   /*!< Position of END_DISABLE field. */
#define RADIO_SHORTS_END_DISABLE_Msk                ( 0x1UL << RADIO_SHORTS_END_DISABLE_Pos ) /*!< Bit mask of END_DISABLE field. */
#define RADIO_SHORTS_END_DISABLE_Disabled           ( 0UL )                                   /*!< Disable shortcut */
#define RADIO_SHORTS_END_DISABLE_Enabled            ( 1UL )                                   /*!< Enable shortcut */

/* Bit 0 : Shortcut between event READY and task START */
#define RADIO_SHORTS_READY_START_Pos                ( 0UL )                                   /*!< Position of READY_START field. */
#define RADIO_SHORTS_READY_START_Msk                ( 0x1UL << RADIO_SHORTS_READY_START_Pos ) /*!< Bit mask of READY_START field. */
#define RADIO_SHORTS_READY_START_Disabled           ( 0UL )                                   /*!< Disable shortcut */
#define RADIO_SHORTS_READY_START_Enabled            ( 1UL )                                   /*!< Enable shortcut */

/* Register: RADIO_INTENSET */
/* Description: Enable interrupt */

/* Bit 28 : Write '1' to enable interrupt for event CTEPRESENT */
#define RADIO_INTENSET_CTEPRESENT_Pos         ( 28UL )                                   /*!< Position of CTEPRESENT field. */
#define RADIO_INTENSET_CTEPRESENT_Msk         ( 0x1UL << RADIO_INTENSET_CTEPRESENT_Pos ) /*!< Bit mask of CTEPRESENT field. */
#define RADIO_INTENSET_CTEPRESENT_Disabled    ( 0UL )                                    /*!< Read: Disabled */
#define RADIO_INTENSET_CTEPRESENT_Enabled     ( 1UL )                                    /*!< Read: Enabled */
#define RADIO_INTENSET_CTEPRESENT_Set         ( 1UL )                                    /*!< Enable */

/* Bit 27 : Write '1' to enable interrupt for event PHYEND */
#define RADIO_INTENSET_PHYEND_Pos             ( 27UL )                               /*!< Position of PHYEND field. */
#define RADIO_INTENSET_PHYEND_Msk             ( 0x1UL << RADIO_INTENSET_PHYEND_Pos ) /*!< Bit mask of PHYEND field. */
#define RADIO_INTENSET_PHYEND_Disabled        ( 0UL )                                /*!< Read: Disabled */
#define RADIO_INTENSET_PHYEND_Enabled         ( 1UL )                                /*!< Read: Enabled */
#define RADIO_INTENSET_PHYEND_Set             ( 1UL )                                /*!< Enable */

/* Bit 26 : Write '1' to enable interrupt for event SYNC */
#define RADIO_INTENSET_SYNC_Pos               ( 26UL )                             /*!< Position of SYNC field. */
#define RADIO_INTENSET_SYNC_Msk               ( 0x1UL << RADIO_INTENSET_SYNC_Pos ) /*!< Bit mask of SYNC field. */
#define RADIO_INTENSET_SYNC_Disabled          ( 0UL )                              /*!< Read: Disabled */
#define RADIO_INTENSET_SYNC_Enabled           ( 1UL )                              /*!< Read: Enabled */
#define RADIO_INTENSET_SYNC_Set               ( 1UL )                              /*!< Enable */

/* Bit 23 : Write '1' to enable interrupt for event MHRMATCH */
#define RADIO_INTENSET_MHRMATCH_Pos           ( 23UL )                                 /*!< Position of MHRMATCH field. */
#define RADIO_INTENSET_MHRMATCH_Msk           ( 0x1UL << RADIO_INTENSET_MHRMATCH_Pos ) /*!< Bit mask of MHRMATCH field. */
#define RADIO_INTENSET_MHRMATCH_Disabled      ( 0UL )                                  /*!< Read: Disabled */
#define RADIO_INTENSET_MHRMATCH_Enabled       ( 1UL )                                  /*!< Read: Enabled */
#define RADIO_INTENSET_MHRMATCH_Set           ( 1UL )                                  /*!< Enable */

