FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bit 22 : Write '1' to enable interrupt for event RXREADY */
#define RADIO_INTENSET_RXREADY_Pos            ( 22UL )                                /*!< Position of RXREADY field. */
#define RADIO_INTENSET_RXREADY_Msk            ( 0x1UL << RADIO_INTENSET_RXREADY_Pos ) /*!< Bit mask of RXREADY field. */
#define RADIO_INTENSET_RXREADY_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define RADIO_INTENSET_RXREADY_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define RADIO_INTENSET_RXREADY_Set            ( 1UL )                                 /*!< Enable */

/* Bit 21 : Write '1' to enable interrupt for event TXREADY */
#define RADIO_INTENSET_TXREADY_Pos            ( 21UL )                                /*!< Position of TXREADY field. */
#define RADIO_INTENSET_TXREADY_Msk            ( 0x1UL << RADIO_INTENSET_TXREADY_Pos ) /*!< Bit mask of TXREADY field. */
#define RADIO_INTENSET_TXREADY_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define RADIO_INTENSET_TXREADY_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define RADIO_INTENSET_TXREADY_Set            ( 1UL )                                 /*!< Enable */

/* Bit 20 : Write '1' to enable interrupt for event RATEBOOST */
#define RADIO_INTENSET_RATEBOOST_Pos          ( 20UL )                                  /*!< Position of RATEBOOST field. */
#define RADIO_INTENSET_RATEBOOST_Msk          ( 0x1UL << RADIO_INTENSET_RATEBOOST_Pos ) /*!< Bit mask of RATEBOOST field. */
#define RADIO_INTENSET_RATEBOOST_Disabled     ( 0UL )                                   /*!< Read: Disabled */
#define RADIO_INTENSET_RATEBOOST_Enabled      ( 1UL )                                   /*!< Read: Enabled */
#define RADIO_INTENSET_RATEBOOST_Set          ( 1UL )                                   /*!< Enable */

/* Bit 19 : Write '1' to enable interrupt for event CCASTOPPED */
#define RADIO_INTENSET_CCASTOPPED_Pos         ( 19UL )                                   /*!< Position of CCASTOPPED field. */
#define RADIO_INTENSET_CCASTOPPED_Msk         ( 0x1UL << RADIO_INTENSET_CCASTOPPED_Pos ) /*!< Bit mask of CCASTOPPED field. */
#define RADIO_INTENSET_CCASTOPPED_Disabled    ( 0UL )                                    /*!< Read: Disabled */
#define RADIO_INTENSET_CCASTOPPED_Enabled     ( 1UL )                                    /*!< Read: Enabled */
#define RADIO_INTENSET_CCASTOPPED_Set         ( 1UL )                                    /*!< Enable */

/* Bit 18 : Write '1' to enable interrupt for event CCABUSY */
#define RADIO_INTENSET_CCABUSY_Pos            ( 18UL )                                /*!< Position of CCABUSY field. */
#define RADIO_INTENSET_CCABUSY_Msk            ( 0x1UL << RADIO_INTENSET_CCABUSY_Pos ) /*!< Bit mask of CCABUSY field. */
#define RADIO_INTENSET_CCABUSY_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define RADIO_INTENSET_CCABUSY_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define RADIO_INTENSET_CCABUSY_Set            ( 1UL )                                 /*!< Enable */

/* Bit 17 : Write '1' to enable interrupt for event CCAIDLE */
#define RADIO_INTENSET_CCAIDLE_Pos            ( 17UL )                                /*!< Position of CCAIDLE field. */
#define RADIO_INTENSET_CCAIDLE_Msk            ( 0x1UL << RADIO_INTENSET_CCAIDLE_Pos ) /*!< Bit mask of CCAIDLE field. */
#define RADIO_INTENSET_CCAIDLE_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define RADIO_INTENSET_CCAIDLE_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define RADIO_INTENSET_CCAIDLE_Set            ( 1UL )                                 /*!< Enable */

/* Bit 16 : Write '1' to enable interrupt for event EDSTOPPED */
#define RADIO_INTENSET_EDSTOPPED_Pos          ( 16UL )                                  /*!< Position of EDSTOPPED field. */
#define RADIO_INTENSET_EDSTOPPED_Msk          ( 0x1UL << RADIO_INTENSET_EDSTOPPED_Pos ) /*!< Bit mask of EDSTOPPED field. */
#define RADIO_INTENSET_EDSTOPPED_Disabled     ( 0UL )                                   /*!< Read: Disabled */
#define RADIO_INTENSET_EDSTOPPED_Enabled      ( 1UL )                                   /*!< Read: Enabled */
#define RADIO_INTENSET_EDSTOPPED_Set          ( 1UL )                                   /*!< Enable */

/* Bit 15 : Write '1' to enable interrupt for event EDEND */
#define RADIO_INTENSET_EDEND_Pos              ( 15UL )                              /*!< Position of EDEND field. */
#define RADIO_INTENSET_EDEND_Msk              ( 0x1UL << RADIO_INTENSET_EDEND_Pos ) /*!< Bit mask of EDEND field. */
#define RADIO_INTENSET_EDEND_Disabled         ( 0UL )                               /*!< Read: Disabled */
#define RADIO_INTENSET_EDEND_Enabled          ( 1UL )                               /*!< Read: Enabled */
#define RADIO_INTENSET_EDEND_Set              ( 1UL )                               /*!< Enable */

/* Bit 14 : Write '1' to enable interrupt for event FRAMESTART */
#define RADIO_INTENSET_FRAMESTART_Pos         ( 14UL )                                   /*!< Position of FRAMESTART field. */
#define RADIO_INTENSET_FRAMESTART_Msk         ( 0x1UL << RADIO_INTENSET_FRAMESTART_Pos ) /*!< Bit mask of FRAMESTART field. */
#define RADIO_INTENSET_FRAMESTART_Disabled    ( 0UL )                                    /*!< Read: Disabled */
#define RADIO_INTENSET_FRAMESTART_Enabled     ( 1UL )                                    /*!< Read: Enabled */
#define RADIO_INTENSET_FRAMESTART_Set         ( 1UL )                                    /*!< Enable */

/* Bit 13 : Write '1' to enable interrupt for event CRCERROR */
#define RADIO_INTENSET_CRCERROR_Pos           ( 13UL )                                 /*!< Position of CRCERROR field. */
#define RADIO_INTENSET_CRCERROR_Msk           ( 0x1UL << RADIO_INTENSET_CRCERROR_Pos ) /*!< Bit mask of CRCERROR field. */
#define RADIO_INTENSET_CRCERROR_Disabled      ( 0UL )                                  /*!< Read: Disabled */
#define RADIO_INTENSET_CRCERROR_Enabled       ( 1UL )                                  /*!< Read: Enabled */
#define RADIO_INTENSET_CRCERROR_Set           ( 1UL )                                  /*!< Enable */

