FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bit 12 : Write '1' to enable interrupt for event CRCOK */
#define RADIO_INTENSET_CRCOK_Pos              ( 12UL )                              /*!< Position of CRCOK field. */
#define RADIO_INTENSET_CRCOK_Msk              ( 0x1UL << RADIO_INTENSET_CRCOK_Pos ) /*!< Bit mask of CRCOK field. */
#define RADIO_INTENSET_CRCOK_Disabled         ( 0UL )                               /*!< Read: Disabled */
#define RADIO_INTENSET_CRCOK_Enabled          ( 1UL )                               /*!< Read: Enabled */
#define RADIO_INTENSET_CRCOK_Set              ( 1UL )                               /*!< Enable */

/* Bit 10 : Write '1' to enable interrupt for event BCMATCH */
#define RADIO_INTENSET_BCMATCH_Pos            ( 10UL )                                /*!< Position of BCMATCH field. */
#define RADIO_INTENSET_BCMATCH_Msk            ( 0x1UL << RADIO_INTENSET_BCMATCH_Pos ) /*!< Bit mask of BCMATCH field. */
#define RADIO_INTENSET_BCMATCH_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define RADIO_INTENSET_BCMATCH_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define RADIO_INTENSET_BCMATCH_Set            ( 1UL )                                 /*!< Enable */

/* Bit 7 : Write '1' to enable interrupt for event RSSIEND */
#define RADIO_INTENSET_RSSIEND_Pos            ( 7UL )                                 /*!< Position of RSSIEND field. */
#define RADIO_INTENSET_RSSIEND_Msk            ( 0x1UL << RADIO_INTENSET_RSSIEND_Pos ) /*!< Bit mask of RSSIEND field. */
#define RADIO_INTENSET_RSSIEND_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define RADIO_INTENSET_RSSIEND_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define RADIO_INTENSET_RSSIEND_Set            ( 1UL )                                 /*!< Enable */

/* Bit 6 : Write '1' to enable interrupt for event DEVMISS */
#define RADIO_INTENSET_DEVMISS_Pos            ( 6UL )                                 /*!< Position of DEVMISS field. */
#define RADIO_INTENSET_DEVMISS_Msk            ( 0x1UL << RADIO_INTENSET_DEVMISS_Pos ) /*!< Bit mask of DEVMISS field. */
#define RADIO_INTENSET_DEVMISS_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define RADIO_INTENSET_DEVMISS_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define RADIO_INTENSET_DEVMISS_Set            ( 1UL )                                 /*!< Enable */

/* Bit 5 : Write '1' to enable interrupt for event DEVMATCH */
#define RADIO_INTENSET_DEVMATCH_Pos           ( 5UL )                                  /*!< Position of DEVMATCH field. */
#define RADIO_INTENSET_DEVMATCH_Msk           ( 0x1UL << RADIO_INTENSET_DEVMATCH_Pos ) /*!< Bit mask of DEVMATCH field. */
#define RADIO_INTENSET_DEVMATCH_Disabled      ( 0UL )                                  /*!< Read: Disabled */
#define RADIO_INTENSET_DEVMATCH_Enabled       ( 1UL )                                  /*!< Read: Enabled */
#define RADIO_INTENSET_DEVMATCH_Set           ( 1UL )                                  /*!< Enable */

/* Bit 4 : Write '1' to enable interrupt for event DISABLED */
#define RADIO_INTENSET_DISABLED_Pos           ( 4UL )                                  /*!< Position of DISABLED field. */
#define RADIO_INTENSET_DISABLED_Msk           ( 0x1UL << RADIO_INTENSET_DISABLED_Pos ) /*!< Bit mask of DISABLED field. */
#define RADIO_INTENSET_DISABLED_Disabled      ( 0UL )                                  /*!< Read: Disabled */
#define RADIO_INTENSET_DISABLED_Enabled       ( 1UL )                                  /*!< Read: Enabled */
#define RADIO_INTENSET_DISABLED_Set           ( 1UL )                                  /*!< Enable */

/* Bit 3 : Write '1' to enable interrupt for event END */
#define RADIO_INTENSET_END_Pos                ( 3UL )                             /*!< Position of END field. */
#define RADIO_INTENSET_END_Msk                ( 0x1UL << RADIO_INTENSET_END_Pos ) /*!< Bit mask of END field. */
#define RADIO_INTENSET_END_Disabled           ( 0UL )                             /*!< Read: Disabled */
#define RADIO_INTENSET_END_Enabled            ( 1UL )                             /*!< Read: Enabled */
#define RADIO_INTENSET_END_Set                ( 1UL )                             /*!< Enable */

/* Bit 2 : Write '1' to enable interrupt for event PAYLOAD */
#define RADIO_INTENSET_PAYLOAD_Pos            ( 2UL )                                 /*!< Position of PAYLOAD field. */
#define RADIO_INTENSET_PAYLOAD_Msk            ( 0x1UL << RADIO_INTENSET_PAYLOAD_Pos ) /*!< Bit mask of PAYLOAD field. */
#define RADIO_INTENSET_PAYLOAD_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define RADIO_INTENSET_PAYLOAD_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define RADIO_INTENSET_PAYLOAD_Set            ( 1UL )                                 /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event ADDRESS */
#define RADIO_INTENSET_ADDRESS_Pos            ( 1UL )                                 /*!< Position of ADDRESS field. */
#define RADIO_INTENSET_ADDRESS_Msk            ( 0x1UL << RADIO_INTENSET_ADDRESS_Pos ) /*!< Bit mask of ADDRESS field. */
#define RADIO_INTENSET_ADDRESS_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define RADIO_INTENSET_ADDRESS_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define RADIO_INTENSET_ADDRESS_Set            ( 1UL )                                 /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event READY */
#define RADIO_INTENSET_READY_Pos              ( 0UL )                               /*!< Position of READY field. */
#define RADIO_INTENSET_READY_Msk              ( 0x1UL << RADIO_INTENSET_READY_Pos ) /*!< Bit mask of READY field. */
#define RADIO_INTENSET_READY_Disabled         ( 0UL )                               /*!< Read: Disabled */
#define RADIO_INTENSET_READY_Enabled          ( 1UL )                               /*!< Read: Enabled */
#define RADIO_INTENSET_READY_Set              ( 1UL )                               /*!< Enable */

