FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bit 13 : Write '1' to disable interrupt for event CRCERROR */
#define RADIO_INTENCLR_CRCERROR_Pos           ( 13UL )                                 /*!< Position of CRCERROR field. */
#define RADIO_INTENCLR_CRCERROR_Msk           ( 0x1UL << RADIO_INTENCLR_CRCERROR_Pos ) /*!< Bit mask of CRCERROR field. */
#define RADIO_INTENCLR_CRCERROR_Disabled      ( 0UL )                                  /*!< Read: Disabled */
#define RADIO_INTENCLR_CRCERROR_Enabled       ( 1UL )                                  /*!< Read: Enabled */
#define RADIO_INTENCLR_CRCERROR_Clear         ( 1UL )                                  /*!< Disable */

/* Bit 12 : Write '1' to disable interrupt for event CRCOK */
#define RADIO_INTENCLR_CRCOK_Pos              ( 12UL )                              /*!< Position of CRCOK field. */
#define RADIO_INTENCLR_CRCOK_Msk              ( 0x1UL << RADIO_INTENCLR_CRCOK_Pos ) /*!< Bit mask of CRCOK field. */
#define RADIO_INTENCLR_CRCOK_Disabled         ( 0UL )                               /*!< Read: Disabled */
#define RADIO_INTENCLR_CRCOK_Enabled          ( 1UL )                               /*!< Read: Enabled */
#define RADIO_INTENCLR_CRCOK_Clear            ( 1UL )                               /*!< Disable */

/* Bit 10 : Write '1' to disable interrupt for event BCMATCH */
#define RADIO_INTENCLR_BCMATCH_Pos            ( 10UL )                                /*!< Position of BCMATCH field. */
#define RADIO_INTENCLR_BCMATCH_Msk            ( 0x1UL << RADIO_INTENCLR_BCMATCH_Pos ) /*!< Bit mask of BCMATCH field. */
#define RADIO_INTENCLR_BCMATCH_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define RADIO_INTENCLR_BCMATCH_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define RADIO_INTENCLR_BCMATCH_Clear          ( 1UL )                                 /*!< Disable */

/* Bit 7 : Write '1' to disable interrupt for event RSSIEND */
#define RADIO_INTENCLR_RSSIEND_Pos            ( 7UL )                                 /*!< Position of RSSIEND field. */
#define RADIO_INTENCLR_RSSIEND_Msk            ( 0x1UL << RADIO_INTENCLR_RSSIEND_Pos ) /*!< Bit mask of RSSIEND field. */
#define RADIO_INTENCLR_RSSIEND_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define RADIO_INTENCLR_RSSIEND_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define RADIO_INTENCLR_RSSIEND_Clear          ( 1UL )                                 /*!< Disable */

/* Bit 6 : Write '1' to disable interrupt for event DEVMISS */
#define RADIO_INTENCLR_DEVMISS_Pos            ( 6UL )                                 /*!< Position of DEVMISS field. */
#define RADIO_INTENCLR_DEVMISS_Msk            ( 0x1UL << RADIO_INTENCLR_DEVMISS_Pos ) /*!< Bit mask of DEVMISS field. */
#define RADIO_INTENCLR_DEVMISS_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define RADIO_INTENCLR_DEVMISS_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define RADIO_INTENCLR_DEVMISS_Clear          ( 1UL )                                 /*!< Disable */

/* Bit 5 : Write '1' to disable interrupt for event DEVMATCH */
#define RADIO_INTENCLR_DEVMATCH_Pos           ( 5UL )                                  /*!< Position of DEVMATCH field. */
#define RADIO_INTENCLR_DEVMATCH_Msk           ( 0x1UL << RADIO_INTENCLR_DEVMATCH_Pos ) /*!< Bit mask of DEVMATCH field. */
#define RADIO_INTENCLR_DEVMATCH_Disabled      ( 0UL )                                  /*!< Read: Disabled */
#define RADIO_INTENCLR_DEVMATCH_Enabled       ( 1UL )                                  /*!< Read: Enabled */
#define RADIO_INTENCLR_DEVMATCH_Clear         ( 1UL )                                  /*!< Disable */

/* Bit 4 : Write '1' to disable interrupt for event DISABLED */
#define RADIO_INTENCLR_DISABLED_Pos           ( 4UL )                                  /*!< Position of DISABLED field. */
#define RADIO_INTENCLR_DISABLED_Msk           ( 0x1UL << RADIO_INTENCLR_DISABLED_Pos ) /*!< Bit mask of DISABLED field. */
#define RADIO_INTENCLR_DISABLED_Disabled      ( 0UL )                                  /*!< Read: Disabled */
#define RADIO_INTENCLR_DISABLED_Enabled       ( 1UL )                                  /*!< Read: Enabled */
#define RADIO_INTENCLR_DISABLED_Clear         ( 1UL )                                  /*!< Disable */

/* Bit 3 : Write '1' to disable interrupt for event END */
#define RADIO_INTENCLR_END_Pos                ( 3UL )                             /*!< Position of END field. */
#define RADIO_INTENCLR_END_Msk                ( 0x1UL << RADIO_INTENCLR_END_Pos ) /*!< Bit mask of END field. */
#define RADIO_INTENCLR_END_Disabled           ( 0UL )                             /*!< Read: Disabled */
#define RADIO_INTENCLR_END_Enabled            ( 1UL )                             /*!< Read: Enabled */
#define RADIO_INTENCLR_END_Clear              ( 1UL )                             /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event PAYLOAD */
#define RADIO_INTENCLR_PAYLOAD_Pos            ( 2UL )                                 /*!< Position of PAYLOAD field. */
#define RADIO_INTENCLR_PAYLOAD_Msk            ( 0x1UL << RADIO_INTENCLR_PAYLOAD_Pos ) /*!< Bit mask of PAYLOAD field. */
#define RADIO_INTENCLR_PAYLOAD_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define RADIO_INTENCLR_PAYLOAD_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define RADIO_INTENCLR_PAYLOAD_Clear          ( 1UL )                                 /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event ADDRESS */
#define RADIO_INTENCLR_ADDRESS_Pos            ( 1UL )                                 /*!< Position of ADDRESS field. */
#define RADIO_INTENCLR_ADDRESS_Msk            ( 0x1UL << RADIO_INTENCLR_ADDRESS_Pos ) /*!< Bit mask of ADDRESS field. */
#define RADIO_INTENCLR_ADDRESS_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define RADIO_INTENCLR_ADDRESS_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define RADIO_INTENCLR_ADDRESS_Clear          ( 1UL )                                 /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event READY */
#define RADIO_INTENCLR_READY_Pos              ( 0UL )                               /*!< Position of READY field. */
#define RADIO_INTENCLR_READY_Msk              ( 0x1UL << RADIO_INTENCLR_READY_Pos ) /*!< Bit mask of READY field. */
#define RADIO_INTENCLR_READY_Disabled         ( 0UL )                               /*!< Read: Disabled */
#define RADIO_INTENCLR_READY_Enabled          ( 1UL )                               /*!< Read: Enabled */
#define RADIO_INTENCLR_READY_Clear            ( 1UL )                               /*!< Disable */

/* Register: RADIO_CRCSTATUS */
/* Description: CRC status */

/* Bit 0 : CRC status of packet received */
#define RADIO_CRCSTATUS_CRCSTATUS_Pos         ( 0UL )                                    /*!< Position of CRCSTATUS field. */
#define RADIO_CRCSTATUS_CRCSTATUS_Msk         ( 0x1UL << RADIO_CRCSTATUS_CRCSTATUS_Pos ) /*!< Bit mask of CRCSTATUS field. */
#define RADIO_CRCSTATUS_CRCSTATUS_CRCError    ( 0UL )                                    /*!< Packet received with CRC error */
#define RADIO_CRCSTATUS_CRCSTATUS_CRCOk       ( 1UL )                                    /*!< Packet received with CRC ok */

/* Register: RADIO_RXMATCH */
/* Description: Received address */

/* Bits 2..0 : Received address */
#define RADIO_RXMATCH_RXMATCH_Pos    ( 0UL )                                /*!< Position of RXMATCH field. */
#define RADIO_RXMATCH_RXMATCH_Msk    ( 0x7UL << RADIO_RXMATCH_RXMATCH_Pos ) /*!< Bit mask of RXMATCH field. */

/* Register: RADIO_RXCRC */
/* Description: CRC field of previously received packet */

