FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bits 23..0 : CRC field of previously received packet */
#define RADIO_RXCRC_RXCRC_Pos    ( 0UL )                                 /*!< Position of RXCRC field. */
#define RADIO_RXCRC_RXCRC_Msk    ( 0xFFFFFFUL << RADIO_RXCRC_RXCRC_Pos ) /*!< Bit mask of RXCRC field. */

/* Register: RADIO_DAI */
/* Description: Device address match index */

/* Bits 2..0 : Device address match index */
#define RADIO_DAI_DAI_Pos    ( 0UL )                        /*!< Position of DAI field. */
#define RADIO_DAI_DAI_Msk    ( 0x7UL << RADIO_DAI_DAI_Pos ) /*!< Bit mask of DAI field. */

/* Register: RADIO_PDUSTAT */
/* Description: Payload status */

/* Bits 2..1 : Status on what rate packet is received with in Long Range */
#define RADIO_PDUSTAT_CISTAT_Pos             ( 1UL )                               /*!< Position of CISTAT field. */
#define RADIO_PDUSTAT_CISTAT_Msk             ( 0x3UL << RADIO_PDUSTAT_CISTAT_Pos ) /*!< Bit mask of CISTAT field. */
#define RADIO_PDUSTAT_CISTAT_LR125kbit       ( 0UL )                               /*!< Frame is received at 125 kbps */
#define RADIO_PDUSTAT_CISTAT_LR500kbit       ( 1UL )                               /*!< Frame is received at 500 kbps */

/* Bit 0 : Status on payload length vs. PCNF1.MAXLEN */
#define RADIO_PDUSTAT_PDUSTAT_Pos            ( 0UL )                                /*!< Position of PDUSTAT field. */
#define RADIO_PDUSTAT_PDUSTAT_Msk            ( 0x1UL << RADIO_PDUSTAT_PDUSTAT_Pos ) /*!< Bit mask of PDUSTAT field. */
#define RADIO_PDUSTAT_PDUSTAT_LessThan       ( 0UL )                                /*!< Payload less than PCNF1.MAXLEN */
#define RADIO_PDUSTAT_PDUSTAT_GreaterThan    ( 1UL )                                /*!< Payload greater than PCNF1.MAXLEN */

/* Register: RADIO_CTESTATUS */
/* Description: CTEInfo parsed from received packet */

/* Bits 7..6 : CTEType parsed from packet */
#define RADIO_CTESTATUS_CTETYPE_Pos    ( 6UL )                                  /*!< Position of CTETYPE field. */
#define RADIO_CTESTATUS_CTETYPE_Msk    ( 0x3UL << RADIO_CTESTATUS_CTETYPE_Pos ) /*!< Bit mask of CTETYPE field. */

/* Bit 5 : RFU parsed from packet */
#define RADIO_CTESTATUS_RFU_Pos        ( 5UL )                              /*!< Position of RFU field. */
#define RADIO_CTESTATUS_RFU_Msk        ( 0x1UL << RADIO_CTESTATUS_RFU_Pos ) /*!< Bit mask of RFU field. */

/* Bits 4..0 : CTETime parsed from packet */
#define RADIO_CTESTATUS_CTETIME_Pos    ( 0UL )                                   /*!< Position of CTETIME field. */
#define RADIO_CTESTATUS_CTETIME_Msk    ( 0x1FUL << RADIO_CTESTATUS_CTETIME_Pos ) /*!< Bit mask of CTETIME field. */

/* Register: RADIO_DFESTATUS */
/* Description: DFE status information */

/* Bit 4 : Internal state of sampling state machine */
#define RADIO_DFESTATUS_SAMPLINGSTATE_Pos           ( 4UL )                                        /*!< Position of SAMPLINGSTATE field. */
#define RADIO_DFESTATUS_SAMPLINGSTATE_Msk           ( 0x1UL << RADIO_DFESTATUS_SAMPLINGSTATE_Pos ) /*!< Bit mask of SAMPLINGSTATE field. */
#define RADIO_DFESTATUS_SAMPLINGSTATE_Idle          ( 0UL )                                        /*!< Sampling state Idle */
#define RADIO_DFESTATUS_SAMPLINGSTATE_Sampling      ( 1UL )                                        /*!< Sampling state Sampling */

/* Bits 2..0 : Internal state of switching state machine */
#define RADIO_DFESTATUS_SWITCHINGSTATE_Pos          ( 0UL )                                         /*!< Position of SWITCHINGSTATE field. */
#define RADIO_DFESTATUS_SWITCHINGSTATE_Msk          ( 0x7UL << RADIO_DFESTATUS_SWITCHINGSTATE_Pos ) /*!< Bit mask of SWITCHINGSTATE field. */
#define RADIO_DFESTATUS_SWITCHINGSTATE_Idle         ( 0UL )                                         /*!< Switching state Idle */
#define RADIO_DFESTATUS_SWITCHINGSTATE_Offset       ( 1UL )                                         /*!< Switching state Offset */
#define RADIO_DFESTATUS_SWITCHINGSTATE_Guard        ( 2UL )                                         /*!< Switching state Guard */
#define RADIO_DFESTATUS_SWITCHINGSTATE_Ref          ( 3UL )                                         /*!< Switching state Ref */
#define RADIO_DFESTATUS_SWITCHINGSTATE_Switching    ( 4UL )                                         /*!< Switching state Switching */
#define RADIO_DFESTATUS_SWITCHINGSTATE_Ending       ( 5UL )                                         /*!< Switching state Ending */

/* Register: RADIO_PACKETPTR */
/* Description: Packet pointer */

/* Bits 31..0 : Packet pointer */
#define RADIO_PACKETPTR_PACKETPTR_Pos    ( 0UL )                                           /*!< Position of PACKETPTR field. */
#define RADIO_PACKETPTR_PACKETPTR_Msk    ( 0xFFFFFFFFUL << RADIO_PACKETPTR_PACKETPTR_Pos ) /*!< Bit mask of PACKETPTR field. */

/* Register: RADIO_FREQUENCY */
/* Description: Frequency */

/* Bit 8 : Channel map selection */
#define RADIO_FREQUENCY_MAP_Pos          ( 8UL )                              /*!< Position of MAP field. */
#define RADIO_FREQUENCY_MAP_Msk          ( 0x1UL << RADIO_FREQUENCY_MAP_Pos ) /*!< Bit mask of MAP field. */
#define RADIO_FREQUENCY_MAP_Default      ( 0UL )                              /*!< Channel map between 2400 MHz and 2500 MHz */
#define RADIO_FREQUENCY_MAP_Low          ( 1UL )                              /*!< Channel map between 2360 MHz and 2460 MHz */

/* Bits 6..0 : Radio channel frequency */
#define RADIO_FREQUENCY_FREQUENCY_Pos    ( 0UL )                                     /*!< Position of FREQUENCY field. */
#define RADIO_FREQUENCY_FREQUENCY_Msk    ( 0x7FUL << RADIO_FREQUENCY_FREQUENCY_Pos ) /*!< Bit mask of FREQUENCY field. */

/* Register: RADIO_TXPOWER */
/* Description: Output power */

/* Bits 7..0 : RADIO output power */
#define RADIO_TXPOWER_TXPOWER_Pos         ( 0UL )                                 /*!< Position of TXPOWER field. */
#define RADIO_TXPOWER_TXPOWER_Msk         ( 0xFFUL << RADIO_TXPOWER_TXPOWER_Pos ) /*!< Bit mask of TXPOWER field. */
#define RADIO_TXPOWER_TXPOWER_0dBm        ( 0x0UL )                               /*!< 0 dBm */
#define RADIO_TXPOWER_TXPOWER_Pos2dBm     ( 0x2UL )                               /*!< +2 dBm */
#define RADIO_TXPOWER_TXPOWER_Pos3dBm     ( 0x3UL )                               /*!< +3 dBm */
#define RADIO_TXPOWER_TXPOWER_Pos4dBm     ( 0x4UL )                               /*!< +4 dBm */
#define RADIO_TXPOWER_TXPOWER_Pos5dBm     ( 0x5UL )                               /*!< +5 dBm */
#define RADIO_TXPOWER_TXPOWER_Pos6dBm     ( 0x6UL )                               /*!< +6 dBm */
#define RADIO_TXPOWER_TXPOWER_Pos7dBm     ( 0x7UL )                               /*!< +7 dBm */
#define RADIO_TXPOWER_TXPOWER_Pos8dBm     ( 0x8UL )                               /*!< +8 dBm */
#define RADIO_TXPOWER_TXPOWER_Neg40dBm    ( 0xD8UL )                              /*!< -40 dBm */
#define RADIO_TXPOWER_TXPOWER_Neg30dBm    ( 0xE2UL )                              /*!< Deprecated enumerator -  -40 dBm */
#define RADIO_TXPOWER_TXPOWER_Neg20dBm    ( 0xECUL )                              /*!< -20 dBm */
#define RADIO_TXPOWER_TXPOWER_Neg16dBm    ( 0xF0UL )                              /*!< -16 dBm */
#define RADIO_TXPOWER_TXPOWER_Neg12dBm    ( 0xF4UL )                              /*!< -12 dBm */
#define RADIO_TXPOWER_TXPOWER_Neg8dBm     ( 0xF8UL )                              /*!< -8 dBm */
#define RADIO_TXPOWER_TXPOWER_Neg4dBm     ( 0xFCUL )                              /*!< -4 dBm */

/* Register: RADIO_MODE */
/* Description: Data rate and modulation */

/* Bits 3..0 : Radio data rate and modulation setting. The radio supports frequency-shift keying (FSK) modulation. */
#define RADIO_MODE_MODE_Pos                   ( 0UL )                          /*!< Position of MODE field. */
#define RADIO_MODE_MODE_Msk                   ( 0xFUL << RADIO_MODE_MODE_Pos ) /*!< Bit mask of MODE field. */
#define RADIO_MODE_MODE_Nrf_1Mbit             ( 0UL )                          /*!< 1 Mbps Nordic proprietary radio mode */
#define RADIO_MODE_MODE_Nrf_2Mbit             ( 1UL )                          /*!< 2 Mbps Nordic proprietary radio mode */
#define RADIO_MODE_MODE_Ble_1Mbit             ( 3UL )                          /*!< 1 Mbps BLE */
#define RADIO_MODE_MODE_Ble_2Mbit             ( 4UL )                          /*!< 2 Mbps BLE */
#define RADIO_MODE_MODE_Ble_LR125Kbit         ( 5UL )                          /*!< Long Range 125 kbps TX, 125 kbps and 500 kbps RX */
#define RADIO_MODE_MODE_Ble_LR500Kbit         ( 6UL )                          /*!< Long Range 500 kbps TX, 125 kbps and 500 kbps RX */
#define RADIO_MODE_MODE_Ieee802154_250Kbit    ( 15UL )                         /*!< IEEE 802.15.4-2006 250 kbps */

