FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Register: RADIO_PCNF0 */
/* Description: Packet configuration register 0 */

/* Bits 30..29 : Length of TERM field in Long Range operation */
#define RADIO_PCNF0_TERMLEN_Pos         ( 29UL )                             /*!< Position of TERMLEN field. */
#define RADIO_PCNF0_TERMLEN_Msk         ( 0x3UL << RADIO_PCNF0_TERMLEN_Pos ) /*!< Bit mask of TERMLEN field. */

/* Bit 26 : Indicates if LENGTH field contains CRC or not */
#define RADIO_PCNF0_CRCINC_Pos          ( 26UL )                            /*!< Position of CRCINC field. */
#define RADIO_PCNF0_CRCINC_Msk          ( 0x1UL << RADIO_PCNF0_CRCINC_Pos ) /*!< Bit mask of CRCINC field. */
#define RADIO_PCNF0_CRCINC_Exclude      ( 0UL )                             /*!< LENGTH does not contain CRC */
#define RADIO_PCNF0_CRCINC_Include      ( 1UL )                             /*!< LENGTH includes CRC */

/* Bits 25..24 : Length of preamble on air. Decision point: TASKS_START task */
#define RADIO_PCNF0_PLEN_Pos            ( 24UL )                          /*!< Position of PLEN field. */
#define RADIO_PCNF0_PLEN_Msk            ( 0x3UL << RADIO_PCNF0_PLEN_Pos ) /*!< Bit mask of PLEN field. */
#define RADIO_PCNF0_PLEN_8bit           ( 0UL )                           /*!< 8-bit preamble */
#define RADIO_PCNF0_PLEN_16bit          ( 1UL )                           /*!< 16-bit preamble */
#define RADIO_PCNF0_PLEN_32bitZero      ( 2UL )                           /*!< 32-bit zero preamble - used for IEEE 802.15.4 */
#define RADIO_PCNF0_PLEN_LongRange      ( 3UL )                           /*!< Preamble - used for Bluetooth LE Long Range */

/* Bits 23..22 : Length of code indicator - Long Range */
#define RADIO_PCNF0_CILEN_Pos           ( 22UL )                           /*!< Position of CILEN field. */
#define RADIO_PCNF0_CILEN_Msk           ( 0x3UL << RADIO_PCNF0_CILEN_Pos ) /*!< Bit mask of CILEN field. */

/* Bit 20 : Include or exclude S1 field in RAM */
#define RADIO_PCNF0_S1INCL_Pos          ( 20UL )                            /*!< Position of S1INCL field. */
#define RADIO_PCNF0_S1INCL_Msk          ( 0x1UL << RADIO_PCNF0_S1INCL_Pos ) /*!< Bit mask of S1INCL field. */
#define RADIO_PCNF0_S1INCL_Automatic    ( 0UL )                             /*!< Include S1 field in RAM only if S1LEN &gt; 0 */
#define RADIO_PCNF0_S1INCL_Include      ( 1UL )                             /*!< Always include S1 field in RAM independent of S1LEN */

/* Bits 19..16 : Length on air of S1 field in number of bits */
#define RADIO_PCNF0_S1LEN_Pos           ( 16UL )                           /*!< Position of S1LEN field. */
#define RADIO_PCNF0_S1LEN_Msk           ( 0xFUL << RADIO_PCNF0_S1LEN_Pos ) /*!< Bit mask of S1LEN field. */

/* Bit 8 : Length on air of S0 field in number of bytes */
#define RADIO_PCNF0_S0LEN_Pos           ( 8UL )                            /*!< Position of S0LEN field. */
#define RADIO_PCNF0_S0LEN_Msk           ( 0x1UL << RADIO_PCNF0_S0LEN_Pos ) /*!< Bit mask of S0LEN field. */

/* Bits 3..0 : Length on air of LENGTH field in number of bits */
#define RADIO_PCNF0_LFLEN_Pos           ( 0UL )                            /*!< Position of LFLEN field. */
#define RADIO_PCNF0_LFLEN_Msk           ( 0xFUL << RADIO_PCNF0_LFLEN_Pos ) /*!< Bit mask of LFLEN field. */

/* Register: RADIO_PCNF1 */
/* Description: Packet configuration register 1 */

/* Bit 25 : Enable or disable packet whitening */
#define RADIO_PCNF1_WHITEEN_Pos         ( 25UL )                             /*!< Position of WHITEEN field. */
#define RADIO_PCNF1_WHITEEN_Msk         ( 0x1UL << RADIO_PCNF1_WHITEEN_Pos ) /*!< Bit mask of WHITEEN field. */
#define RADIO_PCNF1_WHITEEN_Disabled    ( 0UL )                              /*!< Disable */
#define RADIO_PCNF1_WHITEEN_Enabled     ( 1UL )                              /*!< Enable */

/* Bit 24 : On-air endianness of packet, this applies to the S0, LENGTH, S1, and the PAYLOAD fields. */
#define RADIO_PCNF1_ENDIAN_Pos          ( 24UL )                            /*!< Position of ENDIAN field. */
#define RADIO_PCNF1_ENDIAN_Msk          ( 0x1UL << RADIO_PCNF1_ENDIAN_Pos ) /*!< Bit mask of ENDIAN field. */
#define RADIO_PCNF1_ENDIAN_Little       ( 0UL )                             /*!< Least significant bit on air first */
#define RADIO_PCNF1_ENDIAN_Big          ( 1UL )                             /*!< Most significant bit on air first */

/* Bits 18..16 : Base address length in number of bytes */
#define RADIO_PCNF1_BALEN_Pos           ( 16UL )                           /*!< Position of BALEN field. */
#define RADIO_PCNF1_BALEN_Msk           ( 0x7UL << RADIO_PCNF1_BALEN_Pos ) /*!< Bit mask of BALEN field. */

/* Bits 15..8 : Static length in number of bytes */
#define RADIO_PCNF1_STATLEN_Pos         ( 8UL )                               /*!< Position of STATLEN field. */
#define RADIO_PCNF1_STATLEN_Msk         ( 0xFFUL << RADIO_PCNF1_STATLEN_Pos ) /*!< Bit mask of STATLEN field. */

/* Bits 7..0 : Maximum length of packet payload. If the packet payload is larger than MAXLEN, the radio will truncate the payload to MAXLEN. */
#define RADIO_PCNF1_MAXLEN_Pos          ( 0UL )                              /*!< Position of MAXLEN field. */
#define RADIO_PCNF1_MAXLEN_Msk          ( 0xFFUL << RADIO_PCNF1_MAXLEN_Pos ) /*!< Bit mask of MAXLEN field. */

/* Register: RADIO_BASE0 */
/* Description: Base address 0 */

/* Bits 31..0 : Base address 0 */
#define RADIO_BASE0_BASE0_Pos    ( 0UL )                                   /*!< Position of BASE0 field. */
#define RADIO_BASE0_BASE0_Msk    ( 0xFFFFFFFFUL << RADIO_BASE0_BASE0_Pos ) /*!< Bit mask of BASE0 field. */

/* Register: RADIO_BASE1 */
/* Description: Base address 1 */

/* Bits 31..0 : Base address 1 */
#define RADIO_BASE1_BASE1_Pos    ( 0UL )                                   /*!< Position of BASE1 field. */
#define RADIO_BASE1_BASE1_Msk    ( 0xFFFFFFFFUL << RADIO_BASE1_BASE1_Pos ) /*!< Bit mask of BASE1 field. */

/* Register: RADIO_PREFIX0 */
/* Description: Prefixes bytes for logical addresses 0-3 */

/* Bits 31..24 : Address prefix 3. */
#define RADIO_PREFIX0_AP3_Pos    ( 24UL )                            /*!< Position of AP3 field. */
#define RADIO_PREFIX0_AP3_Msk    ( 0xFFUL << RADIO_PREFIX0_AP3_Pos ) /*!< Bit mask of AP3 field. */

/* Bits 23..16 : Address prefix 2. */
#define RADIO_PREFIX0_AP2_Pos    ( 16UL )                            /*!< Position of AP2 field. */
#define RADIO_PREFIX0_AP2_Msk    ( 0xFFUL << RADIO_PREFIX0_AP2_Pos ) /*!< Bit mask of AP2 field. */

/* Bits 15..8 : Address prefix 1. */
#define RADIO_PREFIX0_AP1_Pos    ( 8UL )                             /*!< Position of AP1 field. */
#define RADIO_PREFIX0_AP1_Msk    ( 0xFFUL << RADIO_PREFIX0_AP1_Pos ) /*!< Bit mask of AP1 field. */

/* Bits 7..0 : Address prefix 0. */
#define RADIO_PREFIX0_AP0_Pos    ( 0UL )                             /*!< Position of AP0 field. */
#define RADIO_PREFIX0_AP0_Msk    ( 0xFFUL << RADIO_PREFIX0_AP0_Pos ) /*!< Bit mask of AP0 field. */

/* Register: RADIO_PREFIX1 */
/* Description: Prefixes bytes for logical addresses 4-7 */

/* Bits 31..24 : Address prefix 7. */
#define RADIO_PREFIX1_AP7_Pos    ( 24UL )                            /*!< Position of AP7 field. */
#define RADIO_PREFIX1_AP7_Msk    ( 0xFFUL << RADIO_PREFIX1_AP7_Pos ) /*!< Bit mask of AP7 field. */

/* Bits 23..16 : Address prefix 6. */
#define RADIO_PREFIX1_AP6_Pos    ( 16UL )                            /*!< Position of AP6 field. */
#define RADIO_PREFIX1_AP6_Msk    ( 0xFFUL << RADIO_PREFIX1_AP6_Pos ) /*!< Bit mask of AP6 field. */

/* Bits 15..8 : Address prefix 5. */
#define RADIO_PREFIX1_AP5_Pos    ( 8UL )                             /*!< Position of AP5 field. */
#define RADIO_PREFIX1_AP5_Msk    ( 0xFFUL << RADIO_PREFIX1_AP5_Pos ) /*!< Bit mask of AP5 field. */

/* Bits 7..0 : Address prefix 4. */
#define RADIO_PREFIX1_AP4_Pos    ( 0UL )                             /*!< Position of AP4 field. */
#define RADIO_PREFIX1_AP4_Msk    ( 0xFFUL << RADIO_PREFIX1_AP4_Pos ) /*!< Bit mask of AP4 field. */

/* Register: RADIO_TXADDRESS */
/* Description: Transmit address select */

/* Bits 2..0 : Transmit address select */
#define RADIO_TXADDRESS_TXADDRESS_Pos    ( 0UL )                                    /*!< Position of TXADDRESS field. */
#define RADIO_TXADDRESS_TXADDRESS_Msk    ( 0x7UL << RADIO_TXADDRESS_TXADDRESS_Pos ) /*!< Bit mask of TXADDRESS field. */

