FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bit 0 : Write '1' to enable interrupt for event VALRDY */
#define RNG_INTENSET_VALRDY_Pos         ( 0UL )                              /*!< Position of VALRDY field. */
#define RNG_INTENSET_VALRDY_Msk         ( 0x1UL << RNG_INTENSET_VALRDY_Pos ) /*!< Bit mask of VALRDY field. */
#define RNG_INTENSET_VALRDY_Disabled    ( 0UL )                              /*!< Read: Disabled */
#define RNG_INTENSET_VALRDY_Enabled     ( 1UL )                              /*!< Read: Enabled */
#define RNG_INTENSET_VALRDY_Set         ( 1UL )                              /*!< Enable */

/* Register: RNG_INTENCLR */
/* Description: Disable interrupt */

/* Bit 0 : Write '1' to disable interrupt for event VALRDY */
#define RNG_INTENCLR_VALRDY_Pos         ( 0UL )                              /*!< Position of VALRDY field. */
#define RNG_INTENCLR_VALRDY_Msk         ( 0x1UL << RNG_INTENCLR_VALRDY_Pos ) /*!< Bit mask of VALRDY field. */
#define RNG_INTENCLR_VALRDY_Disabled    ( 0UL )                              /*!< Read: Disabled */
#define RNG_INTENCLR_VALRDY_Enabled     ( 1UL )                              /*!< Read: Enabled */
#define RNG_INTENCLR_VALRDY_Clear       ( 1UL )                              /*!< Disable */

/* Register: RNG_CONFIG */
/* Description: Configuration register */

/* Bit 0 : Bias correction */
#define RNG_CONFIG_DERCEN_Pos         ( 0UL )                            /*!< Position of DERCEN field. */
#define RNG_CONFIG_DERCEN_Msk         ( 0x1UL << RNG_CONFIG_DERCEN_Pos ) /*!< Bit mask of DERCEN field. */
#define RNG_CONFIG_DERCEN_Disabled    ( 0UL )                            /*!< Disabled */
#define RNG_CONFIG_DERCEN_Enabled     ( 1UL )                            /*!< Enabled */

/* Register: RNG_VALUE */
/* Description: Output random number */

/* Bits 7..0 : Generated random number */
#define RNG_VALUE_VALUE_Pos    ( 0UL )                           /*!< Position of VALUE field. */
#define RNG_VALUE_VALUE_Msk    ( 0xFFUL << RNG_VALUE_VALUE_Pos ) /*!< Bit mask of VALUE field. */


/* Peripheral: RTC */
/* Description: Real time counter 0 */

/* Register: RTC_TASKS_START */
/* Description: Start RTC COUNTER */

/* Bit 0 : Start RTC COUNTER */
#define RTC_TASKS_START_TASKS_START_Pos        ( 0UL )                                      /*!< Position of TASKS_START field. */
#define RTC_TASKS_START_TASKS_START_Msk        ( 0x1UL << RTC_TASKS_START_TASKS_START_Pos ) /*!< Bit mask of TASKS_START field. */
#define RTC_TASKS_START_TASKS_START_Trigger    ( 1UL )                                      /*!< Trigger task */

/* Register: RTC_TASKS_STOP */
/* Description: Stop RTC COUNTER */

/* Bit 0 : Stop RTC COUNTER */
#define RTC_TASKS_STOP_TASKS_STOP_Pos        ( 0UL )                                    /*!< Position of TASKS_STOP field. */
#define RTC_TASKS_STOP_TASKS_STOP_Msk        ( 0x1UL << RTC_TASKS_STOP_TASKS_STOP_Pos ) /*!< Bit mask of TASKS_STOP field. */
#define RTC_TASKS_STOP_TASKS_STOP_Trigger    ( 1UL )                                    /*!< Trigger task */

/* Register: RTC_TASKS_CLEAR */
/* Description: Clear RTC COUNTER */

/* Bit 0 : Clear RTC COUNTER */
#define RTC_TASKS_CLEAR_TASKS_CLEAR_Pos        ( 0UL )                                      /*!< Position of TASKS_CLEAR field. */
#define RTC_TASKS_CLEAR_TASKS_CLEAR_Msk        ( 0x1UL << RTC_TASKS_CLEAR_TASKS_CLEAR_Pos ) /*!< Bit mask of TASKS_CLEAR field. */
#define RTC_TASKS_CLEAR_TASKS_CLEAR_Trigger    ( 1UL )                                      /*!< Trigger task */

/* Register: RTC_TASKS_TRIGOVRFLW */
/* Description: Set COUNTER to 0xFFFFF0 */

/* Bit 0 : Set COUNTER to 0xFFFFF0 */
#define RTC_TASKS_TRIGOVRFLW_TASKS_TRIGOVRFLW_Pos        ( 0UL )                                                /*!< Position of TASKS_TRIGOVRFLW field. */
#define RTC_TASKS_TRIGOVRFLW_TASKS_TRIGOVRFLW_Msk        ( 0x1UL << RTC_TASKS_TRIGOVRFLW_TASKS_TRIGOVRFLW_Pos ) /*!< Bit mask of TASKS_TRIGOVRFLW field. */
#define RTC_TASKS_TRIGOVRFLW_TASKS_TRIGOVRFLW_Trigger    ( 1UL )                                                /*!< Trigger task */

/* Register: RTC_EVENTS_TICK */
/* Description: Event on COUNTER increment */

/* Bit 0 : Event on COUNTER increment */
#define RTC_EVENTS_TICK_EVENTS_TICK_Pos             ( 0UL )                                      /*!< Position of EVENTS_TICK field. */
#define RTC_EVENTS_TICK_EVENTS_TICK_Msk             ( 0x1UL << RTC_EVENTS_TICK_EVENTS_TICK_Pos ) /*!< Bit mask of EVENTS_TICK field. */
#define RTC_EVENTS_TICK_EVENTS_TICK_NotGenerated    ( 0UL )                                      /*!< Event not generated */
#define RTC_EVENTS_TICK_EVENTS_TICK_Generated       ( 1UL )                                      /*!< Event generated */

/* Register: RTC_EVENTS_OVRFLW */
/* Description: Event on COUNTER overflow */

/* Bit 0 : Event on COUNTER overflow */
#define RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_Pos             ( 0UL )                                          /*!< Position of EVENTS_OVRFLW field. */
#define RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_Msk             ( 0x1UL << RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_Pos ) /*!< Bit mask of EVENTS_OVRFLW field. */
#define RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_NotGenerated    ( 0UL )                                          /*!< Event not generated */
#define RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_Generated       ( 1UL )                                          /*!< Event generated */

/* Register: RTC_EVENTS_COMPARE */
/* Description: Description collection: Compare event on CC[n] match */

/* Bit 0 : Compare event on CC[n] match */
#define RTC_EVENTS_COMPARE_EVENTS_COMPARE_Pos             ( 0UL )                                            /*!< Position of EVENTS_COMPARE field. */
#define RTC_EVENTS_COMPARE_EVENTS_COMPARE_Msk             ( 0x1UL << RTC_EVENTS_COMPARE_EVENTS_COMPARE_Pos ) /*!< Bit mask of EVENTS_COMPARE field. */
#define RTC_EVENTS_COMPARE_EVENTS_COMPARE_NotGenerated    ( 0UL )                                            /*!< Event not generated */
#define RTC_EVENTS_COMPARE_EVENTS_COMPARE_Generated       ( 1UL )                                            /*!< Event generated */

