FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bit 19 : Write '1' to disable event routing for event COMPARE[3] */
#define RTC_EVTENCLR_COMPARE3_Pos         ( 19UL )                               /*!< Position of COMPARE3 field. */
#define RTC_EVTENCLR_COMPARE3_Msk         ( 0x1UL << RTC_EVTENCLR_COMPARE3_Pos ) /*!< Bit mask of COMPARE3 field. */
#define RTC_EVTENCLR_COMPARE3_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define RTC_EVTENCLR_COMPARE3_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define RTC_EVTENCLR_COMPARE3_Clear       ( 1UL )                                /*!< Disable */

/* Bit 18 : Write '1' to disable event routing for event COMPARE[2] */
#define RTC_EVTENCLR_COMPARE2_Pos         ( 18UL )                               /*!< Position of COMPARE2 field. */
#define RTC_EVTENCLR_COMPARE2_Msk         ( 0x1UL << RTC_EVTENCLR_COMPARE2_Pos ) /*!< Bit mask of COMPARE2 field. */
#define RTC_EVTENCLR_COMPARE2_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define RTC_EVTENCLR_COMPARE2_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define RTC_EVTENCLR_COMPARE2_Clear       ( 1UL )                                /*!< Disable */

/* Bit 17 : Write '1' to disable event routing for event COMPARE[1] */
#define RTC_EVTENCLR_COMPARE1_Pos         ( 17UL )                               /*!< Position of COMPARE1 field. */
#define RTC_EVTENCLR_COMPARE1_Msk         ( 0x1UL << RTC_EVTENCLR_COMPARE1_Pos ) /*!< Bit mask of COMPARE1 field. */
#define RTC_EVTENCLR_COMPARE1_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define RTC_EVTENCLR_COMPARE1_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define RTC_EVTENCLR_COMPARE1_Clear       ( 1UL )                                /*!< Disable */

/* Bit 16 : Write '1' to disable event routing for event COMPARE[0] */
#define RTC_EVTENCLR_COMPARE0_Pos         ( 16UL )                               /*!< Position of COMPARE0 field. */
#define RTC_EVTENCLR_COMPARE0_Msk         ( 0x1UL << RTC_EVTENCLR_COMPARE0_Pos ) /*!< Bit mask of COMPARE0 field. */
#define RTC_EVTENCLR_COMPARE0_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define RTC_EVTENCLR_COMPARE0_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define RTC_EVTENCLR_COMPARE0_Clear       ( 1UL )                                /*!< Disable */

/* Bit 1 : Write '1' to disable event routing for event OVRFLW */
#define RTC_EVTENCLR_OVRFLW_Pos           ( 1UL )                              /*!< Position of OVRFLW field. */
#define RTC_EVTENCLR_OVRFLW_Msk           ( 0x1UL << RTC_EVTENCLR_OVRFLW_Pos ) /*!< Bit mask of OVRFLW field. */
#define RTC_EVTENCLR_OVRFLW_Disabled      ( 0UL )                              /*!< Read: Disabled */
#define RTC_EVTENCLR_OVRFLW_Enabled       ( 1UL )                              /*!< Read: Enabled */
#define RTC_EVTENCLR_OVRFLW_Clear         ( 1UL )                              /*!< Disable */

/* Bit 0 : Write '1' to disable event routing for event TICK */
#define RTC_EVTENCLR_TICK_Pos             ( 0UL )                            /*!< Position of TICK field. */
#define RTC_EVTENCLR_TICK_Msk             ( 0x1UL << RTC_EVTENCLR_TICK_Pos ) /*!< Bit mask of TICK field. */
#define RTC_EVTENCLR_TICK_Disabled        ( 0UL )                            /*!< Read: Disabled */
#define RTC_EVTENCLR_TICK_Enabled         ( 1UL )                            /*!< Read: Enabled */
#define RTC_EVTENCLR_TICK_Clear           ( 1UL )                            /*!< Disable */

/* Register: RTC_COUNTER */
/* Description: Current COUNTER value */

/* Bits 23..0 : Counter value */
#define RTC_COUNTER_COUNTER_Pos    ( 0UL )                                   /*!< Position of COUNTER field. */
#define RTC_COUNTER_COUNTER_Msk    ( 0xFFFFFFUL << RTC_COUNTER_COUNTER_Pos ) /*!< Bit mask of COUNTER field. */

/* Register: RTC_PRESCALER */
/* Description: 12 bit prescaler for COUNTER frequency (32768/(PRESCALER+1)). Must be written when RTC is stopped. */

/* Bits 11..0 : Prescaler value */
#define RTC_PRESCALER_PRESCALER_Pos    ( 0UL )                                    /*!< Position of PRESCALER field. */
#define RTC_PRESCALER_PRESCALER_Msk    ( 0xFFFUL << RTC_PRESCALER_PRESCALER_Pos ) /*!< Bit mask of PRESCALER field. */

/* Register: RTC_CC */
/* Description: Description collection: Compare register n */

/* Bits 23..0 : Compare value */
#define RTC_CC_COMPARE_Pos    ( 0UL )                              /*!< Position of COMPARE field. */
#define RTC_CC_COMPARE_Msk    ( 0xFFFFFFUL << RTC_CC_COMPARE_Pos ) /*!< Bit mask of COMPARE field. */


/* Peripheral: SPI */
/* Description: Serial Peripheral Interface 0 */

/* Register: SPI_EVENTS_READY */
/* Description: TXD byte sent and RXD byte received */

/* Bit 0 : TXD byte sent and RXD byte received */
#define SPI_EVENTS_READY_EVENTS_READY_Pos             ( 0UL )                                        /*!< Position of EVENTS_READY field. */
#define SPI_EVENTS_READY_EVENTS_READY_Msk             ( 0x1UL << SPI_EVENTS_READY_EVENTS_READY_Pos ) /*!< Bit mask of EVENTS_READY field. */
#define SPI_EVENTS_READY_EVENTS_READY_NotGenerated    ( 0UL )                                        /*!< Event not generated */
#define SPI_EVENTS_READY_EVENTS_READY_Generated       ( 1UL )                                        /*!< Event generated */

/* Register: SPI_INTENSET */
/* Description: Enable interrupt */

/* Bit 2 : Write '1' to enable interrupt for event READY */
#define SPI_INTENSET_READY_Pos         ( 2UL )                             /*!< Position of READY field. */
#define SPI_INTENSET_READY_Msk         ( 0x1UL << SPI_INTENSET_READY_Pos ) /*!< Bit mask of READY field. */
#define SPI_INTENSET_READY_Disabled    ( 0UL )                             /*!< Read: Disabled */
#define SPI_INTENSET_READY_Enabled     ( 1UL )                             /*!< Read: Enabled */
#define SPI_INTENSET_READY_Set         ( 1UL )                             /*!< Enable */

/* Register: SPI_INTENCLR */
/* Description: Disable interrupt */

/* Bit 2 : Write '1' to disable interrupt for event READY */
#define SPI_INTENCLR_READY_Pos         ( 2UL )                             /*!< Position of READY field. */
#define SPI_INTENCLR_READY_Msk         ( 0x1UL << SPI_INTENCLR_READY_Pos ) /*!< Bit mask of READY field. */
#define SPI_INTENCLR_READY_Disabled    ( 0UL )                             /*!< Read: Disabled */
#define SPI_INTENCLR_READY_Enabled     ( 1UL )                             /*!< Read: Enabled */
#define SPI_INTENCLR_READY_Clear       ( 1UL )                             /*!< Disable */

/* Register: SPI_ENABLE */
/* Description: Enable SPI */

