FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bit 0 : TX buffer over-read detected, and prevented */
#define SPIS_STATUS_OVERREAD_Pos           ( 0UL )                               /*!< Position of OVERREAD field. */
#define SPIS_STATUS_OVERREAD_Msk           ( 0x1UL << SPIS_STATUS_OVERREAD_Pos ) /*!< Bit mask of OVERREAD field. */
#define SPIS_STATUS_OVERREAD_NotPresent    ( 0UL )                               /*!< Read: error not present */
#define SPIS_STATUS_OVERREAD_Present       ( 1UL )                               /*!< Read: error present */
#define SPIS_STATUS_OVERREAD_Clear         ( 1UL )                               /*!< Write: clear error on writing '1' */

/* Register: SPIS_ENABLE */
/* Description: Enable SPI slave */

/* Bits 3..0 : Enable or disable SPI slave */
#define SPIS_ENABLE_ENABLE_Pos         ( 0UL )                             /*!< Position of ENABLE field. */
#define SPIS_ENABLE_ENABLE_Msk         ( 0xFUL << SPIS_ENABLE_ENABLE_Pos ) /*!< Bit mask of ENABLE field. */
#define SPIS_ENABLE_ENABLE_Disabled    ( 0UL )                             /*!< Disable SPI slave */
#define SPIS_ENABLE_ENABLE_Enabled     ( 2UL )                             /*!< Enable SPI slave */

/* Register: SPIS_PSEL_SCK */
/* Description: Pin select for SCK */

/* Bit 31 : Connection */
#define SPIS_PSEL_SCK_CONNECT_Pos             ( 31UL )                               /*!< Position of CONNECT field. */
#define SPIS_PSEL_SCK_CONNECT_Msk             ( 0x1UL << SPIS_PSEL_SCK_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define SPIS_PSEL_SCK_CONNECT_Connected       ( 0UL )                                /*!< Connect */
#define SPIS_PSEL_SCK_CONNECT_Disconnected    ( 1UL )                                /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define SPIS_PSEL_SCK_PIN_Pos                 ( 0UL )                             /*!< Position of PIN field. */
#define SPIS_PSEL_SCK_PIN_Msk                 ( 0x1FUL << SPIS_PSEL_SCK_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: SPIS_PSEL_MISO */
/* Description: Pin select for MISO signal */

/* Bit 31 : Connection */
#define SPIS_PSEL_MISO_CONNECT_Pos             ( 31UL )                                /*!< Position of CONNECT field. */
#define SPIS_PSEL_MISO_CONNECT_Msk             ( 0x1UL << SPIS_PSEL_MISO_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define SPIS_PSEL_MISO_CONNECT_Connected       ( 0UL )                                 /*!< Connect */
#define SPIS_PSEL_MISO_CONNECT_Disconnected    ( 1UL )                                 /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define SPIS_PSEL_MISO_PIN_Pos                 ( 0UL )                              /*!< Position of PIN field. */
#define SPIS_PSEL_MISO_PIN_Msk                 ( 0x1FUL << SPIS_PSEL_MISO_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: SPIS_PSEL_MOSI */
/* Description: Pin select for MOSI signal */

/* Bit 31 : Connection */
#define SPIS_PSEL_MOSI_CONNECT_Pos             ( 31UL )                                /*!< Position of CONNECT field. */
#define SPIS_PSEL_MOSI_CONNECT_Msk             ( 0x1UL << SPIS_PSEL_MOSI_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define SPIS_PSEL_MOSI_CONNECT_Connected       ( 0UL )                                 /*!< Connect */
#define SPIS_PSEL_MOSI_CONNECT_Disconnected    ( 1UL )                                 /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define SPIS_PSEL_MOSI_PIN_Pos                 ( 0UL )                              /*!< Position of PIN field. */
#define SPIS_PSEL_MOSI_PIN_Msk                 ( 0x1FUL << SPIS_PSEL_MOSI_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: SPIS_PSEL_CSN */
/* Description: Pin select for CSN signal */

/* Bit 31 : Connection */
#define SPIS_PSEL_CSN_CONNECT_Pos             ( 31UL )                               /*!< Position of CONNECT field. */
#define SPIS_PSEL_CSN_CONNECT_Msk             ( 0x1UL << SPIS_PSEL_CSN_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define SPIS_PSEL_CSN_CONNECT_Connected       ( 0UL )                                /*!< Connect */
#define SPIS_PSEL_CSN_CONNECT_Disconnected    ( 1UL )                                /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define SPIS_PSEL_CSN_PIN_Pos                 ( 0UL )                             /*!< Position of PIN field. */
#define SPIS_PSEL_CSN_PIN_Msk                 ( 0x1FUL << SPIS_PSEL_CSN_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: SPIS_RXD_PTR */
/* Description: RXD data pointer */

/* Bits 31..0 : RXD data pointer */
#define SPIS_RXD_PTR_PTR_Pos    ( 0UL )                                  /*!< Position of PTR field. */
#define SPIS_RXD_PTR_PTR_Msk    ( 0xFFFFFFFFUL << SPIS_RXD_PTR_PTR_Pos ) /*!< Bit mask of PTR field. */

/* Register: SPIS_RXD_MAXCNT */
/* Description: Maximum number of bytes in receive buffer */

/* Bits 14..0 : Maximum number of bytes in receive buffer */
#define SPIS_RXD_MAXCNT_MAXCNT_Pos    ( 0UL )                                    /*!< Position of MAXCNT field. */
#define SPIS_RXD_MAXCNT_MAXCNT_Msk    ( 0x7FFFUL << SPIS_RXD_MAXCNT_MAXCNT_Pos ) /*!< Bit mask of MAXCNT field. */

/* Register: SPIS_RXD_AMOUNT */
/* Description: Number of bytes received in last granted transaction */

/* Bits 14..0 : Number of bytes received in the last granted transaction */
#define SPIS_RXD_AMOUNT_AMOUNT_Pos    ( 0UL )                                    /*!< Position of AMOUNT field. */
#define SPIS_RXD_AMOUNT_AMOUNT_Msk    ( 0x7FFFUL << SPIS_RXD_AMOUNT_AMOUNT_Pos ) /*!< Bit mask of AMOUNT field. */

/* Register: SPIS_RXD_LIST */
/* Description: EasyDMA list type */

/* Bits 1..0 : List type */
#define SPIS_RXD_LIST_LIST_Pos          ( 0UL )                             /*!< Position of LIST field. */
#define SPIS_RXD_LIST_LIST_Msk          ( 0x3UL << SPIS_RXD_LIST_LIST_Pos ) /*!< Bit mask of LIST field. */
#define SPIS_RXD_LIST_LIST_Disabled     ( 0UL )                             /*!< Disable EasyDMA list */
#define SPIS_RXD_LIST_LIST_ArrayList    ( 1UL )                             /*!< Use array list */

/* Register: SPIS_TXD_PTR */
/* Description: TXD data pointer */

/* Bits 31..0 : TXD data pointer */
#define SPIS_TXD_PTR_PTR_Pos    ( 0UL )                                  /*!< Position of PTR field. */
#define SPIS_TXD_PTR_PTR_Msk    ( 0xFFFFFFFFUL << SPIS_TXD_PTR_PTR_Pos ) /*!< Bit mask of PTR field. */

/* Register: SPIS_TXD_MAXCNT */
/* Description: Maximum number of bytes in transmit buffer */

/* Bits 14..0 : Maximum number of bytes in transmit buffer */
#define SPIS_TXD_MAXCNT_MAXCNT_Pos    ( 0UL )                                    /*!< Position of MAXCNT field. */
#define SPIS_TXD_MAXCNT_MAXCNT_Msk    ( 0x7FFFUL << SPIS_TXD_MAXCNT_MAXCNT_Pos ) /*!< Bit mask of MAXCNT field. */

/* Register: SPIS_TXD_AMOUNT */
/* Description: Number of bytes transmitted in last granted transaction */

