FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Register: TIMER_TASKS_COUNT */
/* Description: Increment Timer (Counter mode only) */

/* Bit 0 : Increment Timer (Counter mode only) */
#define TIMER_TASKS_COUNT_TASKS_COUNT_Pos        ( 0UL )                                        /*!< Position of TASKS_COUNT field. */
#define TIMER_TASKS_COUNT_TASKS_COUNT_Msk        ( 0x1UL << TIMER_TASKS_COUNT_TASKS_COUNT_Pos ) /*!< Bit mask of TASKS_COUNT field. */
#define TIMER_TASKS_COUNT_TASKS_COUNT_Trigger    ( 1UL )                                        /*!< Trigger task */

/* Register: TIMER_TASKS_CLEAR */
/* Description: Clear time */

/* Bit 0 : Clear time */
#define TIMER_TASKS_CLEAR_TASKS_CLEAR_Pos        ( 0UL )                                        /*!< Position of TASKS_CLEAR field. */
#define TIMER_TASKS_CLEAR_TASKS_CLEAR_Msk        ( 0x1UL << TIMER_TASKS_CLEAR_TASKS_CLEAR_Pos ) /*!< Bit mask of TASKS_CLEAR field. */
#define TIMER_TASKS_CLEAR_TASKS_CLEAR_Trigger    ( 1UL )                                        /*!< Trigger task */

/* Register: TIMER_TASKS_SHUTDOWN */
/* Description: Deprecated register - Shut down timer */

/* Bit 0 : Deprecated field -  Shut down timer */
#define TIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Pos        ( 0UL )                                              /*!< Position of TASKS_SHUTDOWN field. */
#define TIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Msk        ( 0x1UL << TIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Pos ) /*!< Bit mask of TASKS_SHUTDOWN field. */
#define TIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Trigger    ( 1UL )                                              /*!< Trigger task */

/* Register: TIMER_TASKS_CAPTURE */
/* Description: Description collection: Capture Timer value to CC[n] register */

/* Bit 0 : Capture Timer value to CC[n] register */
#define TIMER_TASKS_CAPTURE_TASKS_CAPTURE_Pos        ( 0UL )                                            /*!< Position of TASKS_CAPTURE field. */
#define TIMER_TASKS_CAPTURE_TASKS_CAPTURE_Msk        ( 0x1UL << TIMER_TASKS_CAPTURE_TASKS_CAPTURE_Pos ) /*!< Bit mask of TASKS_CAPTURE field. */
#define TIMER_TASKS_CAPTURE_TASKS_CAPTURE_Trigger    ( 1UL )                                            /*!< Trigger task */

/* Register: TIMER_EVENTS_COMPARE */
/* Description: Description collection: Compare event on CC[n] match */

/* Bit 0 : Compare event on CC[n] match */
#define TIMER_EVENTS_COMPARE_EVENTS_COMPARE_Pos             ( 0UL )                                              /*!< Position of EVENTS_COMPARE field. */
#define TIMER_EVENTS_COMPARE_EVENTS_COMPARE_Msk             ( 0x1UL << TIMER_EVENTS_COMPARE_EVENTS_COMPARE_Pos ) /*!< Bit mask of EVENTS_COMPARE field. */
#define TIMER_EVENTS_COMPARE_EVENTS_COMPARE_NotGenerated    ( 0UL )                                              /*!< Event not generated */
#define TIMER_EVENTS_COMPARE_EVENTS_COMPARE_Generated       ( 1UL )                                              /*!< Event generated */

/* Register: TIMER_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 13 : Shortcut between event COMPARE[5] and task STOP */
#define TIMER_SHORTS_COMPARE5_STOP_Pos          ( 13UL )                                    /*!< Position of COMPARE5_STOP field. */
#define TIMER_SHORTS_COMPARE5_STOP_Msk          ( 0x1UL << TIMER_SHORTS_COMPARE5_STOP_Pos ) /*!< Bit mask of COMPARE5_STOP field. */
#define TIMER_SHORTS_COMPARE5_STOP_Disabled     ( 0UL )                                     /*!< Disable shortcut */
#define TIMER_SHORTS_COMPARE5_STOP_Enabled      ( 1UL )                                     /*!< Enable shortcut */

/* Bit 12 : Shortcut between event COMPARE[4] and task STOP */
#define TIMER_SHORTS_COMPARE4_STOP_Pos          ( 12UL )                                    /*!< Position of COMPARE4_STOP field. */
#define TIMER_SHORTS_COMPARE4_STOP_Msk          ( 0x1UL << TIMER_SHORTS_COMPARE4_STOP_Pos ) /*!< Bit mask of COMPARE4_STOP field. */
#define TIMER_SHORTS_COMPARE4_STOP_Disabled     ( 0UL )                                     /*!< Disable shortcut */
#define TIMER_SHORTS_COMPARE4_STOP_Enabled      ( 1UL )                                     /*!< Enable shortcut */

/* Bit 11 : Shortcut between event COMPARE[3] and task STOP */
#define TIMER_SHORTS_COMPARE3_STOP_Pos          ( 11UL )                                    /*!< Position of COMPARE3_STOP field. */
#define TIMER_SHORTS_COMPARE3_STOP_Msk          ( 0x1UL << TIMER_SHORTS_COMPARE3_STOP_Pos ) /*!< Bit mask of COMPARE3_STOP field. */
#define TIMER_SHORTS_COMPARE3_STOP_Disabled     ( 0UL )                                     /*!< Disable shortcut */
#define TIMER_SHORTS_COMPARE3_STOP_Enabled      ( 1UL )                                     /*!< Enable shortcut */

/* Bit 10 : Shortcut between event COMPARE[2] and task STOP */
#define TIMER_SHORTS_COMPARE2_STOP_Pos          ( 10UL )                                    /*!< Position of COMPARE2_STOP field. */
#define TIMER_SHORTS_COMPARE2_STOP_Msk          ( 0x1UL << TIMER_SHORTS_COMPARE2_STOP_Pos ) /*!< Bit mask of COMPARE2_STOP field. */
#define TIMER_SHORTS_COMPARE2_STOP_Disabled     ( 0UL )                                     /*!< Disable shortcut */
#define TIMER_SHORTS_COMPARE2_STOP_Enabled      ( 1UL )                                     /*!< Enable shortcut */

/* Bit 9 : Shortcut between event COMPARE[1] and task STOP */
#define TIMER_SHORTS_COMPARE1_STOP_Pos          ( 9UL )                                     /*!< Position of COMPARE1_STOP field. */
#define TIMER_SHORTS_COMPARE1_STOP_Msk          ( 0x1UL << TIMER_SHORTS_COMPARE1_STOP_Pos ) /*!< Bit mask of COMPARE1_STOP field. */
#define TIMER_SHORTS_COMPARE1_STOP_Disabled     ( 0UL )                                     /*!< Disable shortcut */
#define TIMER_SHORTS_COMPARE1_STOP_Enabled      ( 1UL )                                     /*!< Enable shortcut */

/* Bit 8 : Shortcut between event COMPARE[0] and task STOP */
#define TIMER_SHORTS_COMPARE0_STOP_Pos          ( 8UL )                                     /*!< Position of COMPARE0_STOP field. */
#define TIMER_SHORTS_COMPARE0_STOP_Msk          ( 0x1UL << TIMER_SHORTS_COMPARE0_STOP_Pos ) /*!< Bit mask of COMPARE0_STOP field. */
#define TIMER_SHORTS_COMPARE0_STOP_Disabled     ( 0UL )                                     /*!< Disable shortcut */
#define TIMER_SHORTS_COMPARE0_STOP_Enabled      ( 1UL )                                     /*!< Enable shortcut */

/* Bit 5 : Shortcut between event COMPARE[5] and task CLEAR */
#define TIMER_SHORTS_COMPARE5_CLEAR_Pos         ( 5UL )                                      /*!< Position of COMPARE5_CLEAR field. */
#define TIMER_SHORTS_COMPARE5_CLEAR_Msk         ( 0x1UL << TIMER_SHORTS_COMPARE5_CLEAR_Pos ) /*!< Bit mask of COMPARE5_CLEAR field. */
#define TIMER_SHORTS_COMPARE5_CLEAR_Disabled    ( 0UL )                                      /*!< Disable shortcut */
#define TIMER_SHORTS_COMPARE5_CLEAR_Enabled     ( 1UL )                                      /*!< Enable shortcut */

/* Bit 4 : Shortcut between event COMPARE[4] and task CLEAR */
#define TIMER_SHORTS_COMPARE4_CLEAR_Pos         ( 4UL )                                      /*!< Position of COMPARE4_CLEAR field. */
#define TIMER_SHORTS_COMPARE4_CLEAR_Msk         ( 0x1UL << TIMER_SHORTS_COMPARE4_CLEAR_Pos ) /*!< Bit mask of COMPARE4_CLEAR field. */
#define TIMER_SHORTS_COMPARE4_CLEAR_Disabled    ( 0UL )                                      /*!< Disable shortcut */
#define TIMER_SHORTS_COMPARE4_CLEAR_Enabled     ( 1UL )                                      /*!< Enable shortcut */

/* Bit 3 : Shortcut between event COMPARE[3] and task CLEAR */
#define TIMER_SHORTS_COMPARE3_CLEAR_Pos         ( 3UL )                                      /*!< Position of COMPARE3_CLEAR field. */
#define TIMER_SHORTS_COMPARE3_CLEAR_Msk         ( 0x1UL << TIMER_SHORTS_COMPARE3_CLEAR_Pos ) /*!< Bit mask of COMPARE3_CLEAR field. */
#define TIMER_SHORTS_COMPARE3_CLEAR_Disabled    ( 0UL )                                      /*!< Disable shortcut */
#define TIMER_SHORTS_COMPARE3_CLEAR_Enabled     ( 1UL )                                      /*!< Enable shortcut */

