FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bit 1 : Write '1' to disable interrupt for event STOPPED */
#define TWI_INTENCLR_STOPPED_Pos           ( 1UL )                               /*!< Position of STOPPED field. */
#define TWI_INTENCLR_STOPPED_Msk           ( 0x1UL << TWI_INTENCLR_STOPPED_Pos ) /*!< Bit mask of STOPPED field. */
#define TWI_INTENCLR_STOPPED_Disabled      ( 0UL )                               /*!< Read: Disabled */
#define TWI_INTENCLR_STOPPED_Enabled       ( 1UL )                               /*!< Read: Enabled */
#define TWI_INTENCLR_STOPPED_Clear         ( 1UL )                               /*!< Disable */

/* Register: TWI_ERRORSRC */
/* Description: Error source */

/* Bit 2 : NACK received after sending a data byte (write '1' to clear) */
#define TWI_ERRORSRC_DNACK_Pos             ( 2UL )                             /*!< Position of DNACK field. */
#define TWI_ERRORSRC_DNACK_Msk             ( 0x1UL << TWI_ERRORSRC_DNACK_Pos ) /*!< Bit mask of DNACK field. */
#define TWI_ERRORSRC_DNACK_NotPresent      ( 0UL )                             /*!< Read: error not present */
#define TWI_ERRORSRC_DNACK_Present         ( 1UL )                             /*!< Read: error present */

/* Bit 1 : NACK received after sending the address (write '1' to clear) */
#define TWI_ERRORSRC_ANACK_Pos             ( 1UL )                             /*!< Position of ANACK field. */
#define TWI_ERRORSRC_ANACK_Msk             ( 0x1UL << TWI_ERRORSRC_ANACK_Pos ) /*!< Bit mask of ANACK field. */
#define TWI_ERRORSRC_ANACK_NotPresent      ( 0UL )                             /*!< Read: error not present */
#define TWI_ERRORSRC_ANACK_Present         ( 1UL )                             /*!< Read: error present */

/* Bit 0 : Overrun error */
#define TWI_ERRORSRC_OVERRUN_Pos           ( 0UL )                               /*!< Position of OVERRUN field. */
#define TWI_ERRORSRC_OVERRUN_Msk           ( 0x1UL << TWI_ERRORSRC_OVERRUN_Pos ) /*!< Bit mask of OVERRUN field. */
#define TWI_ERRORSRC_OVERRUN_NotPresent    ( 0UL )                               /*!< Read: no overrun occured */
#define TWI_ERRORSRC_OVERRUN_Present       ( 1UL )                               /*!< Read: overrun occured */

/* Register: TWI_ENABLE */
/* Description: Enable TWI */

/* Bits 3..0 : Enable or disable TWI */
#define TWI_ENABLE_ENABLE_Pos         ( 0UL )                            /*!< Position of ENABLE field. */
#define TWI_ENABLE_ENABLE_Msk         ( 0xFUL << TWI_ENABLE_ENABLE_Pos ) /*!< Bit mask of ENABLE field. */
#define TWI_ENABLE_ENABLE_Disabled    ( 0UL )                            /*!< Disable TWI */
#define TWI_ENABLE_ENABLE_Enabled     ( 5UL )                            /*!< Enable TWI */

/* Register: TWI_PSEL_SCL */
/* Description: Pin select for SCL */

/* Bit 31 : Connection */
#define TWI_PSEL_SCL_CONNECT_Pos             ( 31UL )                              /*!< Position of CONNECT field. */
#define TWI_PSEL_SCL_CONNECT_Msk             ( 0x1UL << TWI_PSEL_SCL_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define TWI_PSEL_SCL_CONNECT_Connected       ( 0UL )                               /*!< Connect */
#define TWI_PSEL_SCL_CONNECT_Disconnected    ( 1UL )                               /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define TWI_PSEL_SCL_PIN_Pos                 ( 0UL )                            /*!< Position of PIN field. */
#define TWI_PSEL_SCL_PIN_Msk                 ( 0x1FUL << TWI_PSEL_SCL_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: TWI_PSEL_SDA */
/* Description: Pin select for SDA */

/* Bit 31 : Connection */
#define TWI_PSEL_SDA_CONNECT_Pos             ( 31UL )                              /*!< Position of CONNECT field. */
#define TWI_PSEL_SDA_CONNECT_Msk             ( 0x1UL << TWI_PSEL_SDA_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define TWI_PSEL_SDA_CONNECT_Connected       ( 0UL )                               /*!< Connect */
#define TWI_PSEL_SDA_CONNECT_Disconnected    ( 1UL )                               /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define TWI_PSEL_SDA_PIN_Pos                 ( 0UL )                            /*!< Position of PIN field. */
#define TWI_PSEL_SDA_PIN_Msk                 ( 0x1FUL << TWI_PSEL_SDA_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: TWI_RXD */
/* Description: RXD register */

/* Bits 7..0 : RXD register */
#define TWI_RXD_RXD_Pos    ( 0UL )                       /*!< Position of RXD field. */
#define TWI_RXD_RXD_Msk    ( 0xFFUL << TWI_RXD_RXD_Pos ) /*!< Bit mask of RXD field. */

/* Register: TWI_TXD */
/* Description: TXD register */

/* Bits 7..0 : TXD register */
#define TWI_TXD_TXD_Pos    ( 0UL )                       /*!< Position of TXD field. */
#define TWI_TXD_TXD_Msk    ( 0xFFUL << TWI_TXD_TXD_Pos ) /*!< Bit mask of TXD field. */

/* Register: TWI_FREQUENCY */
/* Description: TWI frequency. Accuracy depends on the HFCLK source selected. */

/* Bits 31..0 : TWI master clock frequency */
#define TWI_FREQUENCY_FREQUENCY_Pos     ( 0UL )                                         /*!< Position of FREQUENCY field. */
#define TWI_FREQUENCY_FREQUENCY_Msk     ( 0xFFFFFFFFUL << TWI_FREQUENCY_FREQUENCY_Pos ) /*!< Bit mask of FREQUENCY field. */
#define TWI_FREQUENCY_FREQUENCY_K100    ( 0x01980000UL )                                /*!< 100 kbps */
#define TWI_FREQUENCY_FREQUENCY_K250    ( 0x04000000UL )                                /*!< 250 kbps */
#define TWI_FREQUENCY_FREQUENCY_K400    ( 0x06680000UL )                                /*!< 400 kbps (actual rate 410.256 kbps) */

/* Register: TWI_ADDRESS */
/* Description: Address used in the TWI transfer */

/* Bits 6..0 : Address used in the TWI transfer */
#define TWI_ADDRESS_ADDRESS_Pos    ( 0UL )                               /*!< Position of ADDRESS field. */
#define TWI_ADDRESS_ADDRESS_Msk    ( 0x7FUL << TWI_ADDRESS_ADDRESS_Pos ) /*!< Bit mask of ADDRESS field. */


/* Peripheral: TWIM */
/* Description: I2C compatible Two-Wire Master Interface with EasyDMA 0 */

/* Register: TWIM_TASKS_STARTRX */
/* Description: Start TWI receive sequence */

/* Bit 0 : Start TWI receive sequence */
#define TWIM_TASKS_STARTRX_TASKS_STARTRX_Pos        ( 0UL )                                           /*!< Position of TASKS_STARTRX field. */
#define TWIM_TASKS_STARTRX_TASKS_STARTRX_Msk        ( 0x1UL << TWIM_TASKS_STARTRX_TASKS_STARTRX_Pos ) /*!< Bit mask of TASKS_STARTRX field. */
#define TWIM_TASKS_STARTRX_TASKS_STARTRX_Trigger    ( 1UL )                                           /*!< Trigger task */

/* Register: TWIM_TASKS_STARTTX */
/* Description: Start TWI transmit sequence */

/* Bit 0 : Start TWI transmit sequence */
#define TWIM_TASKS_STARTTX_TASKS_STARTTX_Pos        ( 0UL )                                           /*!< Position of TASKS_STARTTX field. */
#define TWIM_TASKS_STARTTX_TASKS_STARTTX_Msk        ( 0x1UL << TWIM_TASKS_STARTTX_TASKS_STARTTX_Pos ) /*!< Bit mask of TASKS_STARTTX field. */
#define TWIM_TASKS_STARTTX_TASKS_STARTTX_Trigger    ( 1UL )                                           /*!< Trigger task */

/* Register: TWIM_TASKS_STOP */
/* Description: Stop TWI transaction. Must be issued while the TWI master is not suspended. */

/* Bit 0 : Stop TWI transaction. Must be issued while the TWI master is not suspended. */
#define TWIM_TASKS_STOP_TASKS_STOP_Pos        ( 0UL )                                     /*!< Position of TASKS_STOP field. */
#define TWIM_TASKS_STOP_TASKS_STOP_Msk        ( 0x1UL << TWIM_TASKS_STOP_TASKS_STOP_Pos ) /*!< Bit mask of TASKS_STOP field. */
#define TWIM_TASKS_STOP_TASKS_STOP_Trigger    ( 1UL )                                     /*!< Trigger task */

