FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Register: TWIM_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 12 : Shortcut between event LASTRX and task STOP */
#define TWIM_SHORTS_LASTRX_STOP_Pos            ( 12UL )                                 /*!< Position of LASTRX_STOP field. */
#define TWIM_SHORTS_LASTRX_STOP_Msk            ( 0x1UL << TWIM_SHORTS_LASTRX_STOP_Pos ) /*!< Bit mask of LASTRX_STOP field. */
#define TWIM_SHORTS_LASTRX_STOP_Disabled       ( 0UL )                                  /*!< Disable shortcut */
#define TWIM_SHORTS_LASTRX_STOP_Enabled        ( 1UL )                                  /*!< Enable shortcut */

/* Bit 11 : Shortcut between event LASTRX and task SUSPEND */
#define TWIM_SHORTS_LASTRX_SUSPEND_Pos         ( 11UL )                                    /*!< Position of LASTRX_SUSPEND field. */
#define TWIM_SHORTS_LASTRX_SUSPEND_Msk         ( 0x1UL << TWIM_SHORTS_LASTRX_SUSPEND_Pos ) /*!< Bit mask of LASTRX_SUSPEND field. */
#define TWIM_SHORTS_LASTRX_SUSPEND_Disabled    ( 0UL )                                     /*!< Disable shortcut */
#define TWIM_SHORTS_LASTRX_SUSPEND_Enabled     ( 1UL )                                     /*!< Enable shortcut */

/* Bit 10 : Shortcut between event LASTRX and task STARTTX */
#define TWIM_SHORTS_LASTRX_STARTTX_Pos         ( 10UL )                                    /*!< Position of LASTRX_STARTTX field. */
#define TWIM_SHORTS_LASTRX_STARTTX_Msk         ( 0x1UL << TWIM_SHORTS_LASTRX_STARTTX_Pos ) /*!< Bit mask of LASTRX_STARTTX field. */
#define TWIM_SHORTS_LASTRX_STARTTX_Disabled    ( 0UL )                                     /*!< Disable shortcut */
#define TWIM_SHORTS_LASTRX_STARTTX_Enabled     ( 1UL )                                     /*!< Enable shortcut */

/* Bit 9 : Shortcut between event LASTTX and task STOP */
#define TWIM_SHORTS_LASTTX_STOP_Pos            ( 9UL )                                  /*!< Position of LASTTX_STOP field. */
#define TWIM_SHORTS_LASTTX_STOP_Msk            ( 0x1UL << TWIM_SHORTS_LASTTX_STOP_Pos ) /*!< Bit mask of LASTTX_STOP field. */
#define TWIM_SHORTS_LASTTX_STOP_Disabled       ( 0UL )                                  /*!< Disable shortcut */
#define TWIM_SHORTS_LASTTX_STOP_Enabled        ( 1UL )                                  /*!< Enable shortcut */

/* Bit 8 : Shortcut between event LASTTX and task SUSPEND */
#define TWIM_SHORTS_LASTTX_SUSPEND_Pos         ( 8UL )                                     /*!< Position of LASTTX_SUSPEND field. */
#define TWIM_SHORTS_LASTTX_SUSPEND_Msk         ( 0x1UL << TWIM_SHORTS_LASTTX_SUSPEND_Pos ) /*!< Bit mask of LASTTX_SUSPEND field. */
#define TWIM_SHORTS_LASTTX_SUSPEND_Disabled    ( 0UL )                                     /*!< Disable shortcut */
#define TWIM_SHORTS_LASTTX_SUSPEND_Enabled     ( 1UL )                                     /*!< Enable shortcut */

/* Bit 7 : Shortcut between event LASTTX and task STARTRX */
#define TWIM_SHORTS_LASTTX_STARTRX_Pos         ( 7UL )                                     /*!< Position of LASTTX_STARTRX field. */
#define TWIM_SHORTS_LASTTX_STARTRX_Msk         ( 0x1UL << TWIM_SHORTS_LASTTX_STARTRX_Pos ) /*!< Bit mask of LASTTX_STARTRX field. */
#define TWIM_SHORTS_LASTTX_STARTRX_Disabled    ( 0UL )                                     /*!< Disable shortcut */
#define TWIM_SHORTS_LASTTX_STARTRX_Enabled     ( 1UL )                                     /*!< Enable shortcut */

/* Register: TWIM_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 24 : Enable or disable interrupt for event LASTTX */
#define TWIM_INTEN_LASTTX_Pos            ( 24UL )                           /*!< Position of LASTTX field. */
#define TWIM_INTEN_LASTTX_Msk            ( 0x1UL << TWIM_INTEN_LASTTX_Pos ) /*!< Bit mask of LASTTX field. */
#define TWIM_INTEN_LASTTX_Disabled       ( 0UL )                            /*!< Disable */
#define TWIM_INTEN_LASTTX_Enabled        ( 1UL )                            /*!< Enable */

/* Bit 23 : Enable or disable interrupt for event LASTRX */
#define TWIM_INTEN_LASTRX_Pos            ( 23UL )                           /*!< Position of LASTRX field. */
#define TWIM_INTEN_LASTRX_Msk            ( 0x1UL << TWIM_INTEN_LASTRX_Pos ) /*!< Bit mask of LASTRX field. */
#define TWIM_INTEN_LASTRX_Disabled       ( 0UL )                            /*!< Disable */
#define TWIM_INTEN_LASTRX_Enabled        ( 1UL )                            /*!< Enable */

/* Bit 20 : Enable or disable interrupt for event TXSTARTED */
#define TWIM_INTEN_TXSTARTED_Pos         ( 20UL )                              /*!< Position of TXSTARTED field. */
#define TWIM_INTEN_TXSTARTED_Msk         ( 0x1UL << TWIM_INTEN_TXSTARTED_Pos ) /*!< Bit mask of TXSTARTED field. */
#define TWIM_INTEN_TXSTARTED_Disabled    ( 0UL )                               /*!< Disable */
#define TWIM_INTEN_TXSTARTED_Enabled     ( 1UL )                               /*!< Enable */

/* Bit 19 : Enable or disable interrupt for event RXSTARTED */
#define TWIM_INTEN_RXSTARTED_Pos         ( 19UL )                              /*!< Position of RXSTARTED field. */
#define TWIM_INTEN_RXSTARTED_Msk         ( 0x1UL << TWIM_INTEN_RXSTARTED_Pos ) /*!< Bit mask of RXSTARTED field. */
#define TWIM_INTEN_RXSTARTED_Disabled    ( 0UL )                               /*!< Disable */
#define TWIM_INTEN_RXSTARTED_Enabled     ( 1UL )                               /*!< Enable */

/* Bit 18 : Enable or disable interrupt for event SUSPENDED */
#define TWIM_INTEN_SUSPENDED_Pos         ( 18UL )                              /*!< Position of SUSPENDED field. */
#define TWIM_INTEN_SUSPENDED_Msk         ( 0x1UL << TWIM_INTEN_SUSPENDED_Pos ) /*!< Bit mask of SUSPENDED field. */
#define TWIM_INTEN_SUSPENDED_Disabled    ( 0UL )                               /*!< Disable */
#define TWIM_INTEN_SUSPENDED_Enabled     ( 1UL )                               /*!< Enable */

/* Bit 9 : Enable or disable interrupt for event ERROR */
#define TWIM_INTEN_ERROR_Pos             ( 9UL )                           /*!< Position of ERROR field. */
#define TWIM_INTEN_ERROR_Msk             ( 0x1UL << TWIM_INTEN_ERROR_Pos ) /*!< Bit mask of ERROR field. */
#define TWIM_INTEN_ERROR_Disabled        ( 0UL )                           /*!< Disable */
#define TWIM_INTEN_ERROR_Enabled         ( 1UL )                           /*!< Enable */

