FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bit 1 : Write '1' to disable interrupt for event STOPPED */
#define TWIS_INTENCLR_STOPPED_Pos           ( 1UL )                                /*!< Position of STOPPED field. */
#define TWIS_INTENCLR_STOPPED_Msk           ( 0x1UL << TWIS_INTENCLR_STOPPED_Pos ) /*!< Bit mask of STOPPED field. */
#define TWIS_INTENCLR_STOPPED_Disabled      ( 0UL )                                /*!< Read: Disabled */
#define TWIS_INTENCLR_STOPPED_Enabled       ( 1UL )                                /*!< Read: Enabled */
#define TWIS_INTENCLR_STOPPED_Clear         ( 1UL )                                /*!< Disable */

/* Register: TWIS_ERRORSRC */
/* Description: Error source */

/* Bit 3 : TX buffer over-read detected, and prevented */
#define TWIS_ERRORSRC_OVERREAD_Pos            ( 3UL )                                 /*!< Position of OVERREAD field. */
#define TWIS_ERRORSRC_OVERREAD_Msk            ( 0x1UL << TWIS_ERRORSRC_OVERREAD_Pos ) /*!< Bit mask of OVERREAD field. */
#define TWIS_ERRORSRC_OVERREAD_NotDetected    ( 0UL )                                 /*!< Error did not occur */
#define TWIS_ERRORSRC_OVERREAD_Detected       ( 1UL )                                 /*!< Error occurred */

/* Bit 2 : NACK sent after receiving a data byte */
#define TWIS_ERRORSRC_DNACK_Pos               ( 2UL )                              /*!< Position of DNACK field. */
#define TWIS_ERRORSRC_DNACK_Msk               ( 0x1UL << TWIS_ERRORSRC_DNACK_Pos ) /*!< Bit mask of DNACK field. */
#define TWIS_ERRORSRC_DNACK_NotReceived       ( 0UL )                              /*!< Error did not occur */
#define TWIS_ERRORSRC_DNACK_Received          ( 1UL )                              /*!< Error occurred */

/* Bit 0 : RX buffer overflow detected, and prevented */
#define TWIS_ERRORSRC_OVERFLOW_Pos            ( 0UL )                                 /*!< Position of OVERFLOW field. */
#define TWIS_ERRORSRC_OVERFLOW_Msk            ( 0x1UL << TWIS_ERRORSRC_OVERFLOW_Pos ) /*!< Bit mask of OVERFLOW field. */
#define TWIS_ERRORSRC_OVERFLOW_NotDetected    ( 0UL )                                 /*!< Error did not occur */
#define TWIS_ERRORSRC_OVERFLOW_Detected       ( 1UL )                                 /*!< Error occurred */

/* Register: TWIS_MATCH */
/* Description: Status register indicating which address had a match */

/* Bit 0 : Indication of which address in {ADDRESS} that matched the incoming address */
#define TWIS_MATCH_MATCH_Pos    ( 0UL )                           /*!< Position of MATCH field. */
#define TWIS_MATCH_MATCH_Msk    ( 0x1UL << TWIS_MATCH_MATCH_Pos ) /*!< Bit mask of MATCH field. */

/* Register: TWIS_ENABLE */
/* Description: Enable TWIS */

/* Bits 3..0 : Enable or disable TWIS */
#define TWIS_ENABLE_ENABLE_Pos         ( 0UL )                             /*!< Position of ENABLE field. */
#define TWIS_ENABLE_ENABLE_Msk         ( 0xFUL << TWIS_ENABLE_ENABLE_Pos ) /*!< Bit mask of ENABLE field. */
#define TWIS_ENABLE_ENABLE_Disabled    ( 0UL )                             /*!< Disable TWIS */
#define TWIS_ENABLE_ENABLE_Enabled     ( 9UL )                             /*!< Enable TWIS */

/* Register: TWIS_PSEL_SCL */
/* Description: Pin select for SCL signal */

/* Bit 31 : Connection */
#define TWIS_PSEL_SCL_CONNECT_Pos             ( 31UL )                               /*!< Position of CONNECT field. */
#define TWIS_PSEL_SCL_CONNECT_Msk             ( 0x1UL << TWIS_PSEL_SCL_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define TWIS_PSEL_SCL_CONNECT_Connected       ( 0UL )                                /*!< Connect */
#define TWIS_PSEL_SCL_CONNECT_Disconnected    ( 1UL )                                /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define TWIS_PSEL_SCL_PIN_Pos                 ( 0UL )                             /*!< Position of PIN field. */
#define TWIS_PSEL_SCL_PIN_Msk                 ( 0x1FUL << TWIS_PSEL_SCL_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: TWIS_PSEL_SDA */
/* Description: Pin select for SDA signal */

/* Bit 31 : Connection */
#define TWIS_PSEL_SDA_CONNECT_Pos             ( 31UL )                               /*!< Position of CONNECT field. */
#define TWIS_PSEL_SDA_CONNECT_Msk             ( 0x1UL << TWIS_PSEL_SDA_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define TWIS_PSEL_SDA_CONNECT_Connected       ( 0UL )                                /*!< Connect */
#define TWIS_PSEL_SDA_CONNECT_Disconnected    ( 1UL )                                /*!< Disconnect */

/* Bits 4..0 : Pin number */
#define TWIS_PSEL_SDA_PIN_Pos                 ( 0UL )                             /*!< Position of PIN field. */
#define TWIS_PSEL_SDA_PIN_Msk                 ( 0x1FUL << TWIS_PSEL_SDA_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: TWIS_RXD_PTR */
/* Description: RXD Data pointer */

/* Bits 31..0 : RXD Data pointer */
#define TWIS_RXD_PTR_PTR_Pos    ( 0UL )                                  /*!< Position of PTR field. */
#define TWIS_RXD_PTR_PTR_Msk    ( 0xFFFFFFFFUL << TWIS_RXD_PTR_PTR_Pos ) /*!< Bit mask of PTR field. */

/* Register: TWIS_RXD_MAXCNT */
/* Description: Maximum number of bytes in RXD buffer */

/* Bits 14..0 : Maximum number of bytes in RXD buffer */
#define TWIS_RXD_MAXCNT_MAXCNT_Pos    ( 0UL )                                    /*!< Position of MAXCNT field. */
#define TWIS_RXD_MAXCNT_MAXCNT_Msk    ( 0x7FFFUL << TWIS_RXD_MAXCNT_MAXCNT_Pos ) /*!< Bit mask of MAXCNT field. */

/* Register: TWIS_RXD_AMOUNT */
/* Description: Number of bytes transferred in the last RXD transaction */

/* Bits 14..0 : Number of bytes transferred in the last RXD transaction */
#define TWIS_RXD_AMOUNT_AMOUNT_Pos    ( 0UL )                                    /*!< Position of AMOUNT field. */
#define TWIS_RXD_AMOUNT_AMOUNT_Msk    ( 0x7FFFUL << TWIS_RXD_AMOUNT_AMOUNT_Pos ) /*!< Bit mask of AMOUNT field. */

/* Register: TWIS_RXD_LIST */
/* Description: EasyDMA list type */

/* Bits 1..0 : List type */
#define TWIS_RXD_LIST_LIST_Pos          ( 0UL )                             /*!< Position of LIST field. */
#define TWIS_RXD_LIST_LIST_Msk          ( 0x3UL << TWIS_RXD_LIST_LIST_Pos ) /*!< Bit mask of LIST field. */
#define TWIS_RXD_LIST_LIST_Disabled     ( 0UL )                             /*!< Disable EasyDMA list */
#define TWIS_RXD_LIST_LIST_ArrayList    ( 1UL )                             /*!< Use array list */

/* Register: TWIS_TXD_PTR */
/* Description: TXD Data pointer */

