FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bit 0 : CTS is activated (set low). Clear To Send. */
#define UART_EVENTS_CTS_EVENTS_CTS_Pos             ( 0UL )                                     /*!< Position of EVENTS_CTS field. */
#define UART_EVENTS_CTS_EVENTS_CTS_Msk             ( 0x1UL << UART_EVENTS_CTS_EVENTS_CTS_Pos ) /*!< Bit mask of EVENTS_CTS field. */
#define UART_EVENTS_CTS_EVENTS_CTS_NotGenerated    ( 0UL )                                     /*!< Event not generated */
#define UART_EVENTS_CTS_EVENTS_CTS_Generated       ( 1UL )                                     /*!< Event generated */

/* Register: UART_EVENTS_NCTS */
/* Description: CTS is deactivated (set high). Not Clear To Send. */

/* Bit 0 : CTS is deactivated (set high). Not Clear To Send. */
#define UART_EVENTS_NCTS_EVENTS_NCTS_Pos             ( 0UL )                                       /*!< Position of EVENTS_NCTS field. */
#define UART_EVENTS_NCTS_EVENTS_NCTS_Msk             ( 0x1UL << UART_EVENTS_NCTS_EVENTS_NCTS_Pos ) /*!< Bit mask of EVENTS_NCTS field. */
#define UART_EVENTS_NCTS_EVENTS_NCTS_NotGenerated    ( 0UL )                                       /*!< Event not generated */
#define UART_EVENTS_NCTS_EVENTS_NCTS_Generated       ( 1UL )                                       /*!< Event generated */

/* Register: UART_EVENTS_RXDRDY */
/* Description: Data received in RXD */

/* Bit 0 : Data received in RXD */
#define UART_EVENTS_RXDRDY_EVENTS_RXDRDY_Pos             ( 0UL )                                           /*!< Position of EVENTS_RXDRDY field. */
#define UART_EVENTS_RXDRDY_EVENTS_RXDRDY_Msk             ( 0x1UL << UART_EVENTS_RXDRDY_EVENTS_RXDRDY_Pos ) /*!< Bit mask of EVENTS_RXDRDY field. */
#define UART_EVENTS_RXDRDY_EVENTS_RXDRDY_NotGenerated    ( 0UL )                                           /*!< Event not generated */
#define UART_EVENTS_RXDRDY_EVENTS_RXDRDY_Generated       ( 1UL )                                           /*!< Event generated */

/* Register: UART_EVENTS_TXDRDY */
/* Description: Data sent from TXD */

/* Bit 0 : Data sent from TXD */
#define UART_EVENTS_TXDRDY_EVENTS_TXDRDY_Pos             ( 0UL )                                           /*!< Position of EVENTS_TXDRDY field. */
#define UART_EVENTS_TXDRDY_EVENTS_TXDRDY_Msk             ( 0x1UL << UART_EVENTS_TXDRDY_EVENTS_TXDRDY_Pos ) /*!< Bit mask of EVENTS_TXDRDY field. */
#define UART_EVENTS_TXDRDY_EVENTS_TXDRDY_NotGenerated    ( 0UL )                                           /*!< Event not generated */
#define UART_EVENTS_TXDRDY_EVENTS_TXDRDY_Generated       ( 1UL )                                           /*!< Event generated */

/* Register: UART_EVENTS_ERROR */
/* Description: Error detected */

/* Bit 0 : Error detected */
#define UART_EVENTS_ERROR_EVENTS_ERROR_Pos             ( 0UL )                                         /*!< Position of EVENTS_ERROR field. */
#define UART_EVENTS_ERROR_EVENTS_ERROR_Msk             ( 0x1UL << UART_EVENTS_ERROR_EVENTS_ERROR_Pos ) /*!< Bit mask of EVENTS_ERROR field. */
#define UART_EVENTS_ERROR_EVENTS_ERROR_NotGenerated    ( 0UL )                                         /*!< Event not generated */
#define UART_EVENTS_ERROR_EVENTS_ERROR_Generated       ( 1UL )                                         /*!< Event generated */

/* Register: UART_EVENTS_RXTO */
/* Description: Receiver timeout */

/* Bit 0 : Receiver timeout */
#define UART_EVENTS_RXTO_EVENTS_RXTO_Pos             ( 0UL )                                       /*!< Position of EVENTS_RXTO field. */
#define UART_EVENTS_RXTO_EVENTS_RXTO_Msk             ( 0x1UL << UART_EVENTS_RXTO_EVENTS_RXTO_Pos ) /*!< Bit mask of EVENTS_RXTO field. */
#define UART_EVENTS_RXTO_EVENTS_RXTO_NotGenerated    ( 0UL )                                       /*!< Event not generated */
#define UART_EVENTS_RXTO_EVENTS_RXTO_Generated       ( 1UL )                                       /*!< Event generated */

/* Register: UART_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 4 : Shortcut between event NCTS and task STOPRX */
#define UART_SHORTS_NCTS_STOPRX_Pos         ( 4UL )                                  /*!< Position of NCTS_STOPRX field. */
#define UART_SHORTS_NCTS_STOPRX_Msk         ( 0x1UL << UART_SHORTS_NCTS_STOPRX_Pos ) /*!< Bit mask of NCTS_STOPRX field. */
#define UART_SHORTS_NCTS_STOPRX_Disabled    ( 0UL )                                  /*!< Disable shortcut */
#define UART_SHORTS_NCTS_STOPRX_Enabled     ( 1UL )                                  /*!< Enable shortcut */

/* Bit 3 : Shortcut between event CTS and task STARTRX */
#define UART_SHORTS_CTS_STARTRX_Pos         ( 3UL )                                  /*!< Position of CTS_STARTRX field. */
#define UART_SHORTS_CTS_STARTRX_Msk         ( 0x1UL << UART_SHORTS_CTS_STARTRX_Pos ) /*!< Bit mask of CTS_STARTRX field. */
#define UART_SHORTS_CTS_STARTRX_Disabled    ( 0UL )                                  /*!< Disable shortcut */
#define UART_SHORTS_CTS_STARTRX_Enabled     ( 1UL )                                  /*!< Enable shortcut */

/* Register: UART_INTENSET */
/* Description: Enable interrupt */

/* Bit 17 : Write '1' to enable interrupt for event RXTO */
#define UART_INTENSET_RXTO_Pos           ( 17UL )                            /*!< Position of RXTO field. */
#define UART_INTENSET_RXTO_Msk           ( 0x1UL << UART_INTENSET_RXTO_Pos ) /*!< Bit mask of RXTO field. */
#define UART_INTENSET_RXTO_Disabled      ( 0UL )                             /*!< Read: Disabled */
#define UART_INTENSET_RXTO_Enabled       ( 1UL )                             /*!< Read: Enabled */
#define UART_INTENSET_RXTO_Set           ( 1UL )                             /*!< Enable */

/* Bit 9 : Write '1' to enable interrupt for event ERROR */
#define UART_INTENSET_ERROR_Pos          ( 9UL )                              /*!< Position of ERROR field. */
#define UART_INTENSET_ERROR_Msk          ( 0x1UL << UART_INTENSET_ERROR_Pos ) /*!< Bit mask of ERROR field. */
#define UART_INTENSET_ERROR_Disabled     ( 0UL )                              /*!< Read: Disabled */
#define UART_INTENSET_ERROR_Enabled      ( 1UL )                              /*!< Read: Enabled */
#define UART_INTENSET_ERROR_Set          ( 1UL )                              /*!< Enable */

/* Bit 7 : Write '1' to enable interrupt for event TXDRDY */
#define UART_INTENSET_TXDRDY_Pos         ( 7UL )                               /*!< Position of TXDRDY field. */
#define UART_INTENSET_TXDRDY_Msk         ( 0x1UL << UART_INTENSET_TXDRDY_Pos ) /*!< Bit mask of TXDRDY field. */
#define UART_INTENSET_TXDRDY_Disabled    ( 0UL )                               /*!< Read: Disabled */
#define UART_INTENSET_TXDRDY_Enabled     ( 1UL )                               /*!< Read: Enabled */
#define UART_INTENSET_TXDRDY_Set         ( 1UL )                               /*!< Enable */

/* Bit 2 : Write '1' to enable interrupt for event RXDRDY */
#define UART_INTENSET_RXDRDY_Pos         ( 2UL )                               /*!< Position of RXDRDY field. */
#define UART_INTENSET_RXDRDY_Msk         ( 0x1UL << UART_INTENSET_RXDRDY_Pos ) /*!< Bit mask of RXDRDY field. */
#define UART_INTENSET_RXDRDY_Disabled    ( 0UL )                               /*!< Read: Disabled */
#define UART_INTENSET_RXDRDY_Enabled     ( 1UL )                               /*!< Read: Enabled */
#define UART_INTENSET_RXDRDY_Set         ( 1UL )                               /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event NCTS */
#define UART_INTENSET_NCTS_Pos           ( 1UL )                             /*!< Position of NCTS field. */
#define UART_INTENSET_NCTS_Msk           ( 0x1UL << UART_INTENSET_NCTS_Pos ) /*!< Bit mask of NCTS field. */
#define UART_INTENSET_NCTS_Disabled      ( 0UL )                             /*!< Read: Disabled */
#define UART_INTENSET_NCTS_Enabled       ( 1UL )                             /*!< Read: Enabled */
#define UART_INTENSET_NCTS_Set           ( 1UL )                             /*!< Enable */

