FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bit 0 : Write '1' to enable interrupt for event CTS */
#define UART_INTENSET_CTS_Pos            ( 0UL )                            /*!< Position of CTS field. */
#define UART_INTENSET_CTS_Msk            ( 0x1UL << UART_INTENSET_CTS_Pos ) /*!< Bit mask of CTS field. */
#define UART_INTENSET_CTS_Disabled       ( 0UL )                            /*!< Read: Disabled */
#define UART_INTENSET_CTS_Enabled        ( 1UL )                            /*!< Read: Enabled */
#define UART_INTENSET_CTS_Set            ( 1UL )                            /*!< Enable */

/* Register: UART_INTENCLR */
/* Description: Disable interrupt */

/* Bit 17 : Write '1' to disable interrupt for event RXTO */
#define UART_INTENCLR_RXTO_Pos           ( 17UL )                            /*!< Position of RXTO field. */
#define UART_INTENCLR_RXTO_Msk           ( 0x1UL << UART_INTENCLR_RXTO_Pos ) /*!< Bit mask of RXTO field. */
#define UART_INTENCLR_RXTO_Disabled      ( 0UL )                             /*!< Read: Disabled */
#define UART_INTENCLR_RXTO_Enabled       ( 1UL )                             /*!< Read: Enabled */
#define UART_INTENCLR_RXTO_Clear         ( 1UL )                             /*!< Disable */

/* Bit 9 : Write '1' to disable interrupt for event ERROR */
#define UART_INTENCLR_ERROR_Pos          ( 9UL )                              /*!< Position of ERROR field. */
#define UART_INTENCLR_ERROR_Msk          ( 0x1UL << UART_INTENCLR_ERROR_Pos ) /*!< Bit mask of ERROR field. */
#define UART_INTENCLR_ERROR_Disabled     ( 0UL )                              /*!< Read: Disabled */
#define UART_INTENCLR_ERROR_Enabled      ( 1UL )                              /*!< Read: Enabled */
#define UART_INTENCLR_ERROR_Clear        ( 1UL )                              /*!< Disable */

/* Bit 7 : Write '1' to disable interrupt for event TXDRDY */
#define UART_INTENCLR_TXDRDY_Pos         ( 7UL )                               /*!< Position of TXDRDY field. */
#define UART_INTENCLR_TXDRDY_Msk         ( 0x1UL << UART_INTENCLR_TXDRDY_Pos ) /*!< Bit mask of TXDRDY field. */
#define UART_INTENCLR_TXDRDY_Disabled    ( 0UL )                               /*!< Read: Disabled */
#define UART_INTENCLR_TXDRDY_Enabled     ( 1UL )                               /*!< Read: Enabled */
#define UART_INTENCLR_TXDRDY_Clear       ( 1UL )                               /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event RXDRDY */
#define UART_INTENCLR_RXDRDY_Pos         ( 2UL )                               /*!< Position of RXDRDY field. */
#define UART_INTENCLR_RXDRDY_Msk         ( 0x1UL << UART_INTENCLR_RXDRDY_Pos ) /*!< Bit mask of RXDRDY field. */
#define UART_INTENCLR_RXDRDY_Disabled    ( 0UL )                               /*!< Read: Disabled */
#define UART_INTENCLR_RXDRDY_Enabled     ( 1UL )                               /*!< Read: Enabled */
#define UART_INTENCLR_RXDRDY_Clear       ( 1UL )                               /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event NCTS */
#define UART_INTENCLR_NCTS_Pos           ( 1UL )                             /*!< Position of NCTS field. */
#define UART_INTENCLR_NCTS_Msk           ( 0x1UL << UART_INTENCLR_NCTS_Pos ) /*!< Bit mask of NCTS field. */
#define UART_INTENCLR_NCTS_Disabled      ( 0UL )                             /*!< Read: Disabled */
#define UART_INTENCLR_NCTS_Enabled       ( 1UL )                             /*!< Read: Enabled */
#define UART_INTENCLR_NCTS_Clear         ( 1UL )                             /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event CTS */
#define UART_INTENCLR_CTS_Pos            ( 0UL )                            /*!< Position of CTS field. */
#define UART_INTENCLR_CTS_Msk            ( 0x1UL << UART_INTENCLR_CTS_Pos ) /*!< Bit mask of CTS field. */
#define UART_INTENCLR_CTS_Disabled       ( 0UL )                            /*!< Read: Disabled */
#define UART_INTENCLR_CTS_Enabled        ( 1UL )                            /*!< Read: Enabled */
#define UART_INTENCLR_CTS_Clear          ( 1UL )                            /*!< Disable */

/* Register: UART_ERRORSRC */
/* Description: Error source */

/* Bit 3 : Break condition */
#define UART_ERRORSRC_BREAK_Pos             ( 3UL )                              /*!< Position of BREAK field. */
#define UART_ERRORSRC_BREAK_Msk             ( 0x1UL << UART_ERRORSRC_BREAK_Pos ) /*!< Bit mask of BREAK field. */
#define UART_ERRORSRC_BREAK_NotPresent      ( 0UL )                              /*!< Read: error not present */
#define UART_ERRORSRC_BREAK_Present         ( 1UL )                              /*!< Read: error present */

/* Bit 2 : Framing error occurred */
#define UART_ERRORSRC_FRAMING_Pos           ( 2UL )                                /*!< Position of FRAMING field. */
#define UART_ERRORSRC_FRAMING_Msk           ( 0x1UL << UART_ERRORSRC_FRAMING_Pos ) /*!< Bit mask of FRAMING field. */
#define UART_ERRORSRC_FRAMING_NotPresent    ( 0UL )                                /*!< Read: error not present */
#define UART_ERRORSRC_FRAMING_Present       ( 1UL )                                /*!< Read: error present */

/* Bit 1 : Parity error */
#define UART_ERRORSRC_PARITY_Pos            ( 1UL )                               /*!< Position of PARITY field. */
#define UART_ERRORSRC_PARITY_Msk            ( 0x1UL << UART_ERRORSRC_PARITY_Pos ) /*!< Bit mask of PARITY field. */
#define UART_ERRORSRC_PARITY_NotPresent     ( 0UL )                               /*!< Read: error not present */
#define UART_ERRORSRC_PARITY_Present        ( 1UL )                               /*!< Read: error present */

/* Bit 0 : Overrun error */
#define UART_ERRORSRC_OVERRUN_Pos           ( 0UL )                                /*!< Position of OVERRUN field. */
#define UART_ERRORSRC_OVERRUN_Msk           ( 0x1UL << UART_ERRORSRC_OVERRUN_Pos ) /*!< Bit mask of OVERRUN field. */
#define UART_ERRORSRC_OVERRUN_NotPresent    ( 0UL )                                /*!< Read: error not present */
#define UART_ERRORSRC_OVERRUN_Present       ( 1UL )                                /*!< Read: error present */

/* Register: UART_ENABLE */
/* Description: Enable UART */

