FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bit 8 : Enable or disable interrupt for event ENDTX */
#define UARTE_INTEN_ENDTX_Pos             ( 8UL )                            /*!< Position of ENDTX field. */
#define UARTE_INTEN_ENDTX_Msk             ( 0x1UL << UARTE_INTEN_ENDTX_Pos ) /*!< Bit mask of ENDTX field. */
#define UARTE_INTEN_ENDTX_Disabled        ( 0UL )                            /*!< Disable */
#define UARTE_INTEN_ENDTX_Enabled         ( 1UL )                            /*!< Enable */

/* Bit 7 : Enable or disable interrupt for event TXDRDY */
#define UARTE_INTEN_TXDRDY_Pos            ( 7UL )                             /*!< Position of TXDRDY field. */
#define UARTE_INTEN_TXDRDY_Msk            ( 0x1UL << UARTE_INTEN_TXDRDY_Pos ) /*!< Bit mask of TXDRDY field. */
#define UARTE_INTEN_TXDRDY_Disabled       ( 0UL )                             /*!< Disable */
#define UARTE_INTEN_TXDRDY_Enabled        ( 1UL )                             /*!< Enable */

/* Bit 4 : Enable or disable interrupt for event ENDRX */
#define UARTE_INTEN_ENDRX_Pos             ( 4UL )                            /*!< Position of ENDRX field. */
#define UARTE_INTEN_ENDRX_Msk             ( 0x1UL << UARTE_INTEN_ENDRX_Pos ) /*!< Bit mask of ENDRX field. */
#define UARTE_INTEN_ENDRX_Disabled        ( 0UL )                            /*!< Disable */
#define UARTE_INTEN_ENDRX_Enabled         ( 1UL )                            /*!< Enable */

/* Bit 2 : Enable or disable interrupt for event RXDRDY */
#define UARTE_INTEN_RXDRDY_Pos            ( 2UL )                             /*!< Position of RXDRDY field. */
#define UARTE_INTEN_RXDRDY_Msk            ( 0x1UL << UARTE_INTEN_RXDRDY_Pos ) /*!< Bit mask of RXDRDY field. */
#define UARTE_INTEN_RXDRDY_Disabled       ( 0UL )                             /*!< Disable */
#define UARTE_INTEN_RXDRDY_Enabled        ( 1UL )                             /*!< Enable */

/* Bit 1 : Enable or disable interrupt for event NCTS */
#define UARTE_INTEN_NCTS_Pos              ( 1UL )                           /*!< Position of NCTS field. */
#define UARTE_INTEN_NCTS_Msk              ( 0x1UL << UARTE_INTEN_NCTS_Pos ) /*!< Bit mask of NCTS field. */
#define UARTE_INTEN_NCTS_Disabled         ( 0UL )                           /*!< Disable */
#define UARTE_INTEN_NCTS_Enabled          ( 1UL )                           /*!< Enable */

/* Bit 0 : Enable or disable interrupt for event CTS */
#define UARTE_INTEN_CTS_Pos               ( 0UL )                          /*!< Position of CTS field. */
#define UARTE_INTEN_CTS_Msk               ( 0x1UL << UARTE_INTEN_CTS_Pos ) /*!< Bit mask of CTS field. */
#define UARTE_INTEN_CTS_Disabled          ( 0UL )                          /*!< Disable */
#define UARTE_INTEN_CTS_Enabled           ( 1UL )                          /*!< Enable */

/* Register: UARTE_INTENSET */
/* Description: Enable interrupt */

/* Bit 22 : Write '1' to enable interrupt for event TXSTOPPED */
#define UARTE_INTENSET_TXSTOPPED_Pos         ( 22UL )                                  /*!< Position of TXSTOPPED field. */
#define UARTE_INTENSET_TXSTOPPED_Msk         ( 0x1UL << UARTE_INTENSET_TXSTOPPED_Pos ) /*!< Bit mask of TXSTOPPED field. */
#define UARTE_INTENSET_TXSTOPPED_Disabled    ( 0UL )                                   /*!< Read: Disabled */
#define UARTE_INTENSET_TXSTOPPED_Enabled     ( 1UL )                                   /*!< Read: Enabled */
#define UARTE_INTENSET_TXSTOPPED_Set         ( 1UL )                                   /*!< Enable */

/* Bit 20 : Write '1' to enable interrupt for event TXSTARTED */
#define UARTE_INTENSET_TXSTARTED_Pos         ( 20UL )                                  /*!< Position of TXSTARTED field. */
#define UARTE_INTENSET_TXSTARTED_Msk         ( 0x1UL << UARTE_INTENSET_TXSTARTED_Pos ) /*!< Bit mask of TXSTARTED field. */
#define UARTE_INTENSET_TXSTARTED_Disabled    ( 0UL )                                   /*!< Read: Disabled */
#define UARTE_INTENSET_TXSTARTED_Enabled     ( 1UL )                                   /*!< Read: Enabled */
#define UARTE_INTENSET_TXSTARTED_Set         ( 1UL )                                   /*!< Enable */

/* Bit 19 : Write '1' to enable interrupt for event RXSTARTED */
#define UARTE_INTENSET_RXSTARTED_Pos         ( 19UL )                                  /*!< Position of RXSTARTED field. */
#define UARTE_INTENSET_RXSTARTED_Msk         ( 0x1UL << UARTE_INTENSET_RXSTARTED_Pos ) /*!< Bit mask of RXSTARTED field. */
#define UARTE_INTENSET_RXSTARTED_Disabled    ( 0UL )                                   /*!< Read: Disabled */
#define UARTE_INTENSET_RXSTARTED_Enabled     ( 1UL )                                   /*!< Read: Enabled */
#define UARTE_INTENSET_RXSTARTED_Set         ( 1UL )                                   /*!< Enable */

/* Bit 17 : Write '1' to enable interrupt for event RXTO */
#define UARTE_INTENSET_RXTO_Pos              ( 17UL )                             /*!< Position of RXTO field. */
#define UARTE_INTENSET_RXTO_Msk              ( 0x1UL << UARTE_INTENSET_RXTO_Pos ) /*!< Bit mask of RXTO field. */
#define UARTE_INTENSET_RXTO_Disabled         ( 0UL )                              /*!< Read: Disabled */
#define UARTE_INTENSET_RXTO_Enabled          ( 1UL )                              /*!< Read: Enabled */
#define UARTE_INTENSET_RXTO_Set              ( 1UL )                              /*!< Enable */

/* Bit 9 : Write '1' to enable interrupt for event ERROR */
#define UARTE_INTENSET_ERROR_Pos             ( 9UL )                               /*!< Position of ERROR field. */
#define UARTE_INTENSET_ERROR_Msk             ( 0x1UL << UARTE_INTENSET_ERROR_Pos ) /*!< Bit mask of ERROR field. */
#define UARTE_INTENSET_ERROR_Disabled        ( 0UL )                               /*!< Read: Disabled */
#define UARTE_INTENSET_ERROR_Enabled         ( 1UL )                               /*!< Read: Enabled */
#define UARTE_INTENSET_ERROR_Set             ( 1UL )                               /*!< Enable */

/* Bit 8 : Write '1' to enable interrupt for event ENDTX */
#define UARTE_INTENSET_ENDTX_Pos             ( 8UL )                               /*!< Position of ENDTX field. */
#define UARTE_INTENSET_ENDTX_Msk             ( 0x1UL << UARTE_INTENSET_ENDTX_Pos ) /*!< Bit mask of ENDTX field. */
#define UARTE_INTENSET_ENDTX_Disabled        ( 0UL )                               /*!< Read: Disabled */
#define UARTE_INTENSET_ENDTX_Enabled         ( 1UL )                               /*!< Read: Enabled */
#define UARTE_INTENSET_ENDTX_Set             ( 1UL )                               /*!< Enable */

/* Bit 7 : Write '1' to enable interrupt for event TXDRDY */
#define UARTE_INTENSET_TXDRDY_Pos            ( 7UL )                                /*!< Position of TXDRDY field. */
#define UARTE_INTENSET_TXDRDY_Msk            ( 0x1UL << UARTE_INTENSET_TXDRDY_Pos ) /*!< Bit mask of TXDRDY field. */
#define UARTE_INTENSET_TXDRDY_Disabled       ( 0UL )                                /*!< Read: Disabled */
#define UARTE_INTENSET_TXDRDY_Enabled        ( 1UL )                                /*!< Read: Enabled */
#define UARTE_INTENSET_TXDRDY_Set            ( 1UL )                                /*!< Enable */

/* Bit 4 : Write '1' to enable interrupt for event ENDRX */
#define UARTE_INTENSET_ENDRX_Pos             ( 4UL )                               /*!< Position of ENDRX field. */
#define UARTE_INTENSET_ENDRX_Msk             ( 0x1UL << UARTE_INTENSET_ENDRX_Pos ) /*!< Bit mask of ENDRX field. */
#define UARTE_INTENSET_ENDRX_Disabled        ( 0UL )                               /*!< Read: Disabled */
#define UARTE_INTENSET_ENDRX_Enabled         ( 1UL )                               /*!< Read: Enabled */
#define UARTE_INTENSET_ENDRX_Set             ( 1UL )                               /*!< Enable */

/* Bit 2 : Write '1' to enable interrupt for event RXDRDY */
#define UARTE_INTENSET_RXDRDY_Pos            ( 2UL )                                /*!< Position of RXDRDY field. */
#define UARTE_INTENSET_RXDRDY_Msk            ( 0x1UL << UARTE_INTENSET_RXDRDY_Pos ) /*!< Bit mask of RXDRDY field. */
#define UARTE_INTENSET_RXDRDY_Disabled       ( 0UL )                                /*!< Read: Disabled */
#define UARTE_INTENSET_RXDRDY_Enabled        ( 1UL )                                /*!< Read: Enabled */
#define UARTE_INTENSET_RXDRDY_Set            ( 1UL )                                /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event NCTS */
#define UARTE_INTENSET_NCTS_Pos              ( 1UL )                              /*!< Position of NCTS field. */
#define UARTE_INTENSET_NCTS_Msk              ( 0x1UL << UARTE_INTENSET_NCTS_Pos ) /*!< Bit mask of NCTS field. */
#define UARTE_INTENSET_NCTS_Disabled         ( 0UL )                              /*!< Read: Disabled */
#define UARTE_INTENSET_NCTS_Enabled          ( 1UL )                              /*!< Read: Enabled */
#define UARTE_INTENSET_NCTS_Set              ( 1UL )                              /*!< Enable */

