FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bit 0 : Write '1' to enable interrupt for event CTS */
#define UARTE_INTENSET_CTS_Pos               ( 0UL )                             /*!< Position of CTS field. */
#define UARTE_INTENSET_CTS_Msk               ( 0x1UL << UARTE_INTENSET_CTS_Pos ) /*!< Bit mask of CTS field. */
#define UARTE_INTENSET_CTS_Disabled          ( 0UL )                             /*!< Read: Disabled */
#define UARTE_INTENSET_CTS_Enabled           ( 1UL )                             /*!< Read: Enabled */
#define UARTE_INTENSET_CTS_Set               ( 1UL )                             /*!< Enable */

/* Register: UARTE_INTENCLR */
/* Description: Disable interrupt */

/* Bit 22 : Write '1' to disable interrupt for event TXSTOPPED */
#define UARTE_INTENCLR_TXSTOPPED_Pos         ( 22UL )                                  /*!< Position of TXSTOPPED field. */
#define UARTE_INTENCLR_TXSTOPPED_Msk         ( 0x1UL << UARTE_INTENCLR_TXSTOPPED_Pos ) /*!< Bit mask of TXSTOPPED field. */
#define UARTE_INTENCLR_TXSTOPPED_Disabled    ( 0UL )                                   /*!< Read: Disabled */
#define UARTE_INTENCLR_TXSTOPPED_Enabled     ( 1UL )                                   /*!< Read: Enabled */
#define UARTE_INTENCLR_TXSTOPPED_Clear       ( 1UL )                                   /*!< Disable */

/* Bit 20 : Write '1' to disable interrupt for event TXSTARTED */
#define UARTE_INTENCLR_TXSTARTED_Pos         ( 20UL )                                  /*!< Position of TXSTARTED field. */
#define UARTE_INTENCLR_TXSTARTED_Msk         ( 0x1UL << UARTE_INTENCLR_TXSTARTED_Pos ) /*!< Bit mask of TXSTARTED field. */
#define UARTE_INTENCLR_TXSTARTED_Disabled    ( 0UL )                                   /*!< Read: Disabled */
#define UARTE_INTENCLR_TXSTARTED_Enabled     ( 1UL )                                   /*!< Read: Enabled */
#define UARTE_INTENCLR_TXSTARTED_Clear       ( 1UL )                                   /*!< Disable */

/* Bit 19 : Write '1' to disable interrupt for event RXSTARTED */
#define UARTE_INTENCLR_RXSTARTED_Pos         ( 19UL )                                  /*!< Position of RXSTARTED field. */
#define UARTE_INTENCLR_RXSTARTED_Msk         ( 0x1UL << UARTE_INTENCLR_RXSTARTED_Pos ) /*!< Bit mask of RXSTARTED field. */
#define UARTE_INTENCLR_RXSTARTED_Disabled    ( 0UL )                                   /*!< Read: Disabled */
#define UARTE_INTENCLR_RXSTARTED_Enabled     ( 1UL )                                   /*!< Read: Enabled */
#define UARTE_INTENCLR_RXSTARTED_Clear       ( 1UL )                                   /*!< Disable */

/* Bit 17 : Write '1' to disable interrupt for event RXTO */
#define UARTE_INTENCLR_RXTO_Pos              ( 17UL )                             /*!< Position of RXTO field. */
#define UARTE_INTENCLR_RXTO_Msk              ( 0x1UL << UARTE_INTENCLR_RXTO_Pos ) /*!< Bit mask of RXTO field. */
#define UARTE_INTENCLR_RXTO_Disabled         ( 0UL )                              /*!< Read: Disabled */
#define UARTE_INTENCLR_RXTO_Enabled          ( 1UL )                              /*!< Read: Enabled */
#define UARTE_INTENCLR_RXTO_Clear            ( 1UL )                              /*!< Disable */

/* Bit 9 : Write '1' to disable interrupt for event ERROR */
#define UARTE_INTENCLR_ERROR_Pos             ( 9UL )                               /*!< Position of ERROR field. */
#define UARTE_INTENCLR_ERROR_Msk             ( 0x1UL << UARTE_INTENCLR_ERROR_Pos ) /*!< Bit mask of ERROR field. */
#define UARTE_INTENCLR_ERROR_Disabled        ( 0UL )                               /*!< Read: Disabled */
#define UARTE_INTENCLR_ERROR_Enabled         ( 1UL )                               /*!< Read: Enabled */
#define UARTE_INTENCLR_ERROR_Clear           ( 1UL )                               /*!< Disable */

/* Bit 8 : Write '1' to disable interrupt for event ENDTX */
#define UARTE_INTENCLR_ENDTX_Pos             ( 8UL )                               /*!< Position of ENDTX field. */
#define UARTE_INTENCLR_ENDTX_Msk             ( 0x1UL << UARTE_INTENCLR_ENDTX_Pos ) /*!< Bit mask of ENDTX field. */
#define UARTE_INTENCLR_ENDTX_Disabled        ( 0UL )                               /*!< Read: Disabled */
#define UARTE_INTENCLR_ENDTX_Enabled         ( 1UL )                               /*!< Read: Enabled */
#define UARTE_INTENCLR_ENDTX_Clear           ( 1UL )                               /*!< Disable */

/* Bit 7 : Write '1' to disable interrupt for event TXDRDY */
#define UARTE_INTENCLR_TXDRDY_Pos            ( 7UL )                                /*!< Position of TXDRDY field. */
#define UARTE_INTENCLR_TXDRDY_Msk            ( 0x1UL << UARTE_INTENCLR_TXDRDY_Pos ) /*!< Bit mask of TXDRDY field. */
#define UARTE_INTENCLR_TXDRDY_Disabled       ( 0UL )                                /*!< Read: Disabled */
#define UARTE_INTENCLR_TXDRDY_Enabled        ( 1UL )                                /*!< Read: Enabled */
#define UARTE_INTENCLR_TXDRDY_Clear          ( 1UL )                                /*!< Disable */

/* Bit 4 : Write '1' to disable interrupt for event ENDRX */
#define UARTE_INTENCLR_ENDRX_Pos             ( 4UL )                               /*!< Position of ENDRX field. */
#define UARTE_INTENCLR_ENDRX_Msk             ( 0x1UL << UARTE_INTENCLR_ENDRX_Pos ) /*!< Bit mask of ENDRX field. */
#define UARTE_INTENCLR_ENDRX_Disabled        ( 0UL )                               /*!< Read: Disabled */
#define UARTE_INTENCLR_ENDRX_Enabled         ( 1UL )                               /*!< Read: Enabled */
#define UARTE_INTENCLR_ENDRX_Clear           ( 1UL )                               /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event RXDRDY */
#define UARTE_INTENCLR_RXDRDY_Pos            ( 2UL )                                /*!< Position of RXDRDY field. */
#define UARTE_INTENCLR_RXDRDY_Msk            ( 0x1UL << UARTE_INTENCLR_RXDRDY_Pos ) /*!< Bit mask of RXDRDY field. */
#define UARTE_INTENCLR_RXDRDY_Disabled       ( 0UL )                                /*!< Read: Disabled */
#define UARTE_INTENCLR_RXDRDY_Enabled        ( 1UL )                                /*!< Read: Enabled */
#define UARTE_INTENCLR_RXDRDY_Clear          ( 1UL )                                /*!< Disable */

