FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Register: UICR_APPROTECT */
/* Description: Access port protection */

/* Bits 7..0 : Enable or disable access port protection. */
#define UICR_APPROTECT_PALL_Pos           ( 0UL )                               /*!< Position of PALL field. */
#define UICR_APPROTECT_PALL_Msk           ( 0xFFUL << UICR_APPROTECT_PALL_Pos ) /*!< Bit mask of PALL field. */
#define UICR_APPROTECT_PALL_Enabled       ( 0x00UL )                            /*!< Enable */
#define UICR_APPROTECT_PALL_HwDisabled    ( 0x5AUL )                            /*!< Hardware disable of access port protection for devices where access port protection is controlled by hardware and software */
#define UICR_APPROTECT_PALL_Disabled      ( 0xFFUL )                            /*!< Hardware disable of access port protection for devices where access port protection is controlled by hardware */

/* Register: UICR_DEBUGCTRL */
/* Description: Processor debug control */

/* Bits 15..8 : Configure CPU flash patch and breakpoint (FPB) unit behavior */
#define UICR_DEBUGCTRL_CPUFPBEN_Pos         ( 8UL )                                   /*!< Position of CPUFPBEN field. */
#define UICR_DEBUGCTRL_CPUFPBEN_Msk         ( 0xFFUL << UICR_DEBUGCTRL_CPUFPBEN_Pos ) /*!< Bit mask of CPUFPBEN field. */
#define UICR_DEBUGCTRL_CPUFPBEN_Disabled    ( 0x00UL )                                /*!< Disable CPU FPB unit. Writes into the FPB registers will be ignored. */
#define UICR_DEBUGCTRL_CPUFPBEN_Enabled     ( 0xFFUL )                                /*!< Enable CPU FPB unit (default behavior) */

/* Register: UICR_REGOUT0 */
/* Description: Output voltage from REG0 regulator stage. The maximum output voltage from this stage is given as VDDH - V_VDDH-VDD. */

/* Bits 2..0 : Output voltage from REG0 regulator stage. */
#define UICR_REGOUT0_VOUT_Pos        ( 0UL )                            /*!< Position of VOUT field. */
#define UICR_REGOUT0_VOUT_Msk        ( 0x7UL << UICR_REGOUT0_VOUT_Pos ) /*!< Bit mask of VOUT field. */
#define UICR_REGOUT0_VOUT_1V8        ( 0UL )                            /*!< 1.8 V */
#define UICR_REGOUT0_VOUT_2V1        ( 1UL )                            /*!< 2.1 V */
#define UICR_REGOUT0_VOUT_2V4        ( 2UL )                            /*!< 2.4 V */
#define UICR_REGOUT0_VOUT_2V7        ( 3UL )                            /*!< 2.7 V */
#define UICR_REGOUT0_VOUT_3V0        ( 4UL )                            /*!< 3.0 V */
#define UICR_REGOUT0_VOUT_3V3        ( 5UL )                            /*!< 3.3 V */
#define UICR_REGOUT0_VOUT_DEFAULT    ( 7UL )                            /*!< Default voltage: 1.8 V */


/* Peripheral: USBD */
/* Description: Universal serial bus device */

/* Register: USBD_TASKS_STARTEPIN */
/* Description: Description collection: Captures the EPIN[n].PTR and EPIN[n].MAXCNT registers values, and enables endpoint IN n to respond to traffic from host */

/* Bit 0 : Captures the EPIN[n].PTR and EPIN[n].MAXCNT registers values, and enables endpoint IN n to respond to traffic from host */
#define USBD_TASKS_STARTEPIN_TASKS_STARTEPIN_Pos        ( 0UL )                                               /*!< Position of TASKS_STARTEPIN field. */
#define USBD_TASKS_STARTEPIN_TASKS_STARTEPIN_Msk        ( 0x1UL << USBD_TASKS_STARTEPIN_TASKS_STARTEPIN_Pos ) /*!< Bit mask of TASKS_STARTEPIN field. */
#define USBD_TASKS_STARTEPIN_TASKS_STARTEPIN_Trigger    ( 1UL )                                               /*!< Trigger task */

/* Register: USBD_TASKS_STARTISOIN */
/* Description: Captures the ISOIN.PTR and ISOIN.MAXCNT registers values, and enables sending data on ISO endpoint */

/* Bit 0 : Captures the ISOIN.PTR and ISOIN.MAXCNT registers values, and enables sending data on ISO endpoint */
#define USBD_TASKS_STARTISOIN_TASKS_STARTISOIN_Pos        ( 0UL )                                                 /*!< Position of TASKS_STARTISOIN field. */
#define USBD_TASKS_STARTISOIN_TASKS_STARTISOIN_Msk        ( 0x1UL << USBD_TASKS_STARTISOIN_TASKS_STARTISOIN_Pos ) /*!< Bit mask of TASKS_STARTISOIN field. */
#define USBD_TASKS_STARTISOIN_TASKS_STARTISOIN_Trigger    ( 1UL )                                                 /*!< Trigger task */

/* Register: USBD_TASKS_STARTEPOUT */
/* Description: Description collection: Captures the EPOUT[n].PTR and EPOUT[n].MAXCNT registers values, and enables endpoint n to respond to traffic from host */

/* Bit 0 : Captures the EPOUT[n].PTR and EPOUT[n].MAXCNT registers values, and enables endpoint n to respond to traffic from host */
#define USBD_TASKS_STARTEPOUT_TASKS_STARTEPOUT_Pos        ( 0UL )                                                 /*!< Position of TASKS_STARTEPOUT field. */
#define USBD_TASKS_STARTEPOUT_TASKS_STARTEPOUT_Msk        ( 0x1UL << USBD_TASKS_STARTEPOUT_TASKS_STARTEPOUT_Pos ) /*!< Bit mask of TASKS_STARTEPOUT field. */
#define USBD_TASKS_STARTEPOUT_TASKS_STARTEPOUT_Trigger    ( 1UL )                                                 /*!< Trigger task */

/* Register: USBD_TASKS_STARTISOOUT */
/* Description: Captures the ISOOUT.PTR and ISOOUT.MAXCNT registers values, and enables receiving of data on ISO endpoint */

/* Bit 0 : Captures the ISOOUT.PTR and ISOOUT.MAXCNT registers values, and enables receiving of data on ISO endpoint */
#define USBD_TASKS_STARTISOOUT_TASKS_STARTISOOUT_Pos        ( 0UL )                                                   /*!< Position of TASKS_STARTISOOUT field. */
#define USBD_TASKS_STARTISOOUT_TASKS_STARTISOOUT_Msk        ( 0x1UL << USBD_TASKS_STARTISOOUT_TASKS_STARTISOOUT_Pos ) /*!< Bit mask of TASKS_STARTISOOUT field. */
#define USBD_TASKS_STARTISOOUT_TASKS_STARTISOOUT_Trigger    ( 1UL )                                                   /*!< Trigger task */

/* Register: USBD_TASKS_EP0RCVOUT */
/* Description: Allows OUT data stage on control endpoint 0 */

/* Bit 0 : Allows OUT data stage on control endpoint 0 */
#define USBD_TASKS_EP0RCVOUT_TASKS_EP0RCVOUT_Pos        ( 0UL )                                               /*!< Position of TASKS_EP0RCVOUT field. */
#define USBD_TASKS_EP0RCVOUT_TASKS_EP0RCVOUT_Msk        ( 0x1UL << USBD_TASKS_EP0RCVOUT_TASKS_EP0RCVOUT_Pos ) /*!< Bit mask of TASKS_EP0RCVOUT field. */
#define USBD_TASKS_EP0RCVOUT_TASKS_EP0RCVOUT_Trigger    ( 1UL )                                               /*!< Trigger task */

/* Register: USBD_TASKS_EP0STATUS */
/* Description: Allows status stage on control endpoint 0 */

/* Bit 0 : Allows status stage on control endpoint 0 */
#define USBD_TASKS_EP0STATUS_TASKS_EP0STATUS_Pos        ( 0UL )                                               /*!< Position of TASKS_EP0STATUS field. */
#define USBD_TASKS_EP0STATUS_TASKS_EP0STATUS_Msk        ( 0x1UL << USBD_TASKS_EP0STATUS_TASKS_EP0STATUS_Pos ) /*!< Bit mask of TASKS_EP0STATUS field. */
#define USBD_TASKS_EP0STATUS_TASKS_EP0STATUS_Trigger    ( 1UL )                                               /*!< Trigger task */

