FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bit 10 : Write '1' to enable interrupt for event EP0DATADONE */
#define USBD_INTENSET_EP0DATADONE_Pos         ( 10UL )                                   /*!< Position of EP0DATADONE field. */
#define USBD_INTENSET_EP0DATADONE_Msk         ( 0x1UL << USBD_INTENSET_EP0DATADONE_Pos ) /*!< Bit mask of EP0DATADONE field. */
#define USBD_INTENSET_EP0DATADONE_Disabled    ( 0UL )                                    /*!< Read: Disabled */
#define USBD_INTENSET_EP0DATADONE_Enabled     ( 1UL )                                    /*!< Read: Enabled */
#define USBD_INTENSET_EP0DATADONE_Set         ( 1UL )                                    /*!< Enable */

/* Bit 9 : Write '1' to enable interrupt for event ENDEPIN[7] */
#define USBD_INTENSET_ENDEPIN7_Pos            ( 9UL )                                 /*!< Position of ENDEPIN7 field. */
#define USBD_INTENSET_ENDEPIN7_Msk            ( 0x1UL << USBD_INTENSET_ENDEPIN7_Pos ) /*!< Bit mask of ENDEPIN7 field. */
#define USBD_INTENSET_ENDEPIN7_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define USBD_INTENSET_ENDEPIN7_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define USBD_INTENSET_ENDEPIN7_Set            ( 1UL )                                 /*!< Enable */

/* Bit 8 : Write '1' to enable interrupt for event ENDEPIN[6] */
#define USBD_INTENSET_ENDEPIN6_Pos            ( 8UL )                                 /*!< Position of ENDEPIN6 field. */
#define USBD_INTENSET_ENDEPIN6_Msk            ( 0x1UL << USBD_INTENSET_ENDEPIN6_Pos ) /*!< Bit mask of ENDEPIN6 field. */
#define USBD_INTENSET_ENDEPIN6_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define USBD_INTENSET_ENDEPIN6_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define USBD_INTENSET_ENDEPIN6_Set            ( 1UL )                                 /*!< Enable */

/* Bit 7 : Write '1' to enable interrupt for event ENDEPIN[5] */
#define USBD_INTENSET_ENDEPIN5_Pos            ( 7UL )                                 /*!< Position of ENDEPIN5 field. */
#define USBD_INTENSET_ENDEPIN5_Msk            ( 0x1UL << USBD_INTENSET_ENDEPIN5_Pos ) /*!< Bit mask of ENDEPIN5 field. */
#define USBD_INTENSET_ENDEPIN5_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define USBD_INTENSET_ENDEPIN5_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define USBD_INTENSET_ENDEPIN5_Set            ( 1UL )                                 /*!< Enable */

/* Bit 6 : Write '1' to enable interrupt for event ENDEPIN[4] */
#define USBD_INTENSET_ENDEPIN4_Pos            ( 6UL )                                 /*!< Position of ENDEPIN4 field. */
#define USBD_INTENSET_ENDEPIN4_Msk            ( 0x1UL << USBD_INTENSET_ENDEPIN4_Pos ) /*!< Bit mask of ENDEPIN4 field. */
#define USBD_INTENSET_ENDEPIN4_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define USBD_INTENSET_ENDEPIN4_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define USBD_INTENSET_ENDEPIN4_Set            ( 1UL )                                 /*!< Enable */

/* Bit 5 : Write '1' to enable interrupt for event ENDEPIN[3] */
#define USBD_INTENSET_ENDEPIN3_Pos            ( 5UL )                                 /*!< Position of ENDEPIN3 field. */
#define USBD_INTENSET_ENDEPIN3_Msk            ( 0x1UL << USBD_INTENSET_ENDEPIN3_Pos ) /*!< Bit mask of ENDEPIN3 field. */
#define USBD_INTENSET_ENDEPIN3_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define USBD_INTENSET_ENDEPIN3_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define USBD_INTENSET_ENDEPIN3_Set            ( 1UL )                                 /*!< Enable */

/* Bit 4 : Write '1' to enable interrupt for event ENDEPIN[2] */
#define USBD_INTENSET_ENDEPIN2_Pos            ( 4UL )                                 /*!< Position of ENDEPIN2 field. */
#define USBD_INTENSET_ENDEPIN2_Msk            ( 0x1UL << USBD_INTENSET_ENDEPIN2_Pos ) /*!< Bit mask of ENDEPIN2 field. */
#define USBD_INTENSET_ENDEPIN2_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define USBD_INTENSET_ENDEPIN2_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define USBD_INTENSET_ENDEPIN2_Set            ( 1UL )                                 /*!< Enable */

/* Bit 3 : Write '1' to enable interrupt for event ENDEPIN[1] */
#define USBD_INTENSET_ENDEPIN1_Pos            ( 3UL )                                 /*!< Position of ENDEPIN1 field. */
#define USBD_INTENSET_ENDEPIN1_Msk            ( 0x1UL << USBD_INTENSET_ENDEPIN1_Pos ) /*!< Bit mask of ENDEPIN1 field. */
#define USBD_INTENSET_ENDEPIN1_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define USBD_INTENSET_ENDEPIN1_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define USBD_INTENSET_ENDEPIN1_Set            ( 1UL )                                 /*!< Enable */

/* Bit 2 : Write '1' to enable interrupt for event ENDEPIN[0] */
#define USBD_INTENSET_ENDEPIN0_Pos            ( 2UL )                                 /*!< Position of ENDEPIN0 field. */
#define USBD_INTENSET_ENDEPIN0_Msk            ( 0x1UL << USBD_INTENSET_ENDEPIN0_Pos ) /*!< Bit mask of ENDEPIN0 field. */
#define USBD_INTENSET_ENDEPIN0_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define USBD_INTENSET_ENDEPIN0_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define USBD_INTENSET_ENDEPIN0_Set            ( 1UL )                                 /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event STARTED */
#define USBD_INTENSET_STARTED_Pos             ( 1UL )                                /*!< Position of STARTED field. */
#define USBD_INTENSET_STARTED_Msk             ( 0x1UL << USBD_INTENSET_STARTED_Pos ) /*!< Bit mask of STARTED field. */
#define USBD_INTENSET_STARTED_Disabled        ( 0UL )                                /*!< Read: Disabled */
#define USBD_INTENSET_STARTED_Enabled         ( 1UL )                                /*!< Read: Enabled */
#define USBD_INTENSET_STARTED_Set             ( 1UL )                                /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event USBRESET */
#define USBD_INTENSET_USBRESET_Pos            ( 0UL )                                 /*!< Position of USBRESET field. */
#define USBD_INTENSET_USBRESET_Msk            ( 0x1UL << USBD_INTENSET_USBRESET_Pos ) /*!< Bit mask of USBRESET field. */
#define USBD_INTENSET_USBRESET_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define USBD_INTENSET_USBRESET_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define USBD_INTENSET_USBRESET_Set            ( 1UL )                                 /*!< Enable */

/* Register: USBD_INTENCLR */
/* Description: Disable interrupt */

/* Bit 24 : Write '1' to disable interrupt for event EPDATA */
#define USBD_INTENCLR_EPDATA_Pos              ( 24UL )                              /*!< Position of EPDATA field. */
#define USBD_INTENCLR_EPDATA_Msk              ( 0x1UL << USBD_INTENCLR_EPDATA_Pos ) /*!< Bit mask of EPDATA field. */
#define USBD_INTENCLR_EPDATA_Disabled         ( 0UL )                               /*!< Read: Disabled */
#define USBD_INTENCLR_EPDATA_Enabled          ( 1UL )                               /*!< Read: Enabled */
#define USBD_INTENCLR_EPDATA_Clear            ( 1UL )                               /*!< Disable */

/* Bit 23 : Write '1' to disable interrupt for event EP0SETUP */
#define USBD_INTENCLR_EP0SETUP_Pos            ( 23UL )                                /*!< Position of EP0SETUP field. */
#define USBD_INTENCLR_EP0SETUP_Msk            ( 0x1UL << USBD_INTENCLR_EP0SETUP_Pos ) /*!< Bit mask of EP0SETUP field. */
#define USBD_INTENCLR_EP0SETUP_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define USBD_INTENCLR_EP0SETUP_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define USBD_INTENCLR_EP0SETUP_Clear          ( 1UL )                                 /*!< Disable */

/* Bit 22 : Write '1' to disable interrupt for event USBEVENT */
#define USBD_INTENCLR_USBEVENT_Pos            ( 22UL )                                /*!< Position of USBEVENT field. */
#define USBD_INTENCLR_USBEVENT_Msk            ( 0x1UL << USBD_INTENCLR_USBEVENT_Pos ) /*!< Bit mask of USBEVENT field. */
#define USBD_INTENCLR_USBEVENT_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define USBD_INTENCLR_USBEVENT_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define USBD_INTENCLR_USBEVENT_Clear          ( 1UL )                                 /*!< Disable */

