FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bits 15..0 : IN endpoint halted status. Can be used as is as response to a GetStatus() request to endpoint. */
#define USBD_HALTED_EPIN_GETSTATUS_Pos          ( 0UL )                                        /*!< Position of GETSTATUS field. */
#define USBD_HALTED_EPIN_GETSTATUS_Msk          ( 0xFFFFUL << USBD_HALTED_EPIN_GETSTATUS_Pos ) /*!< Bit mask of GETSTATUS field. */
#define USBD_HALTED_EPIN_GETSTATUS_NotHalted    ( 0UL )                                        /*!< Endpoint is not halted */
#define USBD_HALTED_EPIN_GETSTATUS_Halted       ( 1UL )                                        /*!< Endpoint is halted */

/* Register: USBD_HALTED_EPOUT */
/* Description: Description collection: OUT endpoint halted status. Can be used as is as response to a GetStatus() request to endpoint. */

/* Bits 15..0 : OUT endpoint halted status. Can be used as is as response to a GetStatus() request to endpoint. */
#define USBD_HALTED_EPOUT_GETSTATUS_Pos          ( 0UL )                                         /*!< Position of GETSTATUS field. */
#define USBD_HALTED_EPOUT_GETSTATUS_Msk          ( 0xFFFFUL << USBD_HALTED_EPOUT_GETSTATUS_Pos ) /*!< Bit mask of GETSTATUS field. */
#define USBD_HALTED_EPOUT_GETSTATUS_NotHalted    ( 0UL )                                         /*!< Endpoint is not halted */
#define USBD_HALTED_EPOUT_GETSTATUS_Halted       ( 1UL )                                         /*!< Endpoint is halted */

/* Register: USBD_EPSTATUS */
/* Description: Provides information on which endpoint's EasyDMA registers have been captured */

/* Bit 24 : Captured state of endpoint's EasyDMA registers. Write '1' to clear. */
#define USBD_EPSTATUS_EPOUT8_Pos         ( 24UL )                              /*!< Position of EPOUT8 field. */
#define USBD_EPSTATUS_EPOUT8_Msk         ( 0x1UL << USBD_EPSTATUS_EPOUT8_Pos ) /*!< Bit mask of EPOUT8 field. */
#define USBD_EPSTATUS_EPOUT8_NoData      ( 0UL )                               /*!< EasyDMA registers have not been captured for this endpoint */
#define USBD_EPSTATUS_EPOUT8_DataDone    ( 1UL )                               /*!< EasyDMA registers have been captured for this endpoint */

/* Bit 23 : Captured state of endpoint's EasyDMA registers. Write '1' to clear. */
#define USBD_EPSTATUS_EPOUT7_Pos         ( 23UL )                              /*!< Position of EPOUT7 field. */
#define USBD_EPSTATUS_EPOUT7_Msk         ( 0x1UL << USBD_EPSTATUS_EPOUT7_Pos ) /*!< Bit mask of EPOUT7 field. */
#define USBD_EPSTATUS_EPOUT7_NoData      ( 0UL )                               /*!< EasyDMA registers have not been captured for this endpoint */
#define USBD_EPSTATUS_EPOUT7_DataDone    ( 1UL )                               /*!< EasyDMA registers have been captured for this endpoint */

/* Bit 22 : Captured state of endpoint's EasyDMA registers. Write '1' to clear. */
#define USBD_EPSTATUS_EPOUT6_Pos         ( 22UL )                              /*!< Position of EPOUT6 field. */
#define USBD_EPSTATUS_EPOUT6_Msk         ( 0x1UL << USBD_EPSTATUS_EPOUT6_Pos ) /*!< Bit mask of EPOUT6 field. */
#define USBD_EPSTATUS_EPOUT6_NoData      ( 0UL )                               /*!< EasyDMA registers have not been captured for this endpoint */
#define USBD_EPSTATUS_EPOUT6_DataDone    ( 1UL )                               /*!< EasyDMA registers have been captured for this endpoint */

/* Bit 21 : Captured state of endpoint's EasyDMA registers. Write '1' to clear. */
#define USBD_EPSTATUS_EPOUT5_Pos         ( 21UL )                              /*!< Position of EPOUT5 field. */
#define USBD_EPSTATUS_EPOUT5_Msk         ( 0x1UL << USBD_EPSTATUS_EPOUT5_Pos ) /*!< Bit mask of EPOUT5 field. */
#define USBD_EPSTATUS_EPOUT5_NoData      ( 0UL )                               /*!< EasyDMA registers have not been captured for this endpoint */
#define USBD_EPSTATUS_EPOUT5_DataDone    ( 1UL )                               /*!< EasyDMA registers have been captured for this endpoint */

/* Bit 20 : Captured state of endpoint's EasyDMA registers. Write '1' to clear. */
#define USBD_EPSTATUS_EPOUT4_Pos         ( 20UL )                              /*!< Position of EPOUT4 field. */
#define USBD_EPSTATUS_EPOUT4_Msk         ( 0x1UL << USBD_EPSTATUS_EPOUT4_Pos ) /*!< Bit mask of EPOUT4 field. */
#define USBD_EPSTATUS_EPOUT4_NoData      ( 0UL )                               /*!< EasyDMA registers have not been captured for this endpoint */
#define USBD_EPSTATUS_EPOUT4_DataDone    ( 1UL )                               /*!< EasyDMA registers have been captured for this endpoint */

/* Bit 19 : Captured state of endpoint's EasyDMA registers. Write '1' to clear. */
#define USBD_EPSTATUS_EPOUT3_Pos         ( 19UL )                              /*!< Position of EPOUT3 field. */
#define USBD_EPSTATUS_EPOUT3_Msk         ( 0x1UL << USBD_EPSTATUS_EPOUT3_Pos ) /*!< Bit mask of EPOUT3 field. */
#define USBD_EPSTATUS_EPOUT3_NoData      ( 0UL )                               /*!< EasyDMA registers have not been captured for this endpoint */
#define USBD_EPSTATUS_EPOUT3_DataDone    ( 1UL )                               /*!< EasyDMA registers have been captured for this endpoint */

/* Bit 18 : Captured state of endpoint's EasyDMA registers. Write '1' to clear. */
#define USBD_EPSTATUS_EPOUT2_Pos         ( 18UL )                              /*!< Position of EPOUT2 field. */
#define USBD_EPSTATUS_EPOUT2_Msk         ( 0x1UL << USBD_EPSTATUS_EPOUT2_Pos ) /*!< Bit mask of EPOUT2 field. */
#define USBD_EPSTATUS_EPOUT2_NoData      ( 0UL )                               /*!< EasyDMA registers have not been captured for this endpoint */
#define USBD_EPSTATUS_EPOUT2_DataDone    ( 1UL )                               /*!< EasyDMA registers have been captured for this endpoint */

/* Bit 17 : Captured state of endpoint's EasyDMA registers. Write '1' to clear. */
#define USBD_EPSTATUS_EPOUT1_Pos         ( 17UL )                              /*!< Position of EPOUT1 field. */
#define USBD_EPSTATUS_EPOUT1_Msk         ( 0x1UL << USBD_EPSTATUS_EPOUT1_Pos ) /*!< Bit mask of EPOUT1 field. */
#define USBD_EPSTATUS_EPOUT1_NoData      ( 0UL )                               /*!< EasyDMA registers have not been captured for this endpoint */
#define USBD_EPSTATUS_EPOUT1_DataDone    ( 1UL )                               /*!< EasyDMA registers have been captured for this endpoint */

