FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bit 16 : Captured state of endpoint's EasyDMA registers. Write '1' to clear. */
#define USBD_EPSTATUS_EPOUT0_Pos         ( 16UL )                              /*!< Position of EPOUT0 field. */
#define USBD_EPSTATUS_EPOUT0_Msk         ( 0x1UL << USBD_EPSTATUS_EPOUT0_Pos ) /*!< Bit mask of EPOUT0 field. */
#define USBD_EPSTATUS_EPOUT0_NoData      ( 0UL )                               /*!< EasyDMA registers have not been captured for this endpoint */
#define USBD_EPSTATUS_EPOUT0_DataDone    ( 1UL )                               /*!< EasyDMA registers have been captured for this endpoint */

/* Bit 8 : Captured state of endpoint's EasyDMA registers. Write '1' to clear. */
#define USBD_EPSTATUS_EPIN8_Pos          ( 8UL )                              /*!< Position of EPIN8 field. */
#define USBD_EPSTATUS_EPIN8_Msk          ( 0x1UL << USBD_EPSTATUS_EPIN8_Pos ) /*!< Bit mask of EPIN8 field. */
#define USBD_EPSTATUS_EPIN8_NoData       ( 0UL )                              /*!< EasyDMA registers have not been captured for this endpoint */
#define USBD_EPSTATUS_EPIN8_DataDone     ( 1UL )                              /*!< EasyDMA registers have been captured for this endpoint */

/* Bit 7 : Captured state of endpoint's EasyDMA registers. Write '1' to clear. */
#define USBD_EPSTATUS_EPIN7_Pos          ( 7UL )                              /*!< Position of EPIN7 field. */
#define USBD_EPSTATUS_EPIN7_Msk          ( 0x1UL << USBD_EPSTATUS_EPIN7_Pos ) /*!< Bit mask of EPIN7 field. */
#define USBD_EPSTATUS_EPIN7_NoData       ( 0UL )                              /*!< EasyDMA registers have not been captured for this endpoint */
#define USBD_EPSTATUS_EPIN7_DataDone     ( 1UL )                              /*!< EasyDMA registers have been captured for this endpoint */

/* Bit 6 : Captured state of endpoint's EasyDMA registers. Write '1' to clear. */
#define USBD_EPSTATUS_EPIN6_Pos          ( 6UL )                              /*!< Position of EPIN6 field. */
#define USBD_EPSTATUS_EPIN6_Msk          ( 0x1UL << USBD_EPSTATUS_EPIN6_Pos ) /*!< Bit mask of EPIN6 field. */
#define USBD_EPSTATUS_EPIN6_NoData       ( 0UL )                              /*!< EasyDMA registers have not been captured for this endpoint */
#define USBD_EPSTATUS_EPIN6_DataDone     ( 1UL )                              /*!< EasyDMA registers have been captured for this endpoint */

/* Bit 5 : Captured state of endpoint's EasyDMA registers. Write '1' to clear. */
#define USBD_EPSTATUS_EPIN5_Pos          ( 5UL )                              /*!< Position of EPIN5 field. */
#define USBD_EPSTATUS_EPIN5_Msk          ( 0x1UL << USBD_EPSTATUS_EPIN5_Pos ) /*!< Bit mask of EPIN5 field. */
#define USBD_EPSTATUS_EPIN5_NoData       ( 0UL )                              /*!< EasyDMA registers have not been captured for this endpoint */
#define USBD_EPSTATUS_EPIN5_DataDone     ( 1UL )                              /*!< EasyDMA registers have been captured for this endpoint */

/* Bit 4 : Captured state of endpoint's EasyDMA registers. Write '1' to clear. */
#define USBD_EPSTATUS_EPIN4_Pos          ( 4UL )                              /*!< Position of EPIN4 field. */
#define USBD_EPSTATUS_EPIN4_Msk          ( 0x1UL << USBD_EPSTATUS_EPIN4_Pos ) /*!< Bit mask of EPIN4 field. */
#define USBD_EPSTATUS_EPIN4_NoData       ( 0UL )                              /*!< EasyDMA registers have not been captured for this endpoint */
#define USBD_EPSTATUS_EPIN4_DataDone     ( 1UL )                              /*!< EasyDMA registers have been captured for this endpoint */

/* Bit 3 : Captured state of endpoint's EasyDMA registers. Write '1' to clear. */
#define USBD_EPSTATUS_EPIN3_Pos          ( 3UL )                              /*!< Position of EPIN3 field. */
#define USBD_EPSTATUS_EPIN3_Msk          ( 0x1UL << USBD_EPSTATUS_EPIN3_Pos ) /*!< Bit mask of EPIN3 field. */
#define USBD_EPSTATUS_EPIN3_NoData       ( 0UL )                              /*!< EasyDMA registers have not been captured for this endpoint */
#define USBD_EPSTATUS_EPIN3_DataDone     ( 1UL )                              /*!< EasyDMA registers have been captured for this endpoint */

/* Bit 2 : Captured state of endpoint's EasyDMA registers. Write '1' to clear. */
#define USBD_EPSTATUS_EPIN2_Pos          ( 2UL )                              /*!< Position of EPIN2 field. */
#define USBD_EPSTATUS_EPIN2_Msk          ( 0x1UL << USBD_EPSTATUS_EPIN2_Pos ) /*!< Bit mask of EPIN2 field. */
#define USBD_EPSTATUS_EPIN2_NoData       ( 0UL )                              /*!< EasyDMA registers have not been captured for this endpoint */
#define USBD_EPSTATUS_EPIN2_DataDone     ( 1UL )                              /*!< EasyDMA registers have been captured for this endpoint */

/* Bit 1 : Captured state of endpoint's EasyDMA registers. Write '1' to clear. */
#define USBD_EPSTATUS_EPIN1_Pos          ( 1UL )                              /*!< Position of EPIN1 field. */
#define USBD_EPSTATUS_EPIN1_Msk          ( 0x1UL << USBD_EPSTATUS_EPIN1_Pos ) /*!< Bit mask of EPIN1 field. */
#define USBD_EPSTATUS_EPIN1_NoData       ( 0UL )                              /*!< EasyDMA registers have not been captured for this endpoint */
#define USBD_EPSTATUS_EPIN1_DataDone     ( 1UL )                              /*!< EasyDMA registers have been captured for this endpoint */

/* Bit 0 : Captured state of endpoint's EasyDMA registers. Write '1' to clear. */
#define USBD_EPSTATUS_EPIN0_Pos          ( 0UL )                              /*!< Position of EPIN0 field. */
#define USBD_EPSTATUS_EPIN0_Msk          ( 0x1UL << USBD_EPSTATUS_EPIN0_Pos ) /*!< Bit mask of EPIN0 field. */
#define USBD_EPSTATUS_EPIN0_NoData       ( 0UL )                              /*!< EasyDMA registers have not been captured for this endpoint */
#define USBD_EPSTATUS_EPIN0_DataDone     ( 1UL )                              /*!< EasyDMA registers have been captured for this endpoint */

/* Register: USBD_EPDATASTATUS */
/* Description: Provides information on which endpoint(s) an acknowledged data transfer has occurred (EPDATA event) */

/* Bit 23 : Acknowledged data transfer on this OUT endpoint. Write '1' to clear. */
#define USBD_EPDATASTATUS_EPOUT7_Pos           ( 23UL )                                  /*!< Position of EPOUT7 field. */
#define USBD_EPDATASTATUS_EPOUT7_Msk           ( 0x1UL << USBD_EPDATASTATUS_EPOUT7_Pos ) /*!< Bit mask of EPOUT7 field. */
#define USBD_EPDATASTATUS_EPOUT7_NotStarted    ( 0UL )                                   /*!< No acknowledged data transfer on this endpoint */
#define USBD_EPDATASTATUS_EPOUT7_Started       ( 1UL )                                   /*!< Acknowledged data transfer on this endpoint has occurred */

/* Bit 22 : Acknowledged data transfer on this OUT endpoint. Write '1' to clear. */
#define USBD_EPDATASTATUS_EPOUT6_Pos           ( 22UL )                                  /*!< Position of EPOUT6 field. */
#define USBD_EPDATASTATUS_EPOUT6_Msk           ( 0x1UL << USBD_EPDATASTATUS_EPOUT6_Pos ) /*!< Bit mask of EPOUT6 field. */
#define USBD_EPDATASTATUS_EPOUT6_NotStarted    ( 0UL )                                   /*!< No acknowledged data transfer on this endpoint */
#define USBD_EPDATASTATUS_EPOUT6_Started       ( 1UL )                                   /*!< Acknowledged data transfer on this endpoint has occurred */

/* Bit 21 : Acknowledged data transfer on this OUT endpoint. Write '1' to clear. */
#define USBD_EPDATASTATUS_EPOUT5_Pos           ( 21UL )                                  /*!< Position of EPOUT5 field. */
#define USBD_EPDATASTATUS_EPOUT5_Msk           ( 0x1UL << USBD_EPDATASTATUS_EPOUT5_Pos ) /*!< Bit mask of EPOUT5 field. */
#define USBD_EPDATASTATUS_EPOUT5_NotStarted    ( 0UL )                                   /*!< No acknowledged data transfer on this endpoint */
#define USBD_EPDATASTATUS_EPOUT5_Started       ( 1UL )                                   /*!< Acknowledged data transfer on this endpoint has occurred */

