FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bit 20 : Acknowledged data transfer on this OUT endpoint. Write '1' to clear. */
#define USBD_EPDATASTATUS_EPOUT4_Pos           ( 20UL )                                  /*!< Position of EPOUT4 field. */
#define USBD_EPDATASTATUS_EPOUT4_Msk           ( 0x1UL << USBD_EPDATASTATUS_EPOUT4_Pos ) /*!< Bit mask of EPOUT4 field. */
#define USBD_EPDATASTATUS_EPOUT4_NotStarted    ( 0UL )                                   /*!< No acknowledged data transfer on this endpoint */
#define USBD_EPDATASTATUS_EPOUT4_Started       ( 1UL )                                   /*!< Acknowledged data transfer on this endpoint has occurred */

/* Bit 19 : Acknowledged data transfer on this OUT endpoint. Write '1' to clear. */
#define USBD_EPDATASTATUS_EPOUT3_Pos           ( 19UL )                                  /*!< Position of EPOUT3 field. */
#define USBD_EPDATASTATUS_EPOUT3_Msk           ( 0x1UL << USBD_EPDATASTATUS_EPOUT3_Pos ) /*!< Bit mask of EPOUT3 field. */
#define USBD_EPDATASTATUS_EPOUT3_NotStarted    ( 0UL )                                   /*!< No acknowledged data transfer on this endpoint */
#define USBD_EPDATASTATUS_EPOUT3_Started       ( 1UL )                                   /*!< Acknowledged data transfer on this endpoint has occurred */

/* Bit 18 : Acknowledged data transfer on this OUT endpoint. Write '1' to clear. */
#define USBD_EPDATASTATUS_EPOUT2_Pos           ( 18UL )                                  /*!< Position of EPOUT2 field. */
#define USBD_EPDATASTATUS_EPOUT2_Msk           ( 0x1UL << USBD_EPDATASTATUS_EPOUT2_Pos ) /*!< Bit mask of EPOUT2 field. */
#define USBD_EPDATASTATUS_EPOUT2_NotStarted    ( 0UL )                                   /*!< No acknowledged data transfer on this endpoint */
#define USBD_EPDATASTATUS_EPOUT2_Started       ( 1UL )                                   /*!< Acknowledged data transfer on this endpoint has occurred */

/* Bit 17 : Acknowledged data transfer on this OUT endpoint. Write '1' to clear. */
#define USBD_EPDATASTATUS_EPOUT1_Pos           ( 17UL )                                  /*!< Position of EPOUT1 field. */
#define USBD_EPDATASTATUS_EPOUT1_Msk           ( 0x1UL << USBD_EPDATASTATUS_EPOUT1_Pos ) /*!< Bit mask of EPOUT1 field. */
#define USBD_EPDATASTATUS_EPOUT1_NotStarted    ( 0UL )                                   /*!< No acknowledged data transfer on this endpoint */
#define USBD_EPDATASTATUS_EPOUT1_Started       ( 1UL )                                   /*!< Acknowledged data transfer on this endpoint has occurred */

/* Bit 7 : Acknowledged data transfer on this IN endpoint. Write '1' to clear. */
#define USBD_EPDATASTATUS_EPIN7_Pos            ( 7UL )                                  /*!< Position of EPIN7 field. */
#define USBD_EPDATASTATUS_EPIN7_Msk            ( 0x1UL << USBD_EPDATASTATUS_EPIN7_Pos ) /*!< Bit mask of EPIN7 field. */
#define USBD_EPDATASTATUS_EPIN7_NotDone        ( 0UL )                                  /*!< No acknowledged data transfer on this endpoint */
#define USBD_EPDATASTATUS_EPIN7_DataDone       ( 1UL )                                  /*!< Acknowledged data transfer on this endpoint has occurred */

/* Bit 6 : Acknowledged data transfer on this IN endpoint. Write '1' to clear. */
#define USBD_EPDATASTATUS_EPIN6_Pos            ( 6UL )                                  /*!< Position of EPIN6 field. */
#define USBD_EPDATASTATUS_EPIN6_Msk            ( 0x1UL << USBD_EPDATASTATUS_EPIN6_Pos ) /*!< Bit mask of EPIN6 field. */
#define USBD_EPDATASTATUS_EPIN6_NotDone        ( 0UL )                                  /*!< No acknowledged data transfer on this endpoint */
#define USBD_EPDATASTATUS_EPIN6_DataDone       ( 1UL )                                  /*!< Acknowledged data transfer on this endpoint has occurred */

/* Bit 5 : Acknowledged data transfer on this IN endpoint. Write '1' to clear. */
#define USBD_EPDATASTATUS_EPIN5_Pos            ( 5UL )                                  /*!< Position of EPIN5 field. */
#define USBD_EPDATASTATUS_EPIN5_Msk            ( 0x1UL << USBD_EPDATASTATUS_EPIN5_Pos ) /*!< Bit mask of EPIN5 field. */
#define USBD_EPDATASTATUS_EPIN5_NotDone        ( 0UL )                                  /*!< No acknowledged data transfer on this endpoint */
#define USBD_EPDATASTATUS_EPIN5_DataDone       ( 1UL )                                  /*!< Acknowledged data transfer on this endpoint has occurred */

/* Bit 4 : Acknowledged data transfer on this IN endpoint. Write '1' to clear. */
#define USBD_EPDATASTATUS_EPIN4_Pos            ( 4UL )                                  /*!< Position of EPIN4 field. */
#define USBD_EPDATASTATUS_EPIN4_Msk            ( 0x1UL << USBD_EPDATASTATUS_EPIN4_Pos ) /*!< Bit mask of EPIN4 field. */
#define USBD_EPDATASTATUS_EPIN4_NotDone        ( 0UL )                                  /*!< No acknowledged data transfer on this endpoint */
#define USBD_EPDATASTATUS_EPIN4_DataDone       ( 1UL )                                  /*!< Acknowledged data transfer on this endpoint has occurred */

/* Bit 3 : Acknowledged data transfer on this IN endpoint. Write '1' to clear. */
#define USBD_EPDATASTATUS_EPIN3_Pos            ( 3UL )                                  /*!< Position of EPIN3 field. */
#define USBD_EPDATASTATUS_EPIN3_Msk            ( 0x1UL << USBD_EPDATASTATUS_EPIN3_Pos ) /*!< Bit mask of EPIN3 field. */
#define USBD_EPDATASTATUS_EPIN3_NotDone        ( 0UL )                                  /*!< No acknowledged data transfer on this endpoint */
#define USBD_EPDATASTATUS_EPIN3_DataDone       ( 1UL )                                  /*!< Acknowledged data transfer on this endpoint has occurred */

/* Bit 2 : Acknowledged data transfer on this IN endpoint. Write '1' to clear. */
#define USBD_EPDATASTATUS_EPIN2_Pos            ( 2UL )                                  /*!< Position of EPIN2 field. */
#define USBD_EPDATASTATUS_EPIN2_Msk            ( 0x1UL << USBD_EPDATASTATUS_EPIN2_Pos ) /*!< Bit mask of EPIN2 field. */
#define USBD_EPDATASTATUS_EPIN2_NotDone        ( 0UL )                                  /*!< No acknowledged data transfer on this endpoint */
#define USBD_EPDATASTATUS_EPIN2_DataDone       ( 1UL )                                  /*!< Acknowledged data transfer on this endpoint has occurred */

/* Bit 1 : Acknowledged data transfer on this IN endpoint. Write '1' to clear. */
#define USBD_EPDATASTATUS_EPIN1_Pos            ( 1UL )                                  /*!< Position of EPIN1 field. */
#define USBD_EPDATASTATUS_EPIN1_Msk            ( 0x1UL << USBD_EPDATASTATUS_EPIN1_Pos ) /*!< Bit mask of EPIN1 field. */
#define USBD_EPDATASTATUS_EPIN1_NotDone        ( 0UL )                                  /*!< No acknowledged data transfer on this endpoint */
#define USBD_EPDATASTATUS_EPIN1_DataDone       ( 1UL )                                  /*!< Acknowledged data transfer on this endpoint has occurred */

