FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Register: USBD_USBADDR */
/* Description: Device USB address */

/* Bits 6..0 : Device USB address */
#define USBD_USBADDR_ADDR_Pos    ( 0UL )                             /*!< Position of ADDR field. */
#define USBD_USBADDR_ADDR_Msk    ( 0x7FUL << USBD_USBADDR_ADDR_Pos ) /*!< Bit mask of ADDR field. */

/* Register: USBD_BMREQUESTTYPE */
/* Description: SETUP data, byte 0, bmRequestType */

/* Bit 7 : Data transfer direction */
#define USBD_BMREQUESTTYPE_DIRECTION_Pos             ( 7UL )                                       /*!< Position of DIRECTION field. */
#define USBD_BMREQUESTTYPE_DIRECTION_Msk             ( 0x1UL << USBD_BMREQUESTTYPE_DIRECTION_Pos ) /*!< Bit mask of DIRECTION field. */
#define USBD_BMREQUESTTYPE_DIRECTION_HostToDevice    ( 0UL )                                       /*!< Host-to-device */
#define USBD_BMREQUESTTYPE_DIRECTION_DeviceToHost    ( 1UL )                                       /*!< Device-to-host */

/* Bits 6..5 : Data transfer type */
#define USBD_BMREQUESTTYPE_TYPE_Pos                  ( 5UL )                                  /*!< Position of TYPE field. */
#define USBD_BMREQUESTTYPE_TYPE_Msk                  ( 0x3UL << USBD_BMREQUESTTYPE_TYPE_Pos ) /*!< Bit mask of TYPE field. */
#define USBD_BMREQUESTTYPE_TYPE_Standard             ( 0UL )                                  /*!< Standard */
#define USBD_BMREQUESTTYPE_TYPE_Class                ( 1UL )                                  /*!< Class */
#define USBD_BMREQUESTTYPE_TYPE_Vendor               ( 2UL )                                  /*!< Vendor */

/* Bits 4..0 : Data transfer type */
#define USBD_BMREQUESTTYPE_RECIPIENT_Pos             ( 0UL )                                        /*!< Position of RECIPIENT field. */
#define USBD_BMREQUESTTYPE_RECIPIENT_Msk             ( 0x1FUL << USBD_BMREQUESTTYPE_RECIPIENT_Pos ) /*!< Bit mask of RECIPIENT field. */
#define USBD_BMREQUESTTYPE_RECIPIENT_Device          ( 0UL )                                        /*!< Device */
#define USBD_BMREQUESTTYPE_RECIPIENT_Interface       ( 1UL )                                        /*!< Interface */
#define USBD_BMREQUESTTYPE_RECIPIENT_Endpoint        ( 2UL )                                        /*!< Endpoint */
#define USBD_BMREQUESTTYPE_RECIPIENT_Other           ( 3UL )                                        /*!< Other */

/* Register: USBD_BREQUEST */
/* Description: SETUP data, byte 1, bRequest */

/* Bits 7..0 : SETUP data, byte 1, bRequest. Values provided for standard requests only, user must implement class and vendor values. */
#define USBD_BREQUEST_BREQUEST_Pos                      ( 0UL )                                  /*!< Position of BREQUEST field. */
#define USBD_BREQUEST_BREQUEST_Msk                      ( 0xFFUL << USBD_BREQUEST_BREQUEST_Pos ) /*!< Bit mask of BREQUEST field. */
#define USBD_BREQUEST_BREQUEST_STD_GET_STATUS           ( 0UL )                                  /*!< Standard request GET_STATUS */
#define USBD_BREQUEST_BREQUEST_STD_CLEAR_FEATURE        ( 1UL )                                  /*!< Standard request CLEAR_FEATURE */
#define USBD_BREQUEST_BREQUEST_STD_SET_FEATURE          ( 3UL )                                  /*!< Standard request SET_FEATURE */
#define USBD_BREQUEST_BREQUEST_STD_SET_ADDRESS          ( 5UL )                                  /*!< Standard request SET_ADDRESS */
#define USBD_BREQUEST_BREQUEST_STD_GET_DESCRIPTOR       ( 6UL )                                  /*!< Standard request GET_DESCRIPTOR */
#define USBD_BREQUEST_BREQUEST_STD_SET_DESCRIPTOR       ( 7UL )                                  /*!< Standard request SET_DESCRIPTOR */
#define USBD_BREQUEST_BREQUEST_STD_GET_CONFIGURATION    ( 8UL )                                  /*!< Standard request GET_CONFIGURATION */
#define USBD_BREQUEST_BREQUEST_STD_SET_CONFIGURATION    ( 9UL )                                  /*!< Standard request SET_CONFIGURATION */
#define USBD_BREQUEST_BREQUEST_STD_GET_INTERFACE        ( 10UL )                                 /*!< Standard request GET_INTERFACE */
#define USBD_BREQUEST_BREQUEST_STD_SET_INTERFACE        ( 11UL )                                 /*!< Standard request SET_INTERFACE */
#define USBD_BREQUEST_BREQUEST_STD_SYNCH_FRAME          ( 12UL )                                 /*!< Standard request SYNCH_FRAME */

/* Register: USBD_WVALUEL */
/* Description: SETUP data, byte 2, LSB of wValue */

/* Bits 7..0 : SETUP data, byte 2, LSB of wValue */
#define USBD_WVALUEL_WVALUEL_Pos    ( 0UL )                                /*!< Position of WVALUEL field. */
#define USBD_WVALUEL_WVALUEL_Msk    ( 0xFFUL << USBD_WVALUEL_WVALUEL_Pos ) /*!< Bit mask of WVALUEL field. */

/* Register: USBD_WVALUEH */
/* Description: SETUP data, byte 3, MSB of wValue */

/* Bits 7..0 : SETUP data, byte 3, MSB of wValue */
#define USBD_WVALUEH_WVALUEH_Pos    ( 0UL )                                /*!< Position of WVALUEH field. */
#define USBD_WVALUEH_WVALUEH_Msk    ( 0xFFUL << USBD_WVALUEH_WVALUEH_Pos ) /*!< Bit mask of WVALUEH field. */

/* Register: USBD_WINDEXL */
/* Description: SETUP data, byte 4, LSB of wIndex */

/* Bits 7..0 : SETUP data, byte 4, LSB of wIndex */
#define USBD_WINDEXL_WINDEXL_Pos    ( 0UL )                                /*!< Position of WINDEXL field. */
#define USBD_WINDEXL_WINDEXL_Msk    ( 0xFFUL << USBD_WINDEXL_WINDEXL_Pos ) /*!< Bit mask of WINDEXL field. */

/* Register: USBD_WINDEXH */
/* Description: SETUP data, byte 5, MSB of wIndex */

/* Bits 7..0 : SETUP data, byte 5, MSB of wIndex */
#define USBD_WINDEXH_WINDEXH_Pos    ( 0UL )                                /*!< Position of WINDEXH field. */
#define USBD_WINDEXH_WINDEXH_Msk    ( 0xFFUL << USBD_WINDEXH_WINDEXH_Pos ) /*!< Bit mask of WINDEXH field. */

/* Register: USBD_WLENGTHL */
/* Description: SETUP data, byte 6, LSB of wLength */

/* Bits 7..0 : SETUP data, byte 6, LSB of wLength */
#define USBD_WLENGTHL_WLENGTHL_Pos    ( 0UL )                                  /*!< Position of WLENGTHL field. */
#define USBD_WLENGTHL_WLENGTHL_Msk    ( 0xFFUL << USBD_WLENGTHL_WLENGTHL_Pos ) /*!< Bit mask of WLENGTHL field. */

/* Register: USBD_WLENGTHH */
/* Description: SETUP data, byte 7, MSB of wLength */

/* Bits 7..0 : SETUP data, byte 7, MSB of wLength */
#define USBD_WLENGTHH_WLENGTHH_Pos    ( 0UL )                                  /*!< Position of WLENGTHH field. */
#define USBD_WLENGTHH_WLENGTHH_Msk    ( 0xFFUL << USBD_WLENGTHH_WLENGTHH_Pos ) /*!< Bit mask of WLENGTHH field. */

/* Register: USBD_SIZE_EPOUT */
/* Description: Description collection: Number of bytes received last in the data stage of this OUT endpoint */

