FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bit 7 : Enable OUT endpoint 7 */
#define USBD_EPOUTEN_OUT7_Pos          ( 7UL )                            /*!< Position of OUT7 field. */
#define USBD_EPOUTEN_OUT7_Msk          ( 0x1UL << USBD_EPOUTEN_OUT7_Pos ) /*!< Bit mask of OUT7 field. */
#define USBD_EPOUTEN_OUT7_Disable      ( 0UL )                            /*!< Disable endpoint OUT 7 (no response to OUT tokens) */
#define USBD_EPOUTEN_OUT7_Enable       ( 1UL )                            /*!< Enable endpoint OUT 7 (response to OUT tokens) */

/* Bit 6 : Enable OUT endpoint 6 */
#define USBD_EPOUTEN_OUT6_Pos          ( 6UL )                            /*!< Position of OUT6 field. */
#define USBD_EPOUTEN_OUT6_Msk          ( 0x1UL << USBD_EPOUTEN_OUT6_Pos ) /*!< Bit mask of OUT6 field. */
#define USBD_EPOUTEN_OUT6_Disable      ( 0UL )                            /*!< Disable endpoint OUT 6 (no response to OUT tokens) */
#define USBD_EPOUTEN_OUT6_Enable       ( 1UL )                            /*!< Enable endpoint OUT 6 (response to OUT tokens) */

/* Bit 5 : Enable OUT endpoint 5 */
#define USBD_EPOUTEN_OUT5_Pos          ( 5UL )                            /*!< Position of OUT5 field. */
#define USBD_EPOUTEN_OUT5_Msk          ( 0x1UL << USBD_EPOUTEN_OUT5_Pos ) /*!< Bit mask of OUT5 field. */
#define USBD_EPOUTEN_OUT5_Disable      ( 0UL )                            /*!< Disable endpoint OUT 5 (no response to OUT tokens) */
#define USBD_EPOUTEN_OUT5_Enable       ( 1UL )                            /*!< Enable endpoint OUT 5 (response to OUT tokens) */

/* Bit 4 : Enable OUT endpoint 4 */
#define USBD_EPOUTEN_OUT4_Pos          ( 4UL )                            /*!< Position of OUT4 field. */
#define USBD_EPOUTEN_OUT4_Msk          ( 0x1UL << USBD_EPOUTEN_OUT4_Pos ) /*!< Bit mask of OUT4 field. */
#define USBD_EPOUTEN_OUT4_Disable      ( 0UL )                            /*!< Disable endpoint OUT 4 (no response to OUT tokens) */
#define USBD_EPOUTEN_OUT4_Enable       ( 1UL )                            /*!< Enable endpoint OUT 4 (response to OUT tokens) */

/* Bit 3 : Enable OUT endpoint 3 */
#define USBD_EPOUTEN_OUT3_Pos          ( 3UL )                            /*!< Position of OUT3 field. */
#define USBD_EPOUTEN_OUT3_Msk          ( 0x1UL << USBD_EPOUTEN_OUT3_Pos ) /*!< Bit mask of OUT3 field. */
#define USBD_EPOUTEN_OUT3_Disable      ( 0UL )                            /*!< Disable endpoint OUT 3 (no response to OUT tokens) */
#define USBD_EPOUTEN_OUT3_Enable       ( 1UL )                            /*!< Enable endpoint OUT 3 (response to OUT tokens) */

/* Bit 2 : Enable OUT endpoint 2 */
#define USBD_EPOUTEN_OUT2_Pos          ( 2UL )                            /*!< Position of OUT2 field. */
#define USBD_EPOUTEN_OUT2_Msk          ( 0x1UL << USBD_EPOUTEN_OUT2_Pos ) /*!< Bit mask of OUT2 field. */
#define USBD_EPOUTEN_OUT2_Disable      ( 0UL )                            /*!< Disable endpoint OUT 2 (no response to OUT tokens) */
#define USBD_EPOUTEN_OUT2_Enable       ( 1UL )                            /*!< Enable endpoint OUT 2 (response to OUT tokens) */

/* Bit 1 : Enable OUT endpoint 1 */
#define USBD_EPOUTEN_OUT1_Pos          ( 1UL )                            /*!< Position of OUT1 field. */
#define USBD_EPOUTEN_OUT1_Msk          ( 0x1UL << USBD_EPOUTEN_OUT1_Pos ) /*!< Bit mask of OUT1 field. */
#define USBD_EPOUTEN_OUT1_Disable      ( 0UL )                            /*!< Disable endpoint OUT 1 (no response to OUT tokens) */
#define USBD_EPOUTEN_OUT1_Enable       ( 1UL )                            /*!< Enable endpoint OUT 1 (response to OUT tokens) */

/* Bit 0 : Enable OUT endpoint 0 */
#define USBD_EPOUTEN_OUT0_Pos          ( 0UL )                            /*!< Position of OUT0 field. */
#define USBD_EPOUTEN_OUT0_Msk          ( 0x1UL << USBD_EPOUTEN_OUT0_Pos ) /*!< Bit mask of OUT0 field. */
#define USBD_EPOUTEN_OUT0_Disable      ( 0UL )                            /*!< Disable endpoint OUT 0 (no response to OUT tokens) */
#define USBD_EPOUTEN_OUT0_Enable       ( 1UL )                            /*!< Enable endpoint OUT 0 (response to OUT tokens) */

/* Register: USBD_EPSTALL */
/* Description: STALL endpoints */

/* Bit 8 : Stall selected endpoint */
#define USBD_EPSTALL_STALL_Pos        ( 8UL )                             /*!< Position of STALL field. */
#define USBD_EPSTALL_STALL_Msk        ( 0x1UL << USBD_EPSTALL_STALL_Pos ) /*!< Bit mask of STALL field. */
#define USBD_EPSTALL_STALL_UnStall    ( 0UL )                             /*!< Don't stall selected endpoint */
#define USBD_EPSTALL_STALL_Stall      ( 1UL )                             /*!< Stall selected endpoint */

/* Bit 7 : Selects IN or OUT endpoint */
#define USBD_EPSTALL_IO_Pos           ( 7UL )                          /*!< Position of IO field. */
#define USBD_EPSTALL_IO_Msk           ( 0x1UL << USBD_EPSTALL_IO_Pos ) /*!< Bit mask of IO field. */
#define USBD_EPSTALL_IO_Out           ( 0UL )                          /*!< Selects OUT endpoint */
#define USBD_EPSTALL_IO_In            ( 1UL )                          /*!< Selects IN endpoint */

/* Bits 2..0 : Select endpoint number */
#define USBD_EPSTALL_EP_Pos           ( 0UL )                          /*!< Position of EP field. */
#define USBD_EPSTALL_EP_Msk           ( 0x7UL << USBD_EPSTALL_EP_Pos ) /*!< Bit mask of EP field. */

/* Register: USBD_ISOSPLIT */
/* Description: Controls the split of ISO buffers */

/* Bits 15..0 : Controls the split of ISO buffers */
#define USBD_ISOSPLIT_SPLIT_Pos       ( 0UL )                                 /*!< Position of SPLIT field. */
#define USBD_ISOSPLIT_SPLIT_Msk       ( 0xFFFFUL << USBD_ISOSPLIT_SPLIT_Pos ) /*!< Bit mask of SPLIT field. */
#define USBD_ISOSPLIT_SPLIT_OneDir    ( 0x0000UL )                            /*!< Full buffer dedicated to either ISO IN or OUT */
#define USBD_ISOSPLIT_SPLIT_HalfIN    ( 0x0080UL )                            /*!< Lower half for IN, upper half for OUT */

/* Register: USBD_FRAMECNTR */
/* Description: Returns the current value of the start of frame counter */

/* Bits 10..0 : Returns the current value of the start of frame counter */
#define USBD_FRAMECNTR_FRAMECNTR_Pos    ( 0UL )                                     /*!< Position of FRAMECNTR field. */
#define USBD_FRAMECNTR_FRAMECNTR_Msk    ( 0x7FFUL << USBD_FRAMECNTR_FRAMECNTR_Pos ) /*!< Bit mask of FRAMECNTR field. */

