FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_NTZ_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf52820_bitfields.h
/* Bit 2 : Enable or disable RR[2] register */
#define WDT_RREN_RR2_Pos         ( 2UL )                       /*!< Position of RR2 field. */
#define WDT_RREN_RR2_Msk         ( 0x1UL << WDT_RREN_RR2_Pos ) /*!< Bit mask of RR2 field. */
#define WDT_RREN_RR2_Disabled    ( 0UL )                       /*!< Disable RR[2] register */
#define WDT_RREN_RR2_Enabled     ( 1UL )                       /*!< Enable RR[2] register */

/* Bit 1 : Enable or disable RR[1] register */
#define WDT_RREN_RR1_Pos         ( 1UL )                       /*!< Position of RR1 field. */
#define WDT_RREN_RR1_Msk         ( 0x1UL << WDT_RREN_RR1_Pos ) /*!< Bit mask of RR1 field. */
#define WDT_RREN_RR1_Disabled    ( 0UL )                       /*!< Disable RR[1] register */
#define WDT_RREN_RR1_Enabled     ( 1UL )                       /*!< Enable RR[1] register */

/* Bit 0 : Enable or disable RR[0] register */
#define WDT_RREN_RR0_Pos         ( 0UL )                       /*!< Position of RR0 field. */
#define WDT_RREN_RR0_Msk         ( 0x1UL << WDT_RREN_RR0_Pos ) /*!< Bit mask of RR0 field. */
#define WDT_RREN_RR0_Disabled    ( 0UL )                       /*!< Disable RR[0] register */
#define WDT_RREN_RR0_Enabled     ( 1UL )                       /*!< Enable RR[0] register */

/* Register: WDT_CONFIG */
/* Description: Configuration register */

/* Bit 3 : Configure the watchdog to either be paused, or kept running, while the CPU is halted by the debugger */
#define WDT_CONFIG_HALT_Pos       ( 3UL )                          /*!< Position of HALT field. */
#define WDT_CONFIG_HALT_Msk       ( 0x1UL << WDT_CONFIG_HALT_Pos ) /*!< Bit mask of HALT field. */
#define WDT_CONFIG_HALT_Pause     ( 0UL )                          /*!< Pause watchdog while the CPU is halted by the debugger */
#define WDT_CONFIG_HALT_Run       ( 1UL )                          /*!< Keep the watchdog running while the CPU is halted by the debugger */

/* Bit 0 : Configure the watchdog to either be paused, or kept running, while the CPU is sleeping */
#define WDT_CONFIG_SLEEP_Pos      ( 0UL )                           /*!< Position of SLEEP field. */
#define WDT_CONFIG_SLEEP_Msk      ( 0x1UL << WDT_CONFIG_SLEEP_Pos ) /*!< Bit mask of SLEEP field. */
#define WDT_CONFIG_SLEEP_Pause    ( 0UL )                           /*!< Pause watchdog while the CPU is sleeping */
#define WDT_CONFIG_SLEEP_Run      ( 1UL )                           /*!< Keep the watchdog running while the CPU is sleeping */

/* Register: WDT_RR */
/* Description: Description collection: Reload request n */

/* Bits 31..0 : Reload request register */
#define WDT_RR_RR_Pos       ( 0UL )                           /*!< Position of RR field. */
#define WDT_RR_RR_Msk       ( 0xFFFFFFFFUL << WDT_RR_RR_Pos ) /*!< Bit mask of RR field. */
#define WDT_RR_RR_Reload    ( 0x6E524635UL )                  /*!< Value to request a reload of the watchdog timer */


/*lint --flb "Leave library region" */
#endif /* ifndef __NRF52820_BITS_H */
